HomuraVehicle/homuraLib_v2/machine/device/p32mx795f512h_forVC.c
extern volatile __C1RXF0bits_t C1RXF0bits __asm__ ("C1RXF0") __attribute__((section("sfrs")));
extern volatile unsigned int        C1RXF0CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C1RXF0SET __attribute__((section("sfrs")));
extern volatile unsigned int        C1RXF0INV __attribute__((section("sfrs")));
extern volatile unsigned int        C1RXF1 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned EID:18;
    unsigned :1;
    unsigned EXID:1;
    unsigned :1;
    unsigned SID:11;
  };
  struct {
    unsigned w:32;
  };
} __C1RXF1bits_t;
extern volatile __C1RXF1bits_t C1RXF1bits __asm__ ("C1RXF1") __attribute__((section("sfrs")));
extern volatile unsigned int        C1RXF1CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C1RXF1SET __attribute__((section("sfrs")));
extern volatile unsigned int        C1RXF1INV __attribute__((section("sfrs")));
extern volatile unsigned int        C1RXF2 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned EID:18;
    unsigned :1;
    unsigned EXID:1;
    unsigned :1;
    unsigned SID:11;
  };
  struct {
    unsigned w:32;
  };
} __C1RXF2bits_t;
extern volatile __C1RXF2bits_t C1RXF2bits __asm__ ("C1RXF2") __attribute__((section("sfrs")));
extern volatile unsigned int        C1RXF2CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C1RXF2SET __attribute__((section("sfrs")));
extern volatile unsigned int        C1RXF2INV __attribute__((section("sfrs")));
extern volatile unsigned int        C1RXF3 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned EID:18;
    unsigned :1;
    unsigned EXID:1;
    unsigned :1;
    unsigned SID:11;
  };
  struct {
    unsigned w:32;
  };
} __C1RXF3bits_t;
extern volatile __C1RXF3bits_t C1RXF3bits __asm__ ("C1RXF3") __attribute__((section("sfrs")));
extern volatile unsigned int        C1RXF3CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C1RXF3SET __attribute__((section("sfrs")));
extern volatile unsigned int        C1RXF3INV __attribute__((section("sfrs")));
extern volatile unsigned int        C1RXF4 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned EID:18;
    unsigned :1;
    unsigned EXID:1;
    unsigned :1;
    unsigned SID:11;
  };
  struct {
    unsigned w:32;
  };
} __C1RXF4bits_t;
extern volatile __C1RXF4bits_t C1RXF4bits __asm__ ("C1RXF4") __attribute__((section("sfrs")));
extern volatile unsigned int        C1RXF4CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C1RXF4SET __attribute__((section("sfrs")));
extern volatile unsigned int        C1RXF4INV __attribute__((section("sfrs")));
extern volatile unsigned int        C1RXF5 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned EID:18;
    unsigned :1;
    unsigned EXID:1;
    unsigned :1;
    unsigned SID:11;
  };
  struct {
    unsigned w:32;
  };
} __C1RXF5bits_t;
extern volatile __C1RXF5bits_t C1RXF5bits __asm__ ("C1RXF5") __attribute__((section("sfrs")));
extern volatile unsigned int        C1RXF5CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C1RXF5SET __attribute__((section("sfrs")));
extern volatile unsigned int        C1RXF5INV __attribute__((section("sfrs")));
extern volatile unsigned int        C1RXF6 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned EID:18;
    unsigned :1;
    unsigned EXID:1;
    unsigned :1;
    unsigned SID:11;
  };
  struct {
    unsigned w:32;
  };
} __C1RXF6bits_t;
extern volatile __C1RXF6bits_t C1RXF6bits __asm__ ("C1RXF6") __attribute__((section("sfrs")));
extern volatile unsigned int        C1RXF6CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C1RXF6SET __attribute__((section("sfrs")));
extern volatile unsigned int        C1RXF6INV __attribute__((section("sfrs")));
extern volatile unsigned int        C1RXF7 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned EID:18;
    unsigned :1;
    unsigned EXID:1;
    unsigned :1;
    unsigned SID:11;
  };
  struct {
    unsigned w:32;
  };
} __C1RXF7bits_t;
extern volatile __C1RXF7bits_t C1RXF7bits __asm__ ("C1RXF7") __attribute__((section("sfrs")));
extern volatile unsigned int        C1RXF7CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C1RXF7SET __attribute__((section("sfrs")));
extern volatile unsigned int        C1RXF7INV __attribute__((section("sfrs")));
extern volatile unsigned int        C1RXF8 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned EID:18;
    unsigned :1;
    unsigned EXID:1;
    unsigned :1;
    unsigned SID:11;
  };
  struct {
    unsigned w:32;
  };
} __C1RXF8bits_t;
extern volatile __C1RXF8bits_t C1RXF8bits __asm__ ("C1RXF8") __attribute__((section("sfrs")));
extern volatile unsigned int        C1RXF8CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C1RXF8SET __attribute__((section("sfrs")));
extern volatile unsigned int        C1RXF8INV __attribute__((section("sfrs")));
extern volatile unsigned int        C1RXF9 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned EID:18;
    unsigned :1;
    unsigned EXID:1;
    unsigned :1;
    unsigned SID:11;
  };
  struct {
    unsigned w:32;
  };
} __C1RXF9bits_t;
extern volatile __C1RXF9bits_t C1RXF9bits __asm__ ("C1RXF9") __attribute__((section("sfrs")));
extern volatile unsigned int        C1RXF9CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C1RXF9SET __attribute__((section("sfrs")));
extern volatile unsigned int        C1RXF9INV __attribute__((section("sfrs")));
extern volatile unsigned int        C1RXF10 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned EID:18;
    unsigned :1;
    unsigned EXID:1;
    unsigned :1;
    unsigned SID:11;
  };
  struct {
    unsigned w:32;
  };
} __C1RXF10bits_t;
extern volatile __C1RXF10bits_t C1RXF10bits __asm__ ("C1RXF10") __attribute__((section("sfrs")));
extern volatile unsigned int        C1RXF10CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C1RXF10SET __attribute__((section("sfrs")));
extern volatile unsigned int        C1RXF10INV __attribute__((section("sfrs")));
extern volatile unsigned int        C1RXF11 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned EID:18;
    unsigned :1;
    unsigned EXID:1;
    unsigned :1;
    unsigned SID:11;
  };
  struct {
    unsigned w:32;
  };
} __C1RXF11bits_t;
extern volatile __C1RXF11bits_t C1RXF11bits __asm__ ("C1RXF11") __attribute__((section("sfrs")));
extern volatile unsigned int        C1RXF11CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C1RXF11SET __attribute__((section("sfrs")));
extern volatile unsigned int        C1RXF11INV __attribute__((section("sfrs")));
extern volatile unsigned int        C1RXF12 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned EID:18;
    unsigned :1;
    unsigned EXID:1;
    unsigned :1;
    unsigned SID:11;
  };
  struct {
    unsigned w:32;
  };
} __C1RXF12bits_t;
extern volatile __C1RXF12bits_t C1RXF12bits __asm__ ("C1RXF12") __attribute__((section("sfrs")));
extern volatile unsigned int        C1RXF12CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C1RXF12SET __attribute__((section("sfrs")));
extern volatile unsigned int        C1RXF12INV __attribute__((section("sfrs")));
extern volatile unsigned int        C1RXF13 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned EID:18;
    unsigned :1;
    unsigned EXID:1;
    unsigned :1;
    unsigned SID:11;
  };
  struct {
    unsigned w:32;
  };
} __C1RXF13bits_t;
extern volatile __C1RXF13bits_t C1RXF13bits __asm__ ("C1RXF13") __attribute__((section("sfrs")));
extern volatile unsigned int        C1RXF13CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C1RXF13SET __attribute__((section("sfrs")));
extern volatile unsigned int        C1RXF13INV __attribute__((section("sfrs")));
extern volatile unsigned int        C1RXF14 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned EID:18;
    unsigned :1;
    unsigned EXID:1;
    unsigned :1;
    unsigned SID:11;
  };
  struct {
    unsigned w:32;
  };
} __C1RXF14bits_t;
extern volatile __C1RXF14bits_t C1RXF14bits __asm__ ("C1RXF14") __attribute__((section("sfrs")));
extern volatile unsigned int        C1RXF14CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C1RXF14SET __attribute__((section("sfrs")));
extern volatile unsigned int        C1RXF14INV __attribute__((section("sfrs")));
extern volatile unsigned int        C1RXF15 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned EID:18;
    unsigned :1;
    unsigned EXID:1;
    unsigned :1;
    unsigned SID:11;
  };
  struct {
    unsigned w:32;
  };
} __C1RXF15bits_t;
extern volatile __C1RXF15bits_t C1RXF15bits __asm__ ("C1RXF15") __attribute__((section("sfrs")));
extern volatile unsigned int        C1RXF15CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C1RXF15SET __attribute__((section("sfrs")));
extern volatile unsigned int        C1RXF15INV __attribute__((section("sfrs")));
extern volatile unsigned int        C1RXF16 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned EID:18;
    unsigned :1;
    unsigned EXID:1;
    unsigned :1;
    unsigned SID:11;
  };
  struct {
    unsigned w:32;
  };
} __C1RXF16bits_t;
extern volatile __C1RXF16bits_t C1RXF16bits __asm__ ("C1RXF16") __attribute__((section("sfrs")));
extern volatile unsigned int        C1RXF16CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C1RXF16SET __attribute__((section("sfrs")));
extern volatile unsigned int        C1RXF16INV __attribute__((section("sfrs")));
extern volatile unsigned int        C1RXF17 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned EID:18;
    unsigned :1;
    unsigned EXID:1;
    unsigned :1;
    unsigned SID:11;
  };
  struct {
    unsigned w:32;
  };
} __C1RXF17bits_t;
extern volatile __C1RXF17bits_t C1RXF17bits __asm__ ("C1RXF17") __attribute__((section("sfrs")));
extern volatile unsigned int        C1RXF17CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C1RXF17SET __attribute__((section("sfrs")));
extern volatile unsigned int        C1RXF17INV __attribute__((section("sfrs")));
extern volatile unsigned int        C1RXF18 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned EID:18;
    unsigned :1;
    unsigned EXID:1;
    unsigned :1;
    unsigned SID:11;
  };
  struct {
    unsigned w:32;
  };
} __C1RXF18bits_t;
extern volatile __C1RXF18bits_t C1RXF18bits __asm__ ("C1RXF18") __attribute__((section("sfrs")));
extern volatile unsigned int        C1RXF18CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C1RXF18SET __attribute__((section("sfrs")));
extern volatile unsigned int        C1RXF18INV __attribute__((section("sfrs")));
extern volatile unsigned int        C1RXF19 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned EID:18;
    unsigned :1;
    unsigned EXID:1;
    unsigned :1;
    unsigned SID:11;
  };
  struct {
    unsigned w:32;
  };
} __C1RXF19bits_t;
extern volatile __C1RXF19bits_t C1RXF19bits __asm__ ("C1RXF19") __attribute__((section("sfrs")));
extern volatile unsigned int        C1RXF19CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C1RXF19SET __attribute__((section("sfrs")));
extern volatile unsigned int        C1RXF19INV __attribute__((section("sfrs")));
extern volatile unsigned int        C1RXF20 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned EID:18;
    unsigned :1;
    unsigned EXID:1;
    unsigned :1;
    unsigned SID:11;
  };
  struct {
    unsigned w:32;
  };
} __C1RXF20bits_t;
extern volatile __C1RXF20bits_t C1RXF20bits __asm__ ("C1RXF20") __attribute__((section("sfrs")));
extern volatile unsigned int        C1RXF20CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C1RXF20SET __attribute__((section("sfrs")));
extern volatile unsigned int        C1RXF20INV __attribute__((section("sfrs")));
extern volatile unsigned int        C1RXF21 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned EID:18;
    unsigned :1;
    unsigned EXID:1;
    unsigned :1;
    unsigned SID:11;
  };
  struct {
    unsigned w:32;
  };
} __C1RXF21bits_t;
extern volatile __C1RXF21bits_t C1RXF21bits __asm__ ("C1RXF21") __attribute__((section("sfrs")));
extern volatile unsigned int        C1RXF21CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C1RXF21SET __attribute__((section("sfrs")));
extern volatile unsigned int        C1RXF21INV __attribute__((section("sfrs")));
extern volatile unsigned int        C1RXF22 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned EID:18;
    unsigned :1;
    unsigned EXID:1;
    unsigned :1;
    unsigned SID:11;
  };
  struct {
    unsigned w:32;
  };
} __C1RXF22bits_t;
extern volatile __C1RXF22bits_t C1RXF22bits __asm__ ("C1RXF22") __attribute__((section("sfrs")));
extern volatile unsigned int        C1RXF22CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C1RXF22SET __attribute__((section("sfrs")));
extern volatile unsigned int        C1RXF22INV __attribute__((section("sfrs")));
extern volatile unsigned int        C1RXF23 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned EID:18;
    unsigned :1;
    unsigned EXID:1;
    unsigned :1;
    unsigned SID:11;
  };
  struct {
    unsigned w:32;
  };
} __C1RXF23bits_t;
extern volatile __C1RXF23bits_t C1RXF23bits __asm__ ("C1RXF23") __attribute__((section("sfrs")));
extern volatile unsigned int        C1RXF23CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C1RXF23SET __attribute__((section("sfrs")));
extern volatile unsigned int        C1RXF23INV __attribute__((section("sfrs")));
extern volatile unsigned int        C1RXF24 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned EID:18;
    unsigned :1;
    unsigned EXID:1;
    unsigned :1;
    unsigned SID:11;
  };
  struct {
    unsigned w:32;
  };
} __C1RXF24bits_t;
extern volatile __C1RXF24bits_t C1RXF24bits __asm__ ("C1RXF24") __attribute__((section("sfrs")));
extern volatile unsigned int        C1RXF24CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C1RXF24SET __attribute__((section("sfrs")));
extern volatile unsigned int        C1RXF24INV __attribute__((section("sfrs")));
extern volatile unsigned int        C1RXF25 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned EID:18;
    unsigned :1;
    unsigned EXID:1;
    unsigned :1;
    unsigned SID:11;
  };
  struct {
    unsigned w:32;
  };
} __C1RXF25bits_t;
extern volatile __C1RXF25bits_t C1RXF25bits __asm__ ("C1RXF25") __attribute__((section("sfrs")));
extern volatile unsigned int        C1RXF25CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C1RXF25SET __attribute__((section("sfrs")));
extern volatile unsigned int        C1RXF25INV __attribute__((section("sfrs")));
extern volatile unsigned int        C1RXF26 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned EID:18;
    unsigned :1;
    unsigned EXID:1;
    unsigned :1;
    unsigned SID:11;
  };
  struct {
    unsigned w:32;
  };
} __C1RXF26bits_t;
extern volatile __C1RXF26bits_t C1RXF26bits __asm__ ("C1RXF26") __attribute__((section("sfrs")));
extern volatile unsigned int        C1RXF26CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C1RXF26SET __attribute__((section("sfrs")));
extern volatile unsigned int        C1RXF26INV __attribute__((section("sfrs")));
extern volatile unsigned int        C1RXF27 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned EID:18;
    unsigned :1;
    unsigned EXID:1;
    unsigned :1;
    unsigned SID:11;
  };
  struct {
    unsigned w:32;
  };
} __C1RXF27bits_t;
extern volatile __C1RXF27bits_t C1RXF27bits __asm__ ("C1RXF27") __attribute__((section("sfrs")));
extern volatile unsigned int        C1RXF27CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C1RXF27SET __attribute__((section("sfrs")));
extern volatile unsigned int        C1RXF27INV __attribute__((section("sfrs")));
extern volatile unsigned int        C1RXF28 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned EID:18;
    unsigned :1;
    unsigned EXID:1;
    unsigned :1;
    unsigned SID:11;
  };
  struct {
    unsigned w:32;
  };
} __C1RXF28bits_t;
extern volatile __C1RXF28bits_t C1RXF28bits __asm__ ("C1RXF28") __attribute__((section("sfrs")));
extern volatile unsigned int        C1RXF28CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C1RXF28SET __attribute__((section("sfrs")));
extern volatile unsigned int        C1RXF28INV __attribute__((section("sfrs")));
extern volatile unsigned int        C1RXF29 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned EID:18;
    unsigned :1;
    unsigned EXID:1;
    unsigned :1;
    unsigned SID:11;
  };
  struct {
    unsigned w:32;
  };
} __C1RXF29bits_t;
extern volatile __C1RXF29bits_t C1RXF29bits __asm__ ("C1RXF29") __attribute__((section("sfrs")));
extern volatile unsigned int        C1RXF29CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C1RXF29SET __attribute__((section("sfrs")));
extern volatile unsigned int        C1RXF29INV __attribute__((section("sfrs")));
extern volatile unsigned int        C1RXF30 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned EID:18;
    unsigned :1;
    unsigned EXID:1;
    unsigned :1;
    unsigned SID:11;
  };
  struct {
    unsigned w:32;
  };
} __C1RXF30bits_t;
extern volatile __C1RXF30bits_t C1RXF30bits __asm__ ("C1RXF30") __attribute__((section("sfrs")));
extern volatile unsigned int        C1RXF30CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C1RXF30SET __attribute__((section("sfrs")));
extern volatile unsigned int        C1RXF30INV __attribute__((section("sfrs")));
extern volatile unsigned int        C1RXF31 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned EID:18;
    unsigned :1;
    unsigned EXID:1;
    unsigned :1;
    unsigned SID:11;
  };
  struct {
    unsigned w:32;
  };
} __C1RXF31bits_t;
extern volatile __C1RXF31bits_t C1RXF31bits __asm__ ("C1RXF31") __attribute__((section("sfrs")));
extern volatile unsigned int        C1RXF31CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C1RXF31SET __attribute__((section("sfrs")));
extern volatile unsigned int        C1RXF31INV __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOBA __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOBACLR __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOBASET __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOBAINV __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOCON0 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned TXPRI:2;
    unsigned RTREN:1;
    unsigned TXREQ:1;
    unsigned TXERR:1;
    unsigned TXLARB:1;
    unsigned TXABAT:1;
    unsigned TXEN:1;
    unsigned :4;
    unsigned DONLY:1;
    unsigned UINC:1;
    unsigned FRESET:1;
    unsigned :1;
    unsigned FSIZE:5;
  };
  struct {
    unsigned w:32;
  };
} __C1FIFOCON0bits_t;
extern volatile __C1FIFOCON0bits_t C1FIFOCON0bits __asm__ ("C1FIFOCON0") __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOCON0CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOCON0SET __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOCON0INV __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOINT0 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned RXNEMPTYIF:1;
    unsigned RXHALFIF:1;
    unsigned RXFULLIF:1;
    unsigned RXOVFLIF:1;
    unsigned :4;
    unsigned TXEMPTYIF:1;
    unsigned TXHALFIF:1;
    unsigned TXNFULLIF:1;
    unsigned :5;
    unsigned RXNEMPTYIE:1;
    unsigned RXHALFIE:1;
    unsigned RXFULLIE:1;
    unsigned RXOVFLIE:1;
    unsigned :4;
    unsigned TXEMPTYIE:1;
    unsigned TXHALFIE:1;
    unsigned TXNFULLIE:1;
  };
  struct {
    unsigned w:32;
  };
} __C1FIFOINT0bits_t;
extern volatile __C1FIFOINT0bits_t C1FIFOINT0bits __asm__ ("C1FIFOINT0") __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOINT0CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOINT0SET __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOINT0INV __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOUA0 __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOUA0CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOUA0SET __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOUA0INV __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOCI0 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned CFIFOCI:5;
  };
  struct {
    unsigned w:32;
  };
} __C1FIFOCI0bits_t;
