HomuraVehicle/homuraLib_v2/machine/device/p32mx795f512h_forVC.c
extern volatile __C1FIFOCON6bits_t C1FIFOCON6bits __asm__ ("C1FIFOCON6") __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOCON6CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOCON6SET __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOCON6INV __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOINT6 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned RXNEMPTYIF:1;
    unsigned RXHALFIF:1;
    unsigned RXFULLIF:1;
    unsigned RXOVFLIF:1;
    unsigned :4;
    unsigned TXEMPTYIF:1;
    unsigned TXHALFIF:1;
    unsigned TXNFULLIF:1;
    unsigned :5;
    unsigned RXNEMPTYIE:1;
    unsigned RXHALFIE:1;
    unsigned RXFULLIE:1;
    unsigned RXOVFLIE:1;
    unsigned :4;
    unsigned TXEMPTYIE:1;
    unsigned TXHALFIE:1;
    unsigned TXNFULLIE:1;
  };
  struct {
    unsigned w:32;
  };
} __C1FIFOINT6bits_t;
extern volatile __C1FIFOINT6bits_t C1FIFOINT6bits __asm__ ("C1FIFOINT6") __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOINT6CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOINT6SET __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOINT6INV __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOUA6 __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOUA6CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOUA6SET __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOUA6INV __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOCI6 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned CFIFOCI:5;
  };
  struct {
    unsigned w:32;
  };
} __C1FIFOCI6bits_t;
extern volatile __C1FIFOCI6bits_t C1FIFOCI6bits __asm__ ("C1FIFOCI6") __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOCI6CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOCI6SET __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOCI6INV __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOCON7 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned TXPRI:2;
    unsigned RTREN:1;
    unsigned TXREQ:1;
    unsigned TXERR:1;
    unsigned TXLARB:1;
    unsigned TXABAT:1;
    unsigned TXEN:1;
    unsigned :4;
    unsigned DONLY:1;
    unsigned UINC:1;
    unsigned FRESET:1;
    unsigned :1;
    unsigned FSIZE:5;
  };
  struct {
    unsigned w:32;
  };
} __C1FIFOCON7bits_t;
extern volatile __C1FIFOCON7bits_t C1FIFOCON7bits __asm__ ("C1FIFOCON7") __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOCON7CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOCON7SET __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOCON7INV __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOINT7 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned RXNEMPTYIF:1;
    unsigned RXHALFIF:1;
    unsigned RXFULLIF:1;
    unsigned RXOVFLIF:1;
    unsigned :4;
    unsigned TXEMPTYIF:1;
    unsigned TXHALFIF:1;
    unsigned TXNFULLIF:1;
    unsigned :5;
    unsigned RXNEMPTYIE:1;
    unsigned RXHALFIE:1;
    unsigned RXFULLIE:1;
    unsigned RXOVFLIE:1;
    unsigned :4;
    unsigned TXEMPTYIE:1;
    unsigned TXHALFIE:1;
    unsigned TXNFULLIE:1;
  };
  struct {
    unsigned w:32;
  };
} __C1FIFOINT7bits_t;
extern volatile __C1FIFOINT7bits_t C1FIFOINT7bits __asm__ ("C1FIFOINT7") __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOINT7CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOINT7SET __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOINT7INV __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOUA7 __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOUA7CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOUA7SET __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOUA7INV __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOCI7 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned CFIFOCI:5;
  };
  struct {
    unsigned w:32;
  };
} __C1FIFOCI7bits_t;
extern volatile __C1FIFOCI7bits_t C1FIFOCI7bits __asm__ ("C1FIFOCI7") __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOCI7CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOCI7SET __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOCI7INV __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOCON8 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned TXPRI:2;
    unsigned RTREN:1;
    unsigned TXREQ:1;
    unsigned TXERR:1;
    unsigned TXLARB:1;
    unsigned TXABAT:1;
    unsigned TXEN:1;
    unsigned :4;
    unsigned DONLY:1;
    unsigned UINC:1;
    unsigned FRESET:1;
    unsigned :1;
    unsigned FSIZE:5;
  };
  struct {
    unsigned w:32;
  };
} __C1FIFOCON8bits_t;
extern volatile __C1FIFOCON8bits_t C1FIFOCON8bits __asm__ ("C1FIFOCON8") __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOCON8CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOCON8SET __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOCON8INV __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOINT8 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned RXNEMPTYIF:1;
    unsigned RXHALFIF:1;
    unsigned RXFULLIF:1;
    unsigned RXOVFLIF:1;
    unsigned :4;
    unsigned TXEMPTYIF:1;
    unsigned TXHALFIF:1;
    unsigned TXNFULLIF:1;
    unsigned :5;
    unsigned RXNEMPTYIE:1;
    unsigned RXHALFIE:1;
    unsigned RXFULLIE:1;
    unsigned RXOVFLIE:1;
    unsigned :4;
    unsigned TXEMPTYIE:1;
    unsigned TXHALFIE:1;
    unsigned TXNFULLIE:1;
  };
  struct {
    unsigned w:32;
  };
} __C1FIFOINT8bits_t;
