HomuraVehicle/homuraLib_v2/machine/device/p32mx795f512h_forVC.c
extern volatile __C1FIFOINT8bits_t C1FIFOINT8bits __asm__ ("C1FIFOINT8") __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOINT8CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOINT8SET __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOINT8INV __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOUA8 __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOUA8CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOUA8SET __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOUA8INV __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOCI8 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned CFIFOCI:5;
  };
  struct {
    unsigned w:32;
  };
} __C1FIFOCI8bits_t;
extern volatile __C1FIFOCI8bits_t C1FIFOCI8bits __asm__ ("C1FIFOCI8") __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOCI8CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOCI8SET __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOCI8INV __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOCON9 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned TXPRI:2;
    unsigned RTREN:1;
    unsigned TXREQ:1;
    unsigned TXERR:1;
    unsigned TXLARB:1;
    unsigned TXABAT:1;
    unsigned TXEN:1;
    unsigned :4;
    unsigned DONLY:1;
    unsigned UINC:1;
    unsigned FRESET:1;
    unsigned :1;
    unsigned FSIZE:5;
  };
  struct {
    unsigned w:32;
  };
} __C1FIFOCON9bits_t;
extern volatile __C1FIFOCON9bits_t C1FIFOCON9bits __asm__ ("C1FIFOCON9") __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOCON9CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOCON9SET __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOCON9INV __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOINT9 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned RXNEMPTYIF:1;
    unsigned RXHALFIF:1;
    unsigned RXFULLIF:1;
    unsigned RXOVFLIF:1;
    unsigned :4;
    unsigned TXEMPTYIF:1;
    unsigned TXHALFIF:1;
    unsigned TXNFULLIF:1;
    unsigned :5;
    unsigned RXNEMPTYIE:1;
    unsigned RXHALFIE:1;
    unsigned RXFULLIE:1;
    unsigned RXOVFLIE:1;
    unsigned :4;
    unsigned TXEMPTYIE:1;
    unsigned TXHALFIE:1;
    unsigned TXNFULLIE:1;
  };
  struct {
    unsigned w:32;
  };
} __C1FIFOINT9bits_t;
extern volatile __C1FIFOINT9bits_t C1FIFOINT9bits __asm__ ("C1FIFOINT9") __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOINT9CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOINT9SET __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOINT9INV __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOUA9 __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOUA9CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOUA9SET __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOUA9INV __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOCI9 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned CFIFOCI:5;
  };
  struct {
    unsigned w:32;
  };
} __C1FIFOCI9bits_t;
extern volatile __C1FIFOCI9bits_t C1FIFOCI9bits __asm__ ("C1FIFOCI9") __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOCI9CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOCI9SET __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOCI9INV __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOCON10 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned TXPRI:2;
    unsigned RTREN:1;
    unsigned TXREQ:1;
    unsigned TXERR:1;
    unsigned TXLARB:1;
    unsigned TXABAT:1;
    unsigned TXEN:1;
    unsigned :4;
    unsigned DONLY:1;
    unsigned UINC:1;
    unsigned FRESET:1;
    unsigned :1;
    unsigned FSIZE:5;
  };
  struct {
    unsigned w:32;
  };
} __C1FIFOCON10bits_t;
extern volatile __C1FIFOCON10bits_t C1FIFOCON10bits __asm__ ("C1FIFOCON10") __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOCON10CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOCON10SET __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOCON10INV __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOINT10 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned RXNEMPTYIF:1;
    unsigned RXHALFIF:1;
    unsigned RXFULLIF:1;
    unsigned RXOVFLIF:1;
    unsigned :4;
    unsigned TXEMPTYIF:1;
    unsigned TXHALFIF:1;
    unsigned TXNFULLIF:1;
    unsigned :5;
    unsigned RXNEMPTYIE:1;
    unsigned RXHALFIE:1;
    unsigned RXFULLIE:1;
    unsigned RXOVFLIE:1;
    unsigned :4;
    unsigned TXEMPTYIE:1;
    unsigned TXHALFIE:1;
    unsigned TXNFULLIE:1;
  };
  struct {
    unsigned w:32;
  };
} __C1FIFOINT10bits_t;
extern volatile __C1FIFOINT10bits_t C1FIFOINT10bits __asm__ ("C1FIFOINT10") __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOINT10CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOINT10SET __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOINT10INV __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOUA10 __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOUA10CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOUA10SET __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOUA10INV __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOCI10 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned CFIFOCI:5;
  };
  struct {
    unsigned w:32;
  };
} __C1FIFOCI10bits_t;
extern volatile __C1FIFOCI10bits_t C1FIFOCI10bits __asm__ ("C1FIFOCI10") __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOCI10CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOCI10SET __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOCI10INV __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOCON11 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned TXPRI:2;
    unsigned RTREN:1;
    unsigned TXREQ:1;
    unsigned TXERR:1;
    unsigned TXLARB:1;
    unsigned TXABAT:1;
    unsigned TXEN:1;
    unsigned :4;
    unsigned DONLY:1;
    unsigned UINC:1;
    unsigned FRESET:1;
    unsigned :1;
    unsigned FSIZE:5;
  };
  struct {
    unsigned w:32;
  };
} __C1FIFOCON11bits_t;
extern volatile __C1FIFOCON11bits_t C1FIFOCON11bits __asm__ ("C1FIFOCON11") __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOCON11CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOCON11SET __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOCON11INV __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOINT11 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned RXNEMPTYIF:1;
    unsigned RXHALFIF:1;
    unsigned RXFULLIF:1;
    unsigned RXOVFLIF:1;
    unsigned :4;
    unsigned TXEMPTYIF:1;
    unsigned TXHALFIF:1;
    unsigned TXNFULLIF:1;
    unsigned :5;
    unsigned RXNEMPTYIE:1;
    unsigned RXHALFIE:1;
    unsigned RXFULLIE:1;
    unsigned RXOVFLIE:1;
    unsigned :4;
    unsigned TXEMPTYIE:1;
    unsigned TXHALFIE:1;
    unsigned TXNFULLIE:1;
  };
  struct {
    unsigned w:32;
  };
} __C1FIFOINT11bits_t;
extern volatile __C1FIFOINT11bits_t C1FIFOINT11bits __asm__ ("C1FIFOINT11") __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOINT11CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOINT11SET __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOINT11INV __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOUA11 __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOUA11CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOUA11SET __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOUA11INV __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOCI11 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned CFIFOCI:5;
  };
  struct {
    unsigned w:32;
  };
} __C1FIFOCI11bits_t;
extern volatile __C1FIFOCI11bits_t C1FIFOCI11bits __asm__ ("C1FIFOCI11") __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOCI11CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOCI11SET __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOCI11INV __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOCON12 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned TXPRI:2;
    unsigned RTREN:1;
    unsigned TXREQ:1;
    unsigned TXERR:1;
    unsigned TXLARB:1;
    unsigned TXABAT:1;
    unsigned TXEN:1;
    unsigned :4;
    unsigned DONLY:1;
    unsigned UINC:1;
    unsigned FRESET:1;
    unsigned :1;
    unsigned FSIZE:5;
  };
  struct {
    unsigned w:32;
  };
} __C1FIFOCON12bits_t;
