HomuraVehicle/homuraLib_v2/machine/device/p32mx795f512h_forVC.c
extern volatile __C1FIFOCON12bits_t C1FIFOCON12bits __asm__ ("C1FIFOCON12") __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOCON12CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOCON12SET __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOCON12INV __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOINT12 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned RXNEMPTYIF:1;
    unsigned RXHALFIF:1;
    unsigned RXFULLIF:1;
    unsigned RXOVFLIF:1;
    unsigned :4;
    unsigned TXEMPTYIF:1;
    unsigned TXHALFIF:1;
    unsigned TXNFULLIF:1;
    unsigned :5;
    unsigned RXNEMPTYIE:1;
    unsigned RXHALFIE:1;
    unsigned RXFULLIE:1;
    unsigned RXOVFLIE:1;
    unsigned :4;
    unsigned TXEMPTYIE:1;
    unsigned TXHALFIE:1;
    unsigned TXNFULLIE:1;
  };
  struct {
    unsigned w:32;
  };
} __C1FIFOINT12bits_t;
extern volatile __C1FIFOINT12bits_t C1FIFOINT12bits __asm__ ("C1FIFOINT12") __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOINT12CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOINT12SET __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOINT12INV __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOUA12 __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOUA12CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOUA12SET __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOUA12INV __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOCI12 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned CFIFOCI:5;
  };
  struct {
    unsigned w:32;
  };
} __C1FIFOCI12bits_t;
extern volatile __C1FIFOCI12bits_t C1FIFOCI12bits __asm__ ("C1FIFOCI12") __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOCI12CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOCI12SET __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOCI12INV __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOCON13 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned TXPRI:2;
    unsigned RTREN:1;
    unsigned TXREQ:1;
    unsigned TXERR:1;
    unsigned TXLARB:1;
    unsigned TXABAT:1;
    unsigned TXEN:1;
    unsigned :4;
    unsigned DONLY:1;
    unsigned UINC:1;
    unsigned FRESET:1;
    unsigned :1;
    unsigned FSIZE:5;
  };
  struct {
    unsigned w:32;
  };
} __C1FIFOCON13bits_t;
extern volatile __C1FIFOCON13bits_t C1FIFOCON13bits __asm__ ("C1FIFOCON13") __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOCON13CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOCON13SET __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOCON13INV __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOINT13 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned RXNEMPTYIF:1;
    unsigned RXHALFIF:1;
    unsigned RXFULLIF:1;
    unsigned RXOVFLIF:1;
    unsigned :4;
    unsigned TXEMPTYIF:1;
    unsigned TXHALFIF:1;
    unsigned TXNFULLIF:1;
    unsigned :5;
    unsigned RXNEMPTYIE:1;
    unsigned RXHALFIE:1;
    unsigned RXFULLIE:1;
    unsigned RXOVFLIE:1;
    unsigned :4;
    unsigned TXEMPTYIE:1;
    unsigned TXHALFIE:1;
    unsigned TXNFULLIE:1;
  };
  struct {
    unsigned w:32;
  };
} __C1FIFOINT13bits_t;
extern volatile __C1FIFOINT13bits_t C1FIFOINT13bits __asm__ ("C1FIFOINT13") __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOINT13CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOINT13SET __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOINT13INV __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOUA13 __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOUA13CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOUA13SET __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOUA13INV __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOCI13 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned CFIFOCI:5;
  };
  struct {
    unsigned w:32;
  };
} __C1FIFOCI13bits_t;
extern volatile __C1FIFOCI13bits_t C1FIFOCI13bits __asm__ ("C1FIFOCI13") __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOCI13CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOCI13SET __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOCI13INV __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOCON14 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned TXPRI:2;
    unsigned RTREN:1;
    unsigned TXREQ:1;
    unsigned TXERR:1;
    unsigned TXLARB:1;
    unsigned TXABAT:1;
    unsigned TXEN:1;
    unsigned :4;
    unsigned DONLY:1;
    unsigned UINC:1;
    unsigned FRESET:1;
    unsigned :1;
    unsigned FSIZE:5;
  };
  struct {
    unsigned w:32;
  };
} __C1FIFOCON14bits_t;
extern volatile __C1FIFOCON14bits_t C1FIFOCON14bits __asm__ ("C1FIFOCON14") __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOCON14CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOCON14SET __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOCON14INV __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOINT14 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned RXNEMPTYIF:1;
    unsigned RXHALFIF:1;
    unsigned RXFULLIF:1;
    unsigned RXOVFLIF:1;
    unsigned :4;
    unsigned TXEMPTYIF:1;
    unsigned TXHALFIF:1;
    unsigned TXNFULLIF:1;
    unsigned :5;
    unsigned RXNEMPTYIE:1;
    unsigned RXHALFIE:1;
    unsigned RXFULLIE:1;
    unsigned RXOVFLIE:1;
    unsigned :4;
    unsigned TXEMPTYIE:1;
    unsigned TXHALFIE:1;
    unsigned TXNFULLIE:1;
  };
  struct {
    unsigned w:32;
  };
} __C1FIFOINT14bits_t;
extern volatile __C1FIFOINT14bits_t C1FIFOINT14bits __asm__ ("C1FIFOINT14") __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOINT14CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOINT14SET __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOINT14INV __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOUA14 __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOUA14CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOUA14SET __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOUA14INV __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOCI14 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned CFIFOCI:5;
  };
  struct {
    unsigned w:32;
  };
} __C1FIFOCI14bits_t;
