HomuraVehicle/homuraLib_v2/machine/device/p32mx795f512h_forVC.c
extern volatile __C1FIFOCI23bits_t C1FIFOCI23bits __asm__ ("C1FIFOCI23") __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOCI23CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOCI23SET __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOCI23INV __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOCON24 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned TXPRI:2;
    unsigned RTREN:1;
    unsigned TXREQ:1;
    unsigned TXERR:1;
    unsigned TXLARB:1;
    unsigned TXABAT:1;
    unsigned TXEN:1;
    unsigned :4;
    unsigned DONLY:1;
    unsigned UINC:1;
    unsigned FRESET:1;
    unsigned :1;
    unsigned FSIZE:5;
  };
  struct {
    unsigned w:32;
  };
} __C1FIFOCON24bits_t;
extern volatile __C1FIFOCON24bits_t C1FIFOCON24bits __asm__ ("C1FIFOCON24") __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOCON24CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOCON24SET __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOCON24INV __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOINT24 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned RXNEMPTYIF:1;
    unsigned RXHALFIF:1;
    unsigned RXFULLIF:1;
    unsigned RXOVFLIF:1;
    unsigned :4;
    unsigned TXEMPTYIF:1;
    unsigned TXHALFIF:1;
    unsigned TXNFULLIF:1;
    unsigned :5;
    unsigned RXNEMPTYIE:1;
    unsigned RXHALFIE:1;
    unsigned RXFULLIE:1;
    unsigned RXOVFLIE:1;
    unsigned :4;
    unsigned TXEMPTYIE:1;
    unsigned TXHALFIE:1;
    unsigned TXNFULLIE:1;
  };
  struct {
    unsigned w:32;
  };
} __C1FIFOINT24bits_t;
extern volatile __C1FIFOINT24bits_t C1FIFOINT24bits __asm__ ("C1FIFOINT24") __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOINT24CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOINT24SET __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOINT24INV __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOUA24 __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOUA24CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOUA24SET __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOUA24INV __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOCI24 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned CFIFOCI:5;
  };
  struct {
    unsigned w:32;
  };
} __C1FIFOCI24bits_t;
extern volatile __C1FIFOCI24bits_t C1FIFOCI24bits __asm__ ("C1FIFOCI24") __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOCI24CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOCI24SET __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOCI24INV __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOCON25 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned TXPRI:2;
    unsigned RTREN:1;
    unsigned TXREQ:1;
    unsigned TXERR:1;
    unsigned TXLARB:1;
    unsigned TXABAT:1;
    unsigned TXEN:1;
    unsigned :4;
    unsigned DONLY:1;
    unsigned UINC:1;
    unsigned FRESET:1;
    unsigned :1;
    unsigned FSIZE:5;
  };
  struct {
    unsigned w:32;
  };
} __C1FIFOCON25bits_t;
extern volatile __C1FIFOCON25bits_t C1FIFOCON25bits __asm__ ("C1FIFOCON25") __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOCON25CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOCON25SET __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOCON25INV __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOINT25 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned RXNEMPTYIF:1;
    unsigned RXHALFIF:1;
    unsigned RXFULLIF:1;
    unsigned RXOVFLIF:1;
    unsigned :4;
    unsigned TXEMPTYIF:1;
    unsigned TXHALFIF:1;
    unsigned TXNFULLIF:1;
    unsigned :5;
    unsigned RXNEMPTYIE:1;
    unsigned RXHALFIE:1;
    unsigned RXFULLIE:1;
    unsigned RXOVFLIE:1;
    unsigned :4;
    unsigned TXEMPTYIE:1;
    unsigned TXHALFIE:1;
    unsigned TXNFULLIE:1;
  };
  struct {
    unsigned w:32;
  };
} __C1FIFOINT25bits_t;
extern volatile __C1FIFOINT25bits_t C1FIFOINT25bits __asm__ ("C1FIFOINT25") __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOINT25CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOINT25SET __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOINT25INV __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOUA25 __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOUA25CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOUA25SET __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOUA25INV __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOCI25 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned CFIFOCI:5;
  };
  struct {
    unsigned w:32;
  };
} __C1FIFOCI25bits_t;
extern volatile __C1FIFOCI25bits_t C1FIFOCI25bits __asm__ ("C1FIFOCI25") __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOCI25CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOCI25SET __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOCI25INV __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOCON26 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned TXPRI:2;
    unsigned RTREN:1;
    unsigned TXREQ:1;
    unsigned TXERR:1;
    unsigned TXLARB:1;
    unsigned TXABAT:1;
    unsigned TXEN:1;
    unsigned :4;
    unsigned DONLY:1;
    unsigned UINC:1;
    unsigned FRESET:1;
    unsigned :1;
    unsigned FSIZE:5;
  };
  struct {
    unsigned w:32;
  };
} __C1FIFOCON26bits_t;
