HomuraVehicle/homuraLib_v2/machine/device/p32mx795f512h_forVC.c
extern volatile __C1FIFOCON26bits_t C1FIFOCON26bits __asm__ ("C1FIFOCON26") __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOCON26CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOCON26SET __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOCON26INV __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOINT26 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned RXNEMPTYIF:1;
    unsigned RXHALFIF:1;
    unsigned RXFULLIF:1;
    unsigned RXOVFLIF:1;
    unsigned :4;
    unsigned TXEMPTYIF:1;
    unsigned TXHALFIF:1;
    unsigned TXNFULLIF:1;
    unsigned :5;
    unsigned RXNEMPTYIE:1;
    unsigned RXHALFIE:1;
    unsigned RXFULLIE:1;
    unsigned RXOVFLIE:1;
    unsigned :4;
    unsigned TXEMPTYIE:1;
    unsigned TXHALFIE:1;
    unsigned TXNFULLIE:1;
  };
  struct {
    unsigned w:32;
  };
} __C1FIFOINT26bits_t;
extern volatile __C1FIFOINT26bits_t C1FIFOINT26bits __asm__ ("C1FIFOINT26") __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOINT26CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOINT26SET __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOINT26INV __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOUA26 __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOUA26CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOUA26SET __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOUA26INV __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOCI26 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned CFIFOCI:5;
  };
  struct {
    unsigned w:32;
  };
} __C1FIFOCI26bits_t;
extern volatile __C1FIFOCI26bits_t C1FIFOCI26bits __asm__ ("C1FIFOCI26") __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOCI26CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOCI26SET __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOCI26INV __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOCON27 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned TXPRI:2;
    unsigned RTREN:1;
    unsigned TXREQ:1;
    unsigned TXERR:1;
    unsigned TXLARB:1;
    unsigned TXABAT:1;
    unsigned TXEN:1;
    unsigned :4;
    unsigned DONLY:1;
    unsigned UINC:1;
    unsigned FRESET:1;
    unsigned :1;
    unsigned FSIZE:5;
  };
  struct {
    unsigned w:32;
  };
} __C1FIFOCON27bits_t;
extern volatile __C1FIFOCON27bits_t C1FIFOCON27bits __asm__ ("C1FIFOCON27") __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOCON27CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOCON27SET __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOCON27INV __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOINT27 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned RXNEMPTYIF:1;
    unsigned RXHALFIF:1;
    unsigned RXFULLIF:1;
    unsigned RXOVFLIF:1;
    unsigned :4;
    unsigned TXEMPTYIF:1;
    unsigned TXHALFIF:1;
    unsigned TXNFULLIF:1;
    unsigned :5;
    unsigned RXNEMPTYIE:1;
    unsigned RXHALFIE:1;
    unsigned RXFULLIE:1;
    unsigned RXOVFLIE:1;
    unsigned :4;
    unsigned TXEMPTYIE:1;
    unsigned TXHALFIE:1;
    unsigned TXNFULLIE:1;
  };
  struct {
    unsigned w:32;
  };
} __C1FIFOINT27bits_t;
extern volatile __C1FIFOINT27bits_t C1FIFOINT27bits __asm__ ("C1FIFOINT27") __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOINT27CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOINT27SET __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOINT27INV __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOUA27 __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOUA27CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOUA27SET __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOUA27INV __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOCI27 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned CFIFOCI:5;
  };
  struct {
    unsigned w:32;
  };
} __C1FIFOCI27bits_t;
extern volatile __C1FIFOCI27bits_t C1FIFOCI27bits __asm__ ("C1FIFOCI27") __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOCI27CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOCI27SET __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOCI27INV __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOCON28 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned TXPRI:2;
    unsigned RTREN:1;
    unsigned TXREQ:1;
    unsigned TXERR:1;
    unsigned TXLARB:1;
    unsigned TXABAT:1;
    unsigned TXEN:1;
    unsigned :4;
    unsigned DONLY:1;
    unsigned UINC:1;
    unsigned FRESET:1;
    unsigned :1;
    unsigned FSIZE:5;
  };
  struct {
    unsigned w:32;
  };
} __C1FIFOCON28bits_t;
extern volatile __C1FIFOCON28bits_t C1FIFOCON28bits __asm__ ("C1FIFOCON28") __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOCON28CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOCON28SET __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOCON28INV __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOINT28 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned RXNEMPTYIF:1;
    unsigned RXHALFIF:1;
    unsigned RXFULLIF:1;
    unsigned RXOVFLIF:1;
    unsigned :4;
    unsigned TXEMPTYIF:1;
    unsigned TXHALFIF:1;
    unsigned TXNFULLIF:1;
    unsigned :5;
    unsigned RXNEMPTYIE:1;
    unsigned RXHALFIE:1;
    unsigned RXFULLIE:1;
    unsigned RXOVFLIE:1;
    unsigned :4;
    unsigned TXEMPTYIE:1;
    unsigned TXHALFIE:1;
    unsigned TXNFULLIE:1;
  };
  struct {
    unsigned w:32;
  };
} __C1FIFOINT28bits_t;
extern volatile __C1FIFOINT28bits_t C1FIFOINT28bits __asm__ ("C1FIFOINT28") __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOINT28CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOINT28SET __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOINT28INV __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOUA28 __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOUA28CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOUA28SET __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOUA28INV __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOCI28 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned CFIFOCI:5;
  };
  struct {
    unsigned w:32;
  };
} __C1FIFOCI28bits_t;
extern volatile __C1FIFOCI28bits_t C1FIFOCI28bits __asm__ ("C1FIFOCI28") __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOCI28CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOCI28SET __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOCI28INV __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOCON29 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned TXPRI:2;
    unsigned RTREN:1;
    unsigned TXREQ:1;
    unsigned TXERR:1;
    unsigned TXLARB:1;
    unsigned TXABAT:1;
    unsigned TXEN:1;
    unsigned :4;
    unsigned DONLY:1;
    unsigned UINC:1;
    unsigned FRESET:1;
    unsigned :1;
    unsigned FSIZE:5;
  };
  struct {
    unsigned w:32;
  };
} __C1FIFOCON29bits_t;
extern volatile __C1FIFOCON29bits_t C1FIFOCON29bits __asm__ ("C1FIFOCON29") __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOCON29CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOCON29SET __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOCON29INV __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOINT29 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned RXNEMPTYIF:1;
    unsigned RXHALFIF:1;
    unsigned RXFULLIF:1;
    unsigned RXOVFLIF:1;
    unsigned :4;
    unsigned TXEMPTYIF:1;
    unsigned TXHALFIF:1;
    unsigned TXNFULLIF:1;
    unsigned :5;
    unsigned RXNEMPTYIE:1;
    unsigned RXHALFIE:1;
    unsigned RXFULLIE:1;
    unsigned RXOVFLIE:1;
    unsigned :4;
    unsigned TXEMPTYIE:1;
    unsigned TXHALFIE:1;
    unsigned TXNFULLIE:1;
  };
  struct {
    unsigned w:32;
  };
} __C1FIFOINT29bits_t;
extern volatile __C1FIFOINT29bits_t C1FIFOINT29bits __asm__ ("C1FIFOINT29") __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOINT29CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOINT29SET __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOINT29INV __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOUA29 __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOUA29CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOUA29SET __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOUA29INV __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOCI29 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned CFIFOCI:5;
  };
  struct {
    unsigned w:32;
  };
} __C1FIFOCI29bits_t;
extern volatile __C1FIFOCI29bits_t C1FIFOCI29bits __asm__ ("C1FIFOCI29") __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOCI29CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOCI29SET __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOCI29INV __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOCON30 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned TXPRI:2;
    unsigned RTREN:1;
    unsigned TXREQ:1;
    unsigned TXERR:1;
    unsigned TXLARB:1;
    unsigned TXABAT:1;
    unsigned TXEN:1;
    unsigned :4;
    unsigned DONLY:1;
    unsigned UINC:1;
    unsigned FRESET:1;
    unsigned :1;
    unsigned FSIZE:5;
  };
  struct {
    unsigned w:32;
  };
} __C1FIFOCON30bits_t;
