HomuraVehicle/homuraLib_v2/machine/device/p32mx795f512h_forVC.c
extern volatile __C1FIFOCON30bits_t C1FIFOCON30bits __asm__ ("C1FIFOCON30") __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOCON30CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOCON30SET __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOCON30INV __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOINT30 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned RXNEMPTYIF:1;
    unsigned RXHALFIF:1;
    unsigned RXFULLIF:1;
    unsigned RXOVFLIF:1;
    unsigned :4;
    unsigned TXEMPTYIF:1;
    unsigned TXHALFIF:1;
    unsigned TXNFULLIF:1;
    unsigned :5;
    unsigned RXNEMPTYIE:1;
    unsigned RXHALFIE:1;
    unsigned RXFULLIE:1;
    unsigned RXOVFLIE:1;
    unsigned :4;
    unsigned TXEMPTYIE:1;
    unsigned TXHALFIE:1;
    unsigned TXNFULLIE:1;
  };
  struct {
    unsigned w:32;
  };
} __C1FIFOINT30bits_t;
extern volatile __C1FIFOINT30bits_t C1FIFOINT30bits __asm__ ("C1FIFOINT30") __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOINT30CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOINT30SET __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOINT30INV __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOUA30 __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOUA30CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOUA30SET __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOUA30INV __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOCI30 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned CFIFOCI:5;
  };
  struct {
    unsigned w:32;
  };
} __C1FIFOCI30bits_t;
extern volatile __C1FIFOCI30bits_t C1FIFOCI30bits __asm__ ("C1FIFOCI30") __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOCI30CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOCI30SET __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOCI30INV __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOCON31 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned TXPRI:2;
    unsigned RTREN:1;
    unsigned TXREQ:1;
    unsigned TXERR:1;
    unsigned TXLARB:1;
    unsigned TXABAT:1;
    unsigned TXEN:1;
    unsigned :4;
    unsigned DONLY:1;
    unsigned UINC:1;
    unsigned FRESET:1;
    unsigned :1;
    unsigned FSIZE:5;
  };
  struct {
    unsigned w:32;
  };
} __C1FIFOCON31bits_t;
extern volatile __C1FIFOCON31bits_t C1FIFOCON31bits __asm__ ("C1FIFOCON31") __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOCON31CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOCON31SET __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOCON31INV __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOINT31 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned RXNEMPTYIF:1;
    unsigned RXHALFIF:1;
    unsigned RXFULLIF:1;
    unsigned RXOVFLIF:1;
    unsigned :4;
    unsigned TXEMPTYIF:1;
    unsigned TXHALFIF:1;
    unsigned TXNFULLIF:1;
    unsigned :5;
    unsigned RXNEMPTYIE:1;
    unsigned RXHALFIE:1;
    unsigned RXFULLIE:1;
    unsigned RXOVFLIE:1;
    unsigned :4;
    unsigned TXEMPTYIE:1;
    unsigned TXHALFIE:1;
    unsigned TXNFULLIE:1;
  };
  struct {
    unsigned w:32;
  };
} __C1FIFOINT31bits_t;
extern volatile __C1FIFOINT31bits_t C1FIFOINT31bits __asm__ ("C1FIFOINT31") __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOINT31CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOINT31SET __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOINT31INV __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOUA31 __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOUA31CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOUA31SET __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOUA31INV __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOCI31 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned CFIFOCI:5;
  };
  struct {
    unsigned w:32;
  };
} __C1FIFOCI31bits_t;
extern volatile __C1FIFOCI31bits_t C1FIFOCI31bits __asm__ ("C1FIFOCI31") __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOCI31CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOCI31SET __attribute__((section("sfrs")));
extern volatile unsigned int        C1FIFOCI31INV __attribute__((section("sfrs")));
extern volatile unsigned int        C2CON __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned DNCNT:5;
    unsigned :6;
    unsigned CANBUSY:1;
    unsigned :1;
    unsigned SIDL:1;
    unsigned :1;
    unsigned ON:1;
    unsigned :4;
    unsigned CANCAP:1;
    unsigned OPMOD:3;
    unsigned REQOP:3;
    unsigned ABAT:1;
  };
  struct {
    unsigned w:32;
  };
} __C2CONbits_t;
extern volatile __C2CONbits_t C2CONbits __asm__ ("C2CON") __attribute__((section("sfrs")));
extern volatile unsigned int        C2CONCLR __attribute__((section("sfrs")));
extern volatile unsigned int        C2CONSET __attribute__((section("sfrs")));
extern volatile unsigned int        C2CONINV __attribute__((section("sfrs")));
extern volatile unsigned int        C2CFG __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned BRP:6;
    unsigned SJW:2;
    unsigned PRSEG:3;
    unsigned SEG1PH:3;
    unsigned SAM:1;
    unsigned SEG2PHTS:1;
    unsigned SEG2PH:3;
    unsigned :3;
    unsigned WAKFIL:1;
  };
  struct {
    unsigned w:32;
  };
} __C2CFGbits_t;
extern volatile __C2CFGbits_t C2CFGbits __asm__ ("C2CFG") __attribute__((section("sfrs")));
extern volatile unsigned int        C2CFGCLR __attribute__((section("sfrs")));
extern volatile unsigned int        C2CFGSET __attribute__((section("sfrs")));
extern volatile unsigned int        C2CFGINV __attribute__((section("sfrs")));
extern volatile unsigned int        C2INT __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned TBIF:1;
    unsigned RBIF:1;
    unsigned CTMRIF:1;
    unsigned MODIF:1;
    unsigned :7;
    unsigned RBOVIF:1;
    unsigned SERRIF:1;
    unsigned CERRIF:1;
    unsigned WAKIF:1;
    unsigned IVRIF:1;
    unsigned TBIE:1;
    unsigned RBIE:1;
    unsigned CTMRIE:1;
    unsigned MODIE:1;
    unsigned :7;
    unsigned RBOVIE:1;
    unsigned SERRIE:1;
    unsigned CERRIE:1;
    unsigned WAKIE:1;
    unsigned IVRIE:1;
  };
  struct {
    unsigned w:32;
  };
} __C2INTbits_t;
extern volatile __C2INTbits_t C2INTbits __asm__ ("C2INT") __attribute__((section("sfrs")));
extern volatile unsigned int        C2INTCLR __attribute__((section("sfrs")));
extern volatile unsigned int        C2INTSET __attribute__((section("sfrs")));
extern volatile unsigned int        C2INTINV __attribute__((section("sfrs")));
extern volatile unsigned int        C2VEC __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned ICODE:7;
    unsigned :1;
    unsigned FILHIT:5;
  };
  struct {
    unsigned w:32;
  };
} __C2VECbits_t;
extern volatile __C2VECbits_t C2VECbits __asm__ ("C2VEC") __attribute__((section("sfrs")));
extern volatile unsigned int        C2VECCLR __attribute__((section("sfrs")));
extern volatile unsigned int        C2VECSET __attribute__((section("sfrs")));
extern volatile unsigned int        C2VECINV __attribute__((section("sfrs")));
extern volatile unsigned int        C2TREC __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned RERRCNT:8;
    unsigned TERRCNT:8;
    unsigned EWARN:1;
    unsigned RXWARN:1;
    unsigned TXWARN:1;
    unsigned RXBP:1;
    unsigned TXBP:1;
    unsigned TXBO:1;
  };
  struct {
    unsigned w:32;
  };
} __C2TRECbits_t;
