HomuraVehicle/homuraLib_v2/machine/device/p32mx795f512h_forVC.c
extern volatile __C2FLTCON0bits_t C2FLTCON0bits __asm__ ("C2FLTCON0") __attribute__((section("sfrs")));
extern volatile unsigned int        C2FLTCON0CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C2FLTCON0SET __attribute__((section("sfrs")));
extern volatile unsigned int        C2FLTCON0INV __attribute__((section("sfrs")));
extern volatile unsigned int        C2FLTCON1 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned FSEL4:5;
    unsigned MSEL4:2;
    unsigned FLTEN4:1;
    unsigned FSEL5:5;
    unsigned MSEL5:2;
    unsigned FLTEN5:1;
    unsigned FSEL6:5;
    unsigned MSEL6:2;
    unsigned FLTEN6:1;
    unsigned FSEL7:5;
    unsigned MSEL7:2;
    unsigned FLTEN7:1;
  };
  struct {
    unsigned w:32;
  };
} __C2FLTCON1bits_t;
extern volatile __C2FLTCON1bits_t C2FLTCON1bits __asm__ ("C2FLTCON1") __attribute__((section("sfrs")));
extern volatile unsigned int        C2FLTCON1CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C2FLTCON1SET __attribute__((section("sfrs")));
extern volatile unsigned int        C2FLTCON1INV __attribute__((section("sfrs")));
extern volatile unsigned int        C2FLTCON2 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned FSEL8:5;
    unsigned MSEL8:2;
    unsigned FLTEN8:1;
    unsigned FSEL9:5;
    unsigned MSEL9:2;
    unsigned FLTEN9:1;
    unsigned FSEL10:5;
    unsigned MSEL10:2;
    unsigned FLTEN10:1;
    unsigned FSEL11:5;
    unsigned MSEL11:2;
    unsigned FLTEN11:1;
  };
  struct {
    unsigned w:32;
  };
} __C2FLTCON2bits_t;
extern volatile __C2FLTCON2bits_t C2FLTCON2bits __asm__ ("C2FLTCON2") __attribute__((section("sfrs")));
extern volatile unsigned int        C2FLTCON2CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C2FLTCON2SET __attribute__((section("sfrs")));
extern volatile unsigned int        C2FLTCON2INV __attribute__((section("sfrs")));
extern volatile unsigned int        C2FLTCON3 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned FSEL12:5;
    unsigned MSEL12:2;
    unsigned FLTEN12:1;
    unsigned FSEL13:5;
    unsigned MSEL13:2;
    unsigned FLTEN13:1;
    unsigned FSEL14:5;
    unsigned MSEL14:2;
    unsigned FLTEN14:1;
    unsigned FSEL15:5;
    unsigned MSEL15:2;
    unsigned FLTEN15:1;
  };
  struct {
    unsigned w:32;
  };
} __C2FLTCON3bits_t;
extern volatile __C2FLTCON3bits_t C2FLTCON3bits __asm__ ("C2FLTCON3") __attribute__((section("sfrs")));
extern volatile unsigned int        C2FLTCON3CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C2FLTCON3SET __attribute__((section("sfrs")));
extern volatile unsigned int        C2FLTCON3INV __attribute__((section("sfrs")));
extern volatile unsigned int        C2FLTCON4 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned FSEL16:5;
    unsigned MSEL16:2;
    unsigned FLTEN16:1;
    unsigned FSEL17:5;
    unsigned MSEL17:2;
    unsigned FLTEN17:1;
    unsigned FSEL18:5;
    unsigned MSEL18:2;
    unsigned FLTEN18:1;
    unsigned FSEL19:5;
    unsigned MSEL19:2;
    unsigned FLTEN19:1;
  };
  struct {
    unsigned w:32;
  };
} __C2FLTCON4bits_t;
extern volatile __C2FLTCON4bits_t C2FLTCON4bits __asm__ ("C2FLTCON4") __attribute__((section("sfrs")));
extern volatile unsigned int        C2FLTCON4CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C2FLTCON4SET __attribute__((section("sfrs")));
extern volatile unsigned int        C2FLTCON4INV __attribute__((section("sfrs")));
extern volatile unsigned int        C2FLTCON5 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned FSEL20:5;
    unsigned MSEL20:2;
    unsigned FLTEN20:1;
    unsigned FSEL21:5;
    unsigned MSEL21:2;
    unsigned FLTEN21:1;
    unsigned FSEL22:5;
    unsigned MSEL22:2;
    unsigned FLTEN22:1;
    unsigned FSEL23:5;
    unsigned MSEL23:2;
    unsigned FLTEN23:1;
  };
  struct {
    unsigned w:32;
  };
} __C2FLTCON5bits_t;
extern volatile __C2FLTCON5bits_t C2FLTCON5bits __asm__ ("C2FLTCON5") __attribute__((section("sfrs")));
extern volatile unsigned int        C2FLTCON5CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C2FLTCON5SET __attribute__((section("sfrs")));
extern volatile unsigned int        C2FLTCON5INV __attribute__((section("sfrs")));
extern volatile unsigned int        C2FLTCON6 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned FSEL24:5;
    unsigned MSEL24:2;
    unsigned FLTEN24:1;
    unsigned FSEL25:5;
    unsigned MSEL25:2;
    unsigned FLTEN25:1;
    unsigned FSEL26:5;
    unsigned MSEL26:2;
    unsigned FLTEN26:1;
    unsigned FSEL27:5;
    unsigned MSEL27:2;
    unsigned FLTEN27:1;
  };
  struct {
    unsigned w:32;
  };
} __C2FLTCON6bits_t;
extern volatile __C2FLTCON6bits_t C2FLTCON6bits __asm__ ("C2FLTCON6") __attribute__((section("sfrs")));
extern volatile unsigned int        C2FLTCON6CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C2FLTCON6SET __attribute__((section("sfrs")));
extern volatile unsigned int        C2FLTCON6INV __attribute__((section("sfrs")));
extern volatile unsigned int        C2FLTCON7 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned FSEL28:5;
    unsigned MSEL28:2;
    unsigned FLTEN28:1;
    unsigned FSEL29:5;
    unsigned MSEL29:2;
    unsigned FLTEN29:1;
    unsigned FSEL30:5;
    unsigned MSEL30:2;
    unsigned FLTEN30:1;
    unsigned FSEL31:5;
    unsigned MSEL31:2;
    unsigned FLTEN31:1;
  };
  struct {
    unsigned w:32;
  };
} __C2FLTCON7bits_t;
extern volatile __C2FLTCON7bits_t C2FLTCON7bits __asm__ ("C2FLTCON7") __attribute__((section("sfrs")));
extern volatile unsigned int        C2FLTCON7CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C2FLTCON7SET __attribute__((section("sfrs")));
extern volatile unsigned int        C2FLTCON7INV __attribute__((section("sfrs")));
extern volatile unsigned int        C2RXF0 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned EID:18;
    unsigned :1;
    unsigned EXID:1;
    unsigned :1;
    unsigned SID:11;
  };
  struct {
    unsigned w:32;
  };
} __C2RXF0bits_t;
extern volatile __C2RXF0bits_t C2RXF0bits __asm__ ("C2RXF0") __attribute__((section("sfrs")));
extern volatile unsigned int        C2RXF0CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C2RXF0SET __attribute__((section("sfrs")));
extern volatile unsigned int        C2RXF0INV __attribute__((section("sfrs")));
extern volatile unsigned int        C2RXF1 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned EID:18;
    unsigned :1;
    unsigned EXID:1;
    unsigned :1;
    unsigned SID:11;
  };
  struct {
    unsigned w:32;
  };
} __C2RXF1bits_t;
extern volatile __C2RXF1bits_t C2RXF1bits __asm__ ("C2RXF1") __attribute__((section("sfrs")));
extern volatile unsigned int        C2RXF1CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C2RXF1SET __attribute__((section("sfrs")));
extern volatile unsigned int        C2RXF1INV __attribute__((section("sfrs")));
extern volatile unsigned int        C2RXF2 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned EID:18;
    unsigned :1;
    unsigned EXID:1;
    unsigned :1;
    unsigned SID:11;
  };
  struct {
    unsigned w:32;
  };
} __C2RXF2bits_t;
extern volatile __C2RXF2bits_t C2RXF2bits __asm__ ("C2RXF2") __attribute__((section("sfrs")));
extern volatile unsigned int        C2RXF2CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C2RXF2SET __attribute__((section("sfrs")));
extern volatile unsigned int        C2RXF2INV __attribute__((section("sfrs")));
extern volatile unsigned int        C2RXF3 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned EID:18;
    unsigned :1;
    unsigned EXID:1;
    unsigned :1;
    unsigned SID:11;
  };
  struct {
    unsigned w:32;
  };
} __C2RXF3bits_t;
extern volatile __C2RXF3bits_t C2RXF3bits __asm__ ("C2RXF3") __attribute__((section("sfrs")));
extern volatile unsigned int        C2RXF3CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C2RXF3SET __attribute__((section("sfrs")));
extern volatile unsigned int        C2RXF3INV __attribute__((section("sfrs")));
extern volatile unsigned int        C2RXF4 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned EID:18;
    unsigned :1;
    unsigned EXID:1;
    unsigned :1;
    unsigned SID:11;
  };
  struct {
    unsigned w:32;
  };
} __C2RXF4bits_t;
extern volatile __C2RXF4bits_t C2RXF4bits __asm__ ("C2RXF4") __attribute__((section("sfrs")));
extern volatile unsigned int        C2RXF4CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C2RXF4SET __attribute__((section("sfrs")));
extern volatile unsigned int        C2RXF4INV __attribute__((section("sfrs")));
extern volatile unsigned int        C2RXF5 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned EID:18;
    unsigned :1;
    unsigned EXID:1;
    unsigned :1;
    unsigned SID:11;
  };
  struct {
    unsigned w:32;
  };
} __C2RXF5bits_t;
extern volatile __C2RXF5bits_t C2RXF5bits __asm__ ("C2RXF5") __attribute__((section("sfrs")));
extern volatile unsigned int        C2RXF5CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C2RXF5SET __attribute__((section("sfrs")));
extern volatile unsigned int        C2RXF5INV __attribute__((section("sfrs")));
extern volatile unsigned int        C2RXF6 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned EID:18;
    unsigned :1;
    unsigned EXID:1;
    unsigned :1;
    unsigned SID:11;
  };
  struct {
    unsigned w:32;
  };
} __C2RXF6bits_t;
extern volatile __C2RXF6bits_t C2RXF6bits __asm__ ("C2RXF6") __attribute__((section("sfrs")));
extern volatile unsigned int        C2RXF6CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C2RXF6SET __attribute__((section("sfrs")));
extern volatile unsigned int        C2RXF6INV __attribute__((section("sfrs")));
extern volatile unsigned int        C2RXF7 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned EID:18;
    unsigned :1;
    unsigned EXID:1;
    unsigned :1;
    unsigned SID:11;
  };
  struct {
    unsigned w:32;
  };
} __C2RXF7bits_t;
extern volatile __C2RXF7bits_t C2RXF7bits __asm__ ("C2RXF7") __attribute__((section("sfrs")));
extern volatile unsigned int        C2RXF7CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C2RXF7SET __attribute__((section("sfrs")));
extern volatile unsigned int        C2RXF7INV __attribute__((section("sfrs")));
extern volatile unsigned int        C2RXF8 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned EID:18;
    unsigned :1;
    unsigned EXID:1;
    unsigned :1;
    unsigned SID:11;
  };
  struct {
    unsigned w:32;
  };
} __C2RXF8bits_t;
extern volatile __C2RXF8bits_t C2RXF8bits __asm__ ("C2RXF8") __attribute__((section("sfrs")));
extern volatile unsigned int        C2RXF8CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C2RXF8SET __attribute__((section("sfrs")));
extern volatile unsigned int        C2RXF8INV __attribute__((section("sfrs")));
extern volatile unsigned int        C2RXF9 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned EID:18;
    unsigned :1;
    unsigned EXID:1;
    unsigned :1;
    unsigned SID:11;
  };
  struct {
    unsigned w:32;
  };
} __C2RXF9bits_t;
extern volatile __C2RXF9bits_t C2RXF9bits __asm__ ("C2RXF9") __attribute__((section("sfrs")));
extern volatile unsigned int        C2RXF9CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C2RXF9SET __attribute__((section("sfrs")));
extern volatile unsigned int        C2RXF9INV __attribute__((section("sfrs")));
extern volatile unsigned int        C2RXF10 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned EID:18;
    unsigned :1;
    unsigned EXID:1;
    unsigned :1;
    unsigned SID:11;
  };
  struct {
    unsigned w:32;
  };
} __C2RXF10bits_t;
extern volatile __C2RXF10bits_t C2RXF10bits __asm__ ("C2RXF10") __attribute__((section("sfrs")));
extern volatile unsigned int        C2RXF10CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C2RXF10SET __attribute__((section("sfrs")));
extern volatile unsigned int        C2RXF10INV __attribute__((section("sfrs")));
extern volatile unsigned int        C2RXF11 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned EID:18;
    unsigned :1;
    unsigned EXID:1;
    unsigned :1;
    unsigned SID:11;
  };
  struct {
    unsigned w:32;
  };
} __C2RXF11bits_t;
extern volatile __C2RXF11bits_t C2RXF11bits __asm__ ("C2RXF11") __attribute__((section("sfrs")));
extern volatile unsigned int        C2RXF11CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C2RXF11SET __attribute__((section("sfrs")));
extern volatile unsigned int        C2RXF11INV __attribute__((section("sfrs")));
extern volatile unsigned int        C2RXF12 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned EID:18;
    unsigned :1;
    unsigned EXID:1;
    unsigned :1;
    unsigned SID:11;
  };
  struct {
    unsigned w:32;
  };
} __C2RXF12bits_t;
extern volatile __C2RXF12bits_t C2RXF12bits __asm__ ("C2RXF12") __attribute__((section("sfrs")));
extern volatile unsigned int        C2RXF12CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C2RXF12SET __attribute__((section("sfrs")));
extern volatile unsigned int        C2RXF12INV __attribute__((section("sfrs")));
extern volatile unsigned int        C2RXF13 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned EID:18;
    unsigned :1;
    unsigned EXID:1;
    unsigned :1;
    unsigned SID:11;
  };
  struct {
    unsigned w:32;
  };
} __C2RXF13bits_t;
extern volatile __C2RXF13bits_t C2RXF13bits __asm__ ("C2RXF13") __attribute__((section("sfrs")));
extern volatile unsigned int        C2RXF13CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C2RXF13SET __attribute__((section("sfrs")));
extern volatile unsigned int        C2RXF13INV __attribute__((section("sfrs")));
extern volatile unsigned int        C2RXF14 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned EID:18;
    unsigned :1;
    unsigned EXID:1;
    unsigned :1;
    unsigned SID:11;
  };
  struct {
    unsigned w:32;
  };
} __C2RXF14bits_t;
extern volatile __C2RXF14bits_t C2RXF14bits __asm__ ("C2RXF14") __attribute__((section("sfrs")));
extern volatile unsigned int        C2RXF14CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C2RXF14SET __attribute__((section("sfrs")));
extern volatile unsigned int        C2RXF14INV __attribute__((section("sfrs")));
extern volatile unsigned int        C2RXF15 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned EID:18;
    unsigned :1;
    unsigned EXID:1;
    unsigned :1;
    unsigned SID:11;
  };
  struct {
    unsigned w:32;
  };
} __C2RXF15bits_t;
extern volatile __C2RXF15bits_t C2RXF15bits __asm__ ("C2RXF15") __attribute__((section("sfrs")));
extern volatile unsigned int        C2RXF15CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C2RXF15SET __attribute__((section("sfrs")));
extern volatile unsigned int        C2RXF15INV __attribute__((section("sfrs")));
extern volatile unsigned int        C2RXF16 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned EID:18;
    unsigned :1;
    unsigned EXID:1;
    unsigned :1;
    unsigned SID:11;
  };
  struct {
    unsigned w:32;
  };
} __C2RXF16bits_t;
extern volatile __C2RXF16bits_t C2RXF16bits __asm__ ("C2RXF16") __attribute__((section("sfrs")));
extern volatile unsigned int        C2RXF16CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C2RXF16SET __attribute__((section("sfrs")));
extern volatile unsigned int        C2RXF16INV __attribute__((section("sfrs")));
extern volatile unsigned int        C2RXF17 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned EID:18;
    unsigned :1;
    unsigned EXID:1;
    unsigned :1;
    unsigned SID:11;
  };
  struct {
    unsigned w:32;
  };
} __C2RXF17bits_t;
extern volatile __C2RXF17bits_t C2RXF17bits __asm__ ("C2RXF17") __attribute__((section("sfrs")));
extern volatile unsigned int        C2RXF17CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C2RXF17SET __attribute__((section("sfrs")));
extern volatile unsigned int        C2RXF17INV __attribute__((section("sfrs")));
extern volatile unsigned int        C2RXF18 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned EID:18;
    unsigned :1;
    unsigned EXID:1;
    unsigned :1;
    unsigned SID:11;
  };
  struct {
    unsigned w:32;
  };
} __C2RXF18bits_t;
extern volatile __C2RXF18bits_t C2RXF18bits __asm__ ("C2RXF18") __attribute__((section("sfrs")));
extern volatile unsigned int        C2RXF18CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C2RXF18SET __attribute__((section("sfrs")));
extern volatile unsigned int        C2RXF18INV __attribute__((section("sfrs")));
extern volatile unsigned int        C2RXF19 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned EID:18;
    unsigned :1;
    unsigned EXID:1;
    unsigned :1;
    unsigned SID:11;
  };
  struct {
    unsigned w:32;
  };
} __C2RXF19bits_t;
extern volatile __C2RXF19bits_t C2RXF19bits __asm__ ("C2RXF19") __attribute__((section("sfrs")));
extern volatile unsigned int        C2RXF19CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C2RXF19SET __attribute__((section("sfrs")));
extern volatile unsigned int        C2RXF19INV __attribute__((section("sfrs")));
extern volatile unsigned int        C2RXF20 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned EID:18;
    unsigned :1;
    unsigned EXID:1;
    unsigned :1;
    unsigned SID:11;
  };
  struct {
    unsigned w:32;
  };
} __C2RXF20bits_t;
extern volatile __C2RXF20bits_t C2RXF20bits __asm__ ("C2RXF20") __attribute__((section("sfrs")));
extern volatile unsigned int        C2RXF20CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C2RXF20SET __attribute__((section("sfrs")));
extern volatile unsigned int        C2RXF20INV __attribute__((section("sfrs")));
extern volatile unsigned int        C2RXF21 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned EID:18;
    unsigned :1;
    unsigned EXID:1;
    unsigned :1;
    unsigned SID:11;
  };
  struct {
    unsigned w:32;
  };
} __C2RXF21bits_t;
extern volatile __C2RXF21bits_t C2RXF21bits __asm__ ("C2RXF21") __attribute__((section("sfrs")));
extern volatile unsigned int        C2RXF21CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C2RXF21SET __attribute__((section("sfrs")));
extern volatile unsigned int        C2RXF21INV __attribute__((section("sfrs")));
extern volatile unsigned int        C2RXF22 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned EID:18;
    unsigned :1;
    unsigned EXID:1;
    unsigned :1;
    unsigned SID:11;
  };
  struct {
    unsigned w:32;
  };
} __C2RXF22bits_t;
extern volatile __C2RXF22bits_t C2RXF22bits __asm__ ("C2RXF22") __attribute__((section("sfrs")));
extern volatile unsigned int        C2RXF22CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C2RXF22SET __attribute__((section("sfrs")));
extern volatile unsigned int        C2RXF22INV __attribute__((section("sfrs")));
extern volatile unsigned int        C2RXF23 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned EID:18;
    unsigned :1;
    unsigned EXID:1;
    unsigned :1;
    unsigned SID:11;
  };
  struct {
    unsigned w:32;
  };
} __C2RXF23bits_t;
extern volatile __C2RXF23bits_t C2RXF23bits __asm__ ("C2RXF23") __attribute__((section("sfrs")));
extern volatile unsigned int        C2RXF23CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C2RXF23SET __attribute__((section("sfrs")));
extern volatile unsigned int        C2RXF23INV __attribute__((section("sfrs")));
extern volatile unsigned int        C2RXF24 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned EID:18;
    unsigned :1;
    unsigned EXID:1;
    unsigned :1;
    unsigned SID:11;
  };
  struct {
    unsigned w:32;
  };
} __C2RXF24bits_t;
extern volatile __C2RXF24bits_t C2RXF24bits __asm__ ("C2RXF24") __attribute__((section("sfrs")));
extern volatile unsigned int        C2RXF24CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C2RXF24SET __attribute__((section("sfrs")));
extern volatile unsigned int        C2RXF24INV __attribute__((section("sfrs")));
extern volatile unsigned int        C2RXF25 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned EID:18;
    unsigned :1;
    unsigned EXID:1;
    unsigned :1;
    unsigned SID:11;
  };
  struct {
    unsigned w:32;
  };
} __C2RXF25bits_t;
extern volatile __C2RXF25bits_t C2RXF25bits __asm__ ("C2RXF25") __attribute__((section("sfrs")));
extern volatile unsigned int        C2RXF25CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C2RXF25SET __attribute__((section("sfrs")));
extern volatile unsigned int        C2RXF25INV __attribute__((section("sfrs")));
extern volatile unsigned int        C2RXF26 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned EID:18;
    unsigned :1;
    unsigned EXID:1;
    unsigned :1;
    unsigned SID:11;
  };
  struct {
    unsigned w:32;
  };
} __C2RXF26bits_t;
extern volatile __C2RXF26bits_t C2RXF26bits __asm__ ("C2RXF26") __attribute__((section("sfrs")));
extern volatile unsigned int        C2RXF26CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C2RXF26SET __attribute__((section("sfrs")));
extern volatile unsigned int        C2RXF26INV __attribute__((section("sfrs")));
extern volatile unsigned int        C2RXF27 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned EID:18;
    unsigned :1;
    unsigned EXID:1;
    unsigned :1;
    unsigned SID:11;
  };
  struct {
    unsigned w:32;
  };
} __C2RXF27bits_t;
extern volatile __C2RXF27bits_t C2RXF27bits __asm__ ("C2RXF27") __attribute__((section("sfrs")));
extern volatile unsigned int        C2RXF27CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C2RXF27SET __attribute__((section("sfrs")));
extern volatile unsigned int        C2RXF27INV __attribute__((section("sfrs")));
extern volatile unsigned int        C2RXF28 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned EID:18;
    unsigned :1;
    unsigned EXID:1;
    unsigned :1;
    unsigned SID:11;
  };
  struct {
    unsigned w:32;
  };
} __C2RXF28bits_t;
extern volatile __C2RXF28bits_t C2RXF28bits __asm__ ("C2RXF28") __attribute__((section("sfrs")));
extern volatile unsigned int        C2RXF28CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C2RXF28SET __attribute__((section("sfrs")));
extern volatile unsigned int        C2RXF28INV __attribute__((section("sfrs")));
extern volatile unsigned int        C2RXF29 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned EID:18;
    unsigned :1;
    unsigned EXID:1;
    unsigned :1;
    unsigned SID:11;
  };
  struct {
    unsigned w:32;
  };
} __C2RXF29bits_t;
