HomuraVehicle/homuraLib_v2/machine/device/p32mx795f512h_forVC.c
extern volatile __C2RXF29bits_t C2RXF29bits __asm__ ("C2RXF29") __attribute__((section("sfrs")));
extern volatile unsigned int        C2RXF29CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C2RXF29SET __attribute__((section("sfrs")));
extern volatile unsigned int        C2RXF29INV __attribute__((section("sfrs")));
extern volatile unsigned int        C2RXF30 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned EID:18;
    unsigned :1;
    unsigned EXID:1;
    unsigned :1;
    unsigned SID:11;
  };
  struct {
    unsigned w:32;
  };
} __C2RXF30bits_t;
extern volatile __C2RXF30bits_t C2RXF30bits __asm__ ("C2RXF30") __attribute__((section("sfrs")));
extern volatile unsigned int        C2RXF30CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C2RXF30SET __attribute__((section("sfrs")));
extern volatile unsigned int        C2RXF30INV __attribute__((section("sfrs")));
extern volatile unsigned int        C2RXF31 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned EID:18;
    unsigned :1;
    unsigned EXID:1;
    unsigned :1;
    unsigned SID:11;
  };
  struct {
    unsigned w:32;
  };
} __C2RXF31bits_t;
extern volatile __C2RXF31bits_t C2RXF31bits __asm__ ("C2RXF31") __attribute__((section("sfrs")));
extern volatile unsigned int        C2RXF31CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C2RXF31SET __attribute__((section("sfrs")));
extern volatile unsigned int        C2RXF31INV __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOBA __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOBACLR __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOBASET __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOBAINV __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOCON0 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned TXPRI:2;
    unsigned RTREN:1;
    unsigned TXREQ:1;
    unsigned TXERR:1;
    unsigned TXLARB:1;
    unsigned TXABAT:1;
    unsigned TXEN:1;
    unsigned :4;
    unsigned DONLY:1;
    unsigned UINC:1;
    unsigned FRESET:1;
    unsigned :1;
    unsigned FSIZE:5;
  };
  struct {
    unsigned w:32;
  };
} __C2FIFOCON0bits_t;
extern volatile __C2FIFOCON0bits_t C2FIFOCON0bits __asm__ ("C2FIFOCON0") __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOCON0CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOCON0SET __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOCON0INV __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOINT0 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned RXNEMPTYIF:1;
    unsigned RXHALFIF:1;
    unsigned RXFULLIF:1;
    unsigned RXOVFLIF:1;
    unsigned :4;
    unsigned TXEMPTYIF:1;
    unsigned TXHALFIF:1;
    unsigned TXNFULLIF:1;
    unsigned :5;
    unsigned RXNEMPTYIE:1;
    unsigned RXHALFIE:1;
    unsigned RXFULLIE:1;
    unsigned RXOVFLIE:1;
    unsigned :4;
    unsigned TXEMPTYIE:1;
    unsigned TXHALFIE:1;
    unsigned TXNFULLIE:1;
  };
  struct {
    unsigned w:32;
  };
} __C2FIFOINT0bits_t;
extern volatile __C2FIFOINT0bits_t C2FIFOINT0bits __asm__ ("C2FIFOINT0") __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOINT0CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOINT0SET __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOINT0INV __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOUA0 __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOUA0CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOUA0SET __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOUA0INV __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOCI0 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned CFIFOCI:5;
  };
  struct {
    unsigned w:32;
  };
} __C2FIFOCI0bits_t;
extern volatile __C2FIFOCI0bits_t C2FIFOCI0bits __asm__ ("C2FIFOCI0") __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOCI0CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOCI0SET __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOCI0INV __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOCON1 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned TXPRI:2;
    unsigned RTREN:1;
    unsigned TXREQ:1;
    unsigned TXERR:1;
    unsigned TXLARB:1;
    unsigned TXABAT:1;
    unsigned TXEN:1;
    unsigned :4;
    unsigned DONLY:1;
    unsigned UINC:1;
    unsigned FRESET:1;
    unsigned :1;
    unsigned FSIZE:5;
  };
  struct {
    unsigned w:32;
  };
} __C2FIFOCON1bits_t;
extern volatile __C2FIFOCON1bits_t C2FIFOCON1bits __asm__ ("C2FIFOCON1") __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOCON1CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOCON1SET __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOCON1INV __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOINT1 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned RXNEMPTYIF:1;
    unsigned RXHALFIF:1;
    unsigned RXFULLIF:1;
    unsigned RXOVFLIF:1;
    unsigned :4;
    unsigned TXEMPTYIF:1;
    unsigned TXHALFIF:1;
    unsigned TXNFULLIF:1;
    unsigned :5;
    unsigned RXNEMPTYIE:1;
    unsigned RXHALFIE:1;
    unsigned RXFULLIE:1;
    unsigned RXOVFLIE:1;
    unsigned :4;
    unsigned TXEMPTYIE:1;
    unsigned TXHALFIE:1;
    unsigned TXNFULLIE:1;
  };
  struct {
    unsigned w:32;
  };
} __C2FIFOINT1bits_t;
extern volatile __C2FIFOINT1bits_t C2FIFOINT1bits __asm__ ("C2FIFOINT1") __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOINT1CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOINT1SET __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOINT1INV __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOUA1 __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOUA1CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOUA1SET __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOUA1INV __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOCI1 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned CFIFOCI:5;
  };
  struct {
    unsigned w:32;
  };
} __C2FIFOCI1bits_t;
extern volatile __C2FIFOCI1bits_t C2FIFOCI1bits __asm__ ("C2FIFOCI1") __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOCI1CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOCI1SET __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOCI1INV __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOCON2 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned TXPRI:2;
    unsigned RTREN:1;
    unsigned TXREQ:1;
    unsigned TXERR:1;
    unsigned TXLARB:1;
    unsigned TXABAT:1;
    unsigned TXEN:1;
    unsigned :4;
    unsigned DONLY:1;
    unsigned UINC:1;
    unsigned FRESET:1;
    unsigned :1;
    unsigned FSIZE:5;
  };
  struct {
    unsigned w:32;
  };
} __C2FIFOCON2bits_t;
