HomuraVehicle/homuraLib_v2/machine/device/p32mx795f512h_forVC.c
extern volatile __C2FIFOCI8bits_t C2FIFOCI8bits __asm__ ("C2FIFOCI8") __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOCI8CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOCI8SET __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOCI8INV __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOCON9 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned TXPRI:2;
    unsigned RTREN:1;
    unsigned TXREQ:1;
    unsigned TXERR:1;
    unsigned TXLARB:1;
    unsigned TXABAT:1;
    unsigned TXEN:1;
    unsigned :4;
    unsigned DONLY:1;
    unsigned UINC:1;
    unsigned FRESET:1;
    unsigned :1;
    unsigned FSIZE:5;
  };
  struct {
    unsigned w:32;
  };
} __C2FIFOCON9bits_t;
extern volatile __C2FIFOCON9bits_t C2FIFOCON9bits __asm__ ("C2FIFOCON9") __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOCON9CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOCON9SET __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOCON9INV __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOINT9 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned RXNEMPTYIF:1;
    unsigned RXHALFIF:1;
    unsigned RXFULLIF:1;
    unsigned RXOVFLIF:1;
    unsigned :4;
    unsigned TXEMPTYIF:1;
    unsigned TXHALFIF:1;
    unsigned TXNFULLIF:1;
    unsigned :5;
    unsigned RXNEMPTYIE:1;
    unsigned RXHALFIE:1;
    unsigned RXFULLIE:1;
    unsigned RXOVFLIE:1;
    unsigned :4;
    unsigned TXEMPTYIE:1;
    unsigned TXHALFIE:1;
    unsigned TXNFULLIE:1;
  };
  struct {
    unsigned w:32;
  };
} __C2FIFOINT9bits_t;
extern volatile __C2FIFOINT9bits_t C2FIFOINT9bits __asm__ ("C2FIFOINT9") __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOINT9CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOINT9SET __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOINT9INV __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOUA9 __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOUA9CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOUA9SET __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOUA9INV __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOCI9 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned CFIFOCI:5;
  };
  struct {
    unsigned w:32;
  };
} __C2FIFOCI9bits_t;
extern volatile __C2FIFOCI9bits_t C2FIFOCI9bits __asm__ ("C2FIFOCI9") __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOCI9CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOCI9SET __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOCI9INV __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOCON10 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned TXPRI:2;
    unsigned RTREN:1;
    unsigned TXREQ:1;
    unsigned TXERR:1;
    unsigned TXLARB:1;
    unsigned TXABAT:1;
    unsigned TXEN:1;
    unsigned :4;
    unsigned DONLY:1;
    unsigned UINC:1;
    unsigned FRESET:1;
    unsigned :1;
    unsigned FSIZE:5;
  };
  struct {
    unsigned w:32;
  };
} __C2FIFOCON10bits_t;
extern volatile __C2FIFOCON10bits_t C2FIFOCON10bits __asm__ ("C2FIFOCON10") __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOCON10CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOCON10SET __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOCON10INV __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOINT10 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned RXNEMPTYIF:1;
    unsigned RXHALFIF:1;
    unsigned RXFULLIF:1;
    unsigned RXOVFLIF:1;
    unsigned :4;
    unsigned TXEMPTYIF:1;
    unsigned TXHALFIF:1;
    unsigned TXNFULLIF:1;
    unsigned :5;
    unsigned RXNEMPTYIE:1;
    unsigned RXHALFIE:1;
    unsigned RXFULLIE:1;
    unsigned RXOVFLIE:1;
    unsigned :4;
    unsigned TXEMPTYIE:1;
    unsigned TXHALFIE:1;
    unsigned TXNFULLIE:1;
  };
  struct {
    unsigned w:32;
  };
} __C2FIFOINT10bits_t;
extern volatile __C2FIFOINT10bits_t C2FIFOINT10bits __asm__ ("C2FIFOINT10") __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOINT10CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOINT10SET __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOINT10INV __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOUA10 __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOUA10CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOUA10SET __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOUA10INV __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOCI10 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned CFIFOCI:5;
  };
  struct {
    unsigned w:32;
  };
} __C2FIFOCI10bits_t;
extern volatile __C2FIFOCI10bits_t C2FIFOCI10bits __asm__ ("C2FIFOCI10") __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOCI10CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOCI10SET __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOCI10INV __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOCON11 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned TXPRI:2;
    unsigned RTREN:1;
    unsigned TXREQ:1;
    unsigned TXERR:1;
    unsigned TXLARB:1;
    unsigned TXABAT:1;
    unsigned TXEN:1;
    unsigned :4;
    unsigned DONLY:1;
    unsigned UINC:1;
    unsigned FRESET:1;
    unsigned :1;
    unsigned FSIZE:5;
  };
  struct {
    unsigned w:32;
  };
} __C2FIFOCON11bits_t;
extern volatile __C2FIFOCON11bits_t C2FIFOCON11bits __asm__ ("C2FIFOCON11") __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOCON11CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOCON11SET __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOCON11INV __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOINT11 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned RXNEMPTYIF:1;
    unsigned RXHALFIF:1;
    unsigned RXFULLIF:1;
    unsigned RXOVFLIF:1;
    unsigned :4;
    unsigned TXEMPTYIF:1;
    unsigned TXHALFIF:1;
    unsigned TXNFULLIF:1;
    unsigned :5;
    unsigned RXNEMPTYIE:1;
    unsigned RXHALFIE:1;
    unsigned RXFULLIE:1;
    unsigned RXOVFLIE:1;
    unsigned :4;
    unsigned TXEMPTYIE:1;
    unsigned TXHALFIE:1;
    unsigned TXNFULLIE:1;
  };
  struct {
    unsigned w:32;
  };
} __C2FIFOINT11bits_t;
extern volatile __C2FIFOINT11bits_t C2FIFOINT11bits __asm__ ("C2FIFOINT11") __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOINT11CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOINT11SET __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOINT11INV __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOUA11 __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOUA11CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOUA11SET __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOUA11INV __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOCI11 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned CFIFOCI:5;
  };
  struct {
    unsigned w:32;
  };
} __C2FIFOCI11bits_t;
extern volatile __C2FIFOCI11bits_t C2FIFOCI11bits __asm__ ("C2FIFOCI11") __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOCI11CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOCI11SET __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOCI11INV __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOCON12 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned TXPRI:2;
    unsigned RTREN:1;
    unsigned TXREQ:1;
    unsigned TXERR:1;
    unsigned TXLARB:1;
    unsigned TXABAT:1;
    unsigned TXEN:1;
    unsigned :4;
    unsigned DONLY:1;
    unsigned UINC:1;
    unsigned FRESET:1;
    unsigned :1;
    unsigned FSIZE:5;
  };
  struct {
    unsigned w:32;
  };
} __C2FIFOCON12bits_t;
