HomuraVehicle/homuraLib_v2/machine/device/p32mx795f512h_forVC.c
extern volatile __C2FIFOCI22bits_t C2FIFOCI22bits __asm__ ("C2FIFOCI22") __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOCI22CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOCI22SET __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOCI22INV __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOCON23 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned TXPRI:2;
    unsigned RTREN:1;
    unsigned TXREQ:1;
    unsigned TXERR:1;
    unsigned TXLARB:1;
    unsigned TXABAT:1;
    unsigned TXEN:1;
    unsigned :4;
    unsigned DONLY:1;
    unsigned UINC:1;
    unsigned FRESET:1;
    unsigned :1;
    unsigned FSIZE:5;
  };
  struct {
    unsigned w:32;
  };
} __C2FIFOCON23bits_t;
extern volatile __C2FIFOCON23bits_t C2FIFOCON23bits __asm__ ("C2FIFOCON23") __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOCON23CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOCON23SET __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOCON23INV __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOINT23 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned RXNEMPTYIF:1;
    unsigned RXHALFIF:1;
    unsigned RXFULLIF:1;
    unsigned RXOVFLIF:1;
    unsigned :4;
    unsigned TXEMPTYIF:1;
    unsigned TXHALFIF:1;
    unsigned TXNFULLIF:1;
    unsigned :5;
    unsigned RXNEMPTYIE:1;
    unsigned RXHALFIE:1;
    unsigned RXFULLIE:1;
    unsigned RXOVFLIE:1;
    unsigned :4;
    unsigned TXEMPTYIE:1;
    unsigned TXHALFIE:1;
    unsigned TXNFULLIE:1;
  };
  struct {
    unsigned w:32;
  };
} __C2FIFOINT23bits_t;
extern volatile __C2FIFOINT23bits_t C2FIFOINT23bits __asm__ ("C2FIFOINT23") __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOINT23CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOINT23SET __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOINT23INV __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOUA23 __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOUA23CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOUA23SET __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOUA23INV __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOCI23 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned CFIFOCI:5;
  };
  struct {
    unsigned w:32;
  };
} __C2FIFOCI23bits_t;
extern volatile __C2FIFOCI23bits_t C2FIFOCI23bits __asm__ ("C2FIFOCI23") __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOCI23CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOCI23SET __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOCI23INV __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOCON24 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned TXPRI:2;
    unsigned RTREN:1;
    unsigned TXREQ:1;
    unsigned TXERR:1;
    unsigned TXLARB:1;
    unsigned TXABAT:1;
    unsigned TXEN:1;
    unsigned :4;
    unsigned DONLY:1;
    unsigned UINC:1;
    unsigned FRESET:1;
    unsigned :1;
    unsigned FSIZE:5;
  };
  struct {
    unsigned w:32;
  };
} __C2FIFOCON24bits_t;
extern volatile __C2FIFOCON24bits_t C2FIFOCON24bits __asm__ ("C2FIFOCON24") __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOCON24CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOCON24SET __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOCON24INV __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOINT24 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned RXNEMPTYIF:1;
    unsigned RXHALFIF:1;
    unsigned RXFULLIF:1;
    unsigned RXOVFLIF:1;
    unsigned :4;
    unsigned TXEMPTYIF:1;
    unsigned TXHALFIF:1;
    unsigned TXNFULLIF:1;
    unsigned :5;
    unsigned RXNEMPTYIE:1;
    unsigned RXHALFIE:1;
    unsigned RXFULLIE:1;
    unsigned RXOVFLIE:1;
    unsigned :4;
    unsigned TXEMPTYIE:1;
    unsigned TXHALFIE:1;
    unsigned TXNFULLIE:1;
  };
  struct {
    unsigned w:32;
  };
} __C2FIFOINT24bits_t;
extern volatile __C2FIFOINT24bits_t C2FIFOINT24bits __asm__ ("C2FIFOINT24") __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOINT24CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOINT24SET __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOINT24INV __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOUA24 __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOUA24CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOUA24SET __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOUA24INV __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOCI24 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned CFIFOCI:5;
  };
  struct {
    unsigned w:32;
  };
} __C2FIFOCI24bits_t;
extern volatile __C2FIFOCI24bits_t C2FIFOCI24bits __asm__ ("C2FIFOCI24") __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOCI24CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOCI24SET __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOCI24INV __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOCON25 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned TXPRI:2;
    unsigned RTREN:1;
    unsigned TXREQ:1;
    unsigned TXERR:1;
    unsigned TXLARB:1;
    unsigned TXABAT:1;
    unsigned TXEN:1;
    unsigned :4;
    unsigned DONLY:1;
    unsigned UINC:1;
    unsigned FRESET:1;
    unsigned :1;
    unsigned FSIZE:5;
  };
  struct {
    unsigned w:32;
  };
} __C2FIFOCON25bits_t;
extern volatile __C2FIFOCON25bits_t C2FIFOCON25bits __asm__ ("C2FIFOCON25") __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOCON25CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOCON25SET __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOCON25INV __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOINT25 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned RXNEMPTYIF:1;
    unsigned RXHALFIF:1;
    unsigned RXFULLIF:1;
    unsigned RXOVFLIF:1;
    unsigned :4;
    unsigned TXEMPTYIF:1;
    unsigned TXHALFIF:1;
    unsigned TXNFULLIF:1;
    unsigned :5;
    unsigned RXNEMPTYIE:1;
    unsigned RXHALFIE:1;
    unsigned RXFULLIE:1;
    unsigned RXOVFLIE:1;
    unsigned :4;
    unsigned TXEMPTYIE:1;
    unsigned TXHALFIE:1;
    unsigned TXNFULLIE:1;
  };
  struct {
    unsigned w:32;
  };
} __C2FIFOINT25bits_t;
extern volatile __C2FIFOINT25bits_t C2FIFOINT25bits __asm__ ("C2FIFOINT25") __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOINT25CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOINT25SET __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOINT25INV __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOUA25 __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOUA25CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOUA25SET __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOUA25INV __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOCI25 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned CFIFOCI:5;
  };
  struct {
    unsigned w:32;
  };
} __C2FIFOCI25bits_t;
extern volatile __C2FIFOCI25bits_t C2FIFOCI25bits __asm__ ("C2FIFOCI25") __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOCI25CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOCI25SET __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOCI25INV __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOCON26 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned TXPRI:2;
    unsigned RTREN:1;
    unsigned TXREQ:1;
    unsigned TXERR:1;
    unsigned TXLARB:1;
    unsigned TXABAT:1;
    unsigned TXEN:1;
    unsigned :4;
    unsigned DONLY:1;
    unsigned UINC:1;
    unsigned FRESET:1;
    unsigned :1;
    unsigned FSIZE:5;
  };
  struct {
    unsigned w:32;
  };
} __C2FIFOCON26bits_t;
