HomuraVehicle/homuraLib_v2/machine/device/p32mx795f512h_forVC.c
extern volatile __C2FIFOCON26bits_t C2FIFOCON26bits __asm__ ("C2FIFOCON26") __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOCON26CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOCON26SET __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOCON26INV __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOINT26 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned RXNEMPTYIF:1;
    unsigned RXHALFIF:1;
    unsigned RXFULLIF:1;
    unsigned RXOVFLIF:1;
    unsigned :4;
    unsigned TXEMPTYIF:1;
    unsigned TXHALFIF:1;
    unsigned TXNFULLIF:1;
    unsigned :5;
    unsigned RXNEMPTYIE:1;
    unsigned RXHALFIE:1;
    unsigned RXFULLIE:1;
    unsigned RXOVFLIE:1;
    unsigned :4;
    unsigned TXEMPTYIE:1;
    unsigned TXHALFIE:1;
    unsigned TXNFULLIE:1;
  };
  struct {
    unsigned w:32;
  };
} __C2FIFOINT26bits_t;
extern volatile __C2FIFOINT26bits_t C2FIFOINT26bits __asm__ ("C2FIFOINT26") __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOINT26CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOINT26SET __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOINT26INV __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOUA26 __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOUA26CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOUA26SET __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOUA26INV __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOCI26 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned CFIFOCI:5;
  };
  struct {
    unsigned w:32;
  };
} __C2FIFOCI26bits_t;
extern volatile __C2FIFOCI26bits_t C2FIFOCI26bits __asm__ ("C2FIFOCI26") __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOCI26CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOCI26SET __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOCI26INV __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOCON27 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned TXPRI:2;
    unsigned RTREN:1;
    unsigned TXREQ:1;
    unsigned TXERR:1;
    unsigned TXLARB:1;
    unsigned TXABAT:1;
    unsigned TXEN:1;
    unsigned :4;
    unsigned DONLY:1;
    unsigned UINC:1;
    unsigned FRESET:1;
    unsigned :1;
    unsigned FSIZE:5;
  };
  struct {
    unsigned w:32;
  };
} __C2FIFOCON27bits_t;
extern volatile __C2FIFOCON27bits_t C2FIFOCON27bits __asm__ ("C2FIFOCON27") __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOCON27CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOCON27SET __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOCON27INV __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOINT27 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned RXNEMPTYIF:1;
    unsigned RXHALFIF:1;
    unsigned RXFULLIF:1;
    unsigned RXOVFLIF:1;
    unsigned :4;
    unsigned TXEMPTYIF:1;
    unsigned TXHALFIF:1;
    unsigned TXNFULLIF:1;
    unsigned :5;
    unsigned RXNEMPTYIE:1;
    unsigned RXHALFIE:1;
    unsigned RXFULLIE:1;
    unsigned RXOVFLIE:1;
    unsigned :4;
    unsigned TXEMPTYIE:1;
    unsigned TXHALFIE:1;
    unsigned TXNFULLIE:1;
  };
  struct {
    unsigned w:32;
  };
} __C2FIFOINT27bits_t;
extern volatile __C2FIFOINT27bits_t C2FIFOINT27bits __asm__ ("C2FIFOINT27") __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOINT27CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOINT27SET __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOINT27INV __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOUA27 __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOUA27CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOUA27SET __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOUA27INV __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOCI27 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned CFIFOCI:5;
  };
  struct {
    unsigned w:32;
  };
} __C2FIFOCI27bits_t;
extern volatile __C2FIFOCI27bits_t C2FIFOCI27bits __asm__ ("C2FIFOCI27") __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOCI27CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOCI27SET __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOCI27INV __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOCON28 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned TXPRI:2;
    unsigned RTREN:1;
    unsigned TXREQ:1;
    unsigned TXERR:1;
    unsigned TXLARB:1;
    unsigned TXABAT:1;
    unsigned TXEN:1;
    unsigned :4;
    unsigned DONLY:1;
    unsigned UINC:1;
    unsigned FRESET:1;
    unsigned :1;
    unsigned FSIZE:5;
  };
  struct {
    unsigned w:32;
  };
} __C2FIFOCON28bits_t;
extern volatile __C2FIFOCON28bits_t C2FIFOCON28bits __asm__ ("C2FIFOCON28") __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOCON28CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOCON28SET __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOCON28INV __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOINT28 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned RXNEMPTYIF:1;
    unsigned RXHALFIF:1;
    unsigned RXFULLIF:1;
    unsigned RXOVFLIF:1;
    unsigned :4;
    unsigned TXEMPTYIF:1;
    unsigned TXHALFIF:1;
    unsigned TXNFULLIF:1;
    unsigned :5;
    unsigned RXNEMPTYIE:1;
    unsigned RXHALFIE:1;
    unsigned RXFULLIE:1;
    unsigned RXOVFLIE:1;
    unsigned :4;
    unsigned TXEMPTYIE:1;
    unsigned TXHALFIE:1;
    unsigned TXNFULLIE:1;
  };
  struct {
    unsigned w:32;
  };
} __C2FIFOINT28bits_t;
extern volatile __C2FIFOINT28bits_t C2FIFOINT28bits __asm__ ("C2FIFOINT28") __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOINT28CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOINT28SET __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOINT28INV __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOUA28 __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOUA28CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOUA28SET __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOUA28INV __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOCI28 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned CFIFOCI:5;
  };
  struct {
    unsigned w:32;
  };
} __C2FIFOCI28bits_t;
extern volatile __C2FIFOCI28bits_t C2FIFOCI28bits __asm__ ("C2FIFOCI28") __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOCI28CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOCI28SET __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOCI28INV __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOCON29 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned TXPRI:2;
    unsigned RTREN:1;
    unsigned TXREQ:1;
    unsigned TXERR:1;
    unsigned TXLARB:1;
    unsigned TXABAT:1;
    unsigned TXEN:1;
    unsigned :4;
    unsigned DONLY:1;
    unsigned UINC:1;
    unsigned FRESET:1;
    unsigned :1;
    unsigned FSIZE:5;
  };
  struct {
    unsigned w:32;
  };
} __C2FIFOCON29bits_t;
extern volatile __C2FIFOCON29bits_t C2FIFOCON29bits __asm__ ("C2FIFOCON29") __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOCON29CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOCON29SET __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOCON29INV __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOINT29 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned RXNEMPTYIF:1;
    unsigned RXHALFIF:1;
    unsigned RXFULLIF:1;
    unsigned RXOVFLIF:1;
    unsigned :4;
    unsigned TXEMPTYIF:1;
    unsigned TXHALFIF:1;
    unsigned TXNFULLIF:1;
    unsigned :5;
    unsigned RXNEMPTYIE:1;
    unsigned RXHALFIE:1;
    unsigned RXFULLIE:1;
    unsigned RXOVFLIE:1;
    unsigned :4;
    unsigned TXEMPTYIE:1;
    unsigned TXHALFIE:1;
    unsigned TXNFULLIE:1;
  };
  struct {
    unsigned w:32;
  };
} __C2FIFOINT29bits_t;
extern volatile __C2FIFOINT29bits_t C2FIFOINT29bits __asm__ ("C2FIFOINT29") __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOINT29CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOINT29SET __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOINT29INV __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOUA29 __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOUA29CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOUA29SET __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOUA29INV __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOCI29 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned CFIFOCI:5;
  };
  struct {
    unsigned w:32;
  };
} __C2FIFOCI29bits_t;
