HomuraVehicle/homuraLib_v2/machine/device/p32mx795f512h_forVC.c
extern volatile __C2FIFOCI29bits_t C2FIFOCI29bits __asm__ ("C2FIFOCI29") __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOCI29CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOCI29SET __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOCI29INV __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOCON30 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned TXPRI:2;
    unsigned RTREN:1;
    unsigned TXREQ:1;
    unsigned TXERR:1;
    unsigned TXLARB:1;
    unsigned TXABAT:1;
    unsigned TXEN:1;
    unsigned :4;
    unsigned DONLY:1;
    unsigned UINC:1;
    unsigned FRESET:1;
    unsigned :1;
    unsigned FSIZE:5;
  };
  struct {
    unsigned w:32;
  };
} __C2FIFOCON30bits_t;
extern volatile __C2FIFOCON30bits_t C2FIFOCON30bits __asm__ ("C2FIFOCON30") __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOCON30CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOCON30SET __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOCON30INV __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOINT30 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned RXNEMPTYIF:1;
    unsigned RXHALFIF:1;
    unsigned RXFULLIF:1;
    unsigned RXOVFLIF:1;
    unsigned :4;
    unsigned TXEMPTYIF:1;
    unsigned TXHALFIF:1;
    unsigned TXNFULLIF:1;
    unsigned :5;
    unsigned RXNEMPTYIE:1;
    unsigned RXHALFIE:1;
    unsigned RXFULLIE:1;
    unsigned RXOVFLIE:1;
    unsigned :4;
    unsigned TXEMPTYIE:1;
    unsigned TXHALFIE:1;
    unsigned TXNFULLIE:1;
  };
  struct {
    unsigned w:32;
  };
} __C2FIFOINT30bits_t;
extern volatile __C2FIFOINT30bits_t C2FIFOINT30bits __asm__ ("C2FIFOINT30") __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOINT30CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOINT30SET __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOINT30INV __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOUA30 __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOUA30CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOUA30SET __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOUA30INV __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOCI30 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned CFIFOCI:5;
  };
  struct {
    unsigned w:32;
  };
} __C2FIFOCI30bits_t;
extern volatile __C2FIFOCI30bits_t C2FIFOCI30bits __asm__ ("C2FIFOCI30") __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOCI30CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOCI30SET __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOCI30INV __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOCON31 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned TXPRI:2;
    unsigned RTREN:1;
    unsigned TXREQ:1;
    unsigned TXERR:1;
    unsigned TXLARB:1;
    unsigned TXABAT:1;
    unsigned TXEN:1;
    unsigned :4;
    unsigned DONLY:1;
    unsigned UINC:1;
    unsigned FRESET:1;
    unsigned :1;
    unsigned FSIZE:5;
  };
  struct {
    unsigned w:32;
  };
} __C2FIFOCON31bits_t;
extern volatile __C2FIFOCON31bits_t C2FIFOCON31bits __asm__ ("C2FIFOCON31") __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOCON31CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOCON31SET __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOCON31INV __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOINT31 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned RXNEMPTYIF:1;
    unsigned RXHALFIF:1;
    unsigned RXFULLIF:1;
    unsigned RXOVFLIF:1;
    unsigned :4;
    unsigned TXEMPTYIF:1;
    unsigned TXHALFIF:1;
    unsigned TXNFULLIF:1;
    unsigned :5;
    unsigned RXNEMPTYIE:1;
    unsigned RXHALFIE:1;
    unsigned RXFULLIE:1;
    unsigned RXOVFLIE:1;
    unsigned :4;
    unsigned TXEMPTYIE:1;
    unsigned TXHALFIE:1;
    unsigned TXNFULLIE:1;
  };
  struct {
    unsigned w:32;
  };
} __C2FIFOINT31bits_t;
extern volatile __C2FIFOINT31bits_t C2FIFOINT31bits __asm__ ("C2FIFOINT31") __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOINT31CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOINT31SET __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOINT31INV __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOUA31 __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOUA31CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOUA31SET __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOUA31INV __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOCI31 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned CFIFOCI:5;
  };
  struct {
    unsigned w:32;
  };
} __C2FIFOCI31bits_t;
extern volatile __C2FIFOCI31bits_t C2FIFOCI31bits __asm__ ("C2FIFOCI31") __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOCI31CLR __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOCI31SET __attribute__((section("sfrs")));
extern volatile unsigned int        C2FIFOCI31INV __attribute__((section("sfrs")));
extern volatile unsigned int        DEVCFG3 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned USERID:16;
    unsigned FSRSSEL:3;
    unsigned :5;
    unsigned FMIIEN:1;
    unsigned FETHIO:1;
    unsigned FCANIO:1;
    unsigned :3;
    unsigned FUSBIDIO:1;
    unsigned FVBUSONIO:1;
  };
  struct {
    unsigned w:32;
  };
} __DEVCFG3bits_t;
