HomuraVehicle/homuraLib_v2/machine/device/p32mx795f512h_forVC.c
  .extern EMACxCFG2INV     /* 0xBF88921C */
  .extern EMAC1IPGT        /* 0xBF889220 */
  .extern EMACxIPGT        /* 0xBF889220 */
  .extern EMAC1IPGTCLR     /* 0xBF889224 */
  .extern EMACxIPGTCLR     /* 0xBF889224 */
  .extern EMAC1IPGTSET     /* 0xBF889228 */
  .extern EMACxIPGTSET     /* 0xBF889228 */
  .extern EMAC1IPGTINV     /* 0xBF88922C */
  .extern EMACxIPGTINV     /* 0xBF88922C */
  .extern EMAC1IPGR        /* 0xBF889230 */
  .extern EMACxIPGR        /* 0xBF889230 */
  .extern EMAC1IPGRCLR     /* 0xBF889234 */
  .extern EMACxIPGRCLR     /* 0xBF889234 */
  .extern EMAC1IPGRSET     /* 0xBF889238 */
  .extern EMACxIPGRSET     /* 0xBF889238 */
  .extern EMAC1IPGRINV     /* 0xBF88923C */
  .extern EMACxIPGRINV     /* 0xBF88923C */
  .extern EMAC1CLRT        /* 0xBF889240 */
  .extern EMACxCLRT        /* 0xBF889240 */
  .extern EMAC1CLRTCLR     /* 0xBF889244 */
  .extern EMACxCLRTCLR     /* 0xBF889244 */
  .extern EMAC1CLRTSET     /* 0xBF889248 */
  .extern EMACxCLRTSET     /* 0xBF889248 */
  .extern EMAC1CLRTINV     /* 0xBF88924C */
  .extern EMACxCLRTINV     /* 0xBF88924C */
  .extern EMAC1MAXF        /* 0xBF889250 */
  .extern EMACxMAXF        /* 0xBF889250 */
  .extern EMAC1MAXFCLR     /* 0xBF889254 */
  .extern EMACxMAXFCLR     /* 0xBF889254 */
  .extern EMAC1MAXFSET     /* 0xBF889258 */
  .extern EMACxMAXFSET     /* 0xBF889258 */
  .extern EMAC1MAXFINV     /* 0xBF88925C */
  .extern EMACxMAXFINV     /* 0xBF88925C */
  .extern EMAC1SUPP        /* 0xBF889260 */
  .extern EMACxSUPP        /* 0xBF889260 */
  .extern EMAC1SUPPCLR     /* 0xBF889264 */
  .extern EMACxSUPPCLR     /* 0xBF889264 */
  .extern EMAC1SUPPSET     /* 0xBF889268 */
  .extern EMACxSUPPSET     /* 0xBF889268 */
  .extern EMAC1SUPPINV     /* 0xBF88926C */
  .extern EMACxSUPPINV     /* 0xBF88926C */
  .extern EMAC1TEST        /* 0xBF889270 */
  .extern EMACxTEST        /* 0xBF889270 */
  .extern EMAC1TESTCLR     /* 0xBF889274 */
  .extern EMACxTESTCLR     /* 0xBF889274 */
  .extern EMAC1TESTSET     /* 0xBF889278 */
  .extern EMACxTESTSET     /* 0xBF889278 */
  .extern EMAC1TESTINV     /* 0xBF88927C */
  .extern EMACxTESTINV     /* 0xBF88927C */
  .extern EMAC1MCFG        /* 0xBF889280 */
  .extern EMACxMCFG        /* 0xBF889280 */
  .extern EMAC1MCFGCLR     /* 0xBF889284 */
  .extern EMACxMCFGCLR     /* 0xBF889284 */
  .extern EMAC1MCFGSET     /* 0xBF889288 */
  .extern EMACxMCFGSET     /* 0xBF889288 */
  .extern EMAC1MCFGINV     /* 0xBF88928C */
  .extern EMACxMCFGINV     /* 0xBF88928C */
  .extern EMAC1MCMD        /* 0xBF889290 */
  .extern EMACxMCMD        /* 0xBF889290 */
  .extern EMAC1MCMDCLR     /* 0xBF889294 */
  .extern EMACxMCMDCLR     /* 0xBF889294 */
  .extern EMAC1MCMDSET     /* 0xBF889298 */
  .extern EMACxMCMDSET     /* 0xBF889298 */
  .extern EMAC1MCMDINV     /* 0xBF88929C */
  .extern EMACxMCMDINV     /* 0xBF88929C */
  .extern EMAC1MADR        /* 0xBF8892A0 */
  .extern EMACxMADR        /* 0xBF8892A0 */
  .extern EMAC1MADRCLR     /* 0xBF8892A4 */
  .extern EMACxMADRCLR     /* 0xBF8892A4 */
  .extern EMAC1MADRSET     /* 0xBF8892A8 */
  .extern EMACxMADRSET     /* 0xBF8892A8 */
  .extern EMAC1MADRINV     /* 0xBF8892AC */
  .extern EMACxMADRINV     /* 0xBF8892AC */
  .extern EMAC1MWTD        /* 0xBF8892B0 */
  .extern EMACxMWTD        /* 0xBF8892B0 */
  .extern EMAC1MWTDCLR     /* 0xBF8892B4 */
  .extern EMACxMWTDCLR     /* 0xBF8892B4 */
  .extern EMAC1MWTDSET     /* 0xBF8892B8 */
  .extern EMACxMWTDSET     /* 0xBF8892B8 */
  .extern EMAC1MWTDINV     /* 0xBF8892BC */
  .extern EMACxMWTDINV     /* 0xBF8892BC */
  .extern EMAC1MRDD        /* 0xBF8892C0 */
  .extern EMACxMRDD        /* 0xBF8892C0 */
  .extern EMAC1MRDDCLR     /* 0xBF8892C4 */
  .extern EMACxMRDDCLR     /* 0xBF8892C4 */
  .extern EMAC1MRDDSET     /* 0xBF8892C8 */
  .extern EMACxMRDDSET     /* 0xBF8892C8 */
  .extern EMAC1MRDDINV     /* 0xBF8892CC */
  .extern EMACxMRDDINV     /* 0xBF8892CC */
  .extern EMAC1MIND        /* 0xBF8892D0 */
  .extern EMACxMIND        /* 0xBF8892D0 */
  .extern EMAC1MINDCLR     /* 0xBF8892D4 */
  .extern EMACxMINDCLR     /* 0xBF8892D4 */
  .extern EMAC1MINDSET     /* 0xBF8892D8 */
  .extern EMACxMINDSET     /* 0xBF8892D8 */
  .extern EMAC1MINDINV     /* 0xBF8892DC */
  .extern EMACxMINDINV     /* 0xBF8892DC */
  .extern EMAC1SA0         /* 0xBF889300 */
  .extern EMACxSA0         /* 0xBF889300 */
  .extern EMAC1SA0CLR      /* 0xBF889304 */
  .extern EMACxSA0CLR      /* 0xBF889304 */
  .extern EMAC1SA0SET      /* 0xBF889308 */
  .extern EMACxSA0SET      /* 0xBF889308 */
  .extern EMAC1SA0INV      /* 0xBF88930C */
  .extern EMACxSA0INV      /* 0xBF88930C */
  .extern EMAC1SA1         /* 0xBF889310 */
  .extern EMACxSA1         /* 0xBF889310 */
  .extern EMAC1SA1CLR      /* 0xBF889314 */
  .extern EMACxSA1CLR      /* 0xBF889314 */
  .extern EMAC1SA1SET      /* 0xBF889318 */
  .extern EMACxSA1SET      /* 0xBF889318 */
  .extern EMAC1SA1INV      /* 0xBF88931C */
  .extern EMACxSA1INV      /* 0xBF88931C */
  .extern EMAC1SA2         /* 0xBF889320 */
  .extern EMACxSA2         /* 0xBF889320 */
  .extern EMAC1SA2CLR      /* 0xBF889324 */
  .extern EMACxSA2CLR      /* 0xBF889324 */
  .extern EMAC1SA2SET      /* 0xBF889328 */
  .extern EMACxSA2SET      /* 0xBF889328 */
  .extern EMAC1SA2INV      /* 0xBF88932C */
  .extern EMACxSA2INV      /* 0xBF88932C */
  .extern C1CON            /* 0xBF88B000 */
  .extern C1CONCLR         /* 0xBF88B004 */
  .extern C1CONSET         /* 0xBF88B008 */
  .extern C1CONINV         /* 0xBF88B00C */
  .extern C1CFG            /* 0xBF88B010 */
  .extern C1CFGCLR         /* 0xBF88B014 */
  .extern C1CFGSET         /* 0xBF88B018 */
  .extern C1CFGINV         /* 0xBF88B01C */
  .extern C1INT            /* 0xBF88B020 */
  .extern C1INTCLR         /* 0xBF88B024 */
  .extern C1INTSET         /* 0xBF88B028 */
  .extern C1INTINV         /* 0xBF88B02C */
  .extern C1VEC            /* 0xBF88B030 */
  .extern C1VECCLR         /* 0xBF88B034 */
  .extern C1VECSET         /* 0xBF88B038 */
  .extern C1VECINV         /* 0xBF88B03C */
  .extern C1TREC           /* 0xBF88B040 */
  .extern C1TRECCLR        /* 0xBF88B044 */
  .extern C1TRECSET        /* 0xBF88B048 */
  .extern C1TRECINV        /* 0xBF88B04C */
  .extern C1FSTAT          /* 0xBF88B050 */
  .extern C1FSTATCLR       /* 0xBF88B054 */
  .extern C1FSTATSET       /* 0xBF88B058 */
  .extern C1FSTATINV       /* 0xBF88B05C */
  .extern C1RXOVF          /* 0xBF88B060 */
  .extern C1RXOVFCLR       /* 0xBF88B064 */
  .extern C1RXOVFSET       /* 0xBF88B068 */
  .extern C1RXOVFINV       /* 0xBF88B06C */
  .extern C1TMR            /* 0xBF88B070 */
  .extern C1TMRCLR         /* 0xBF88B074 */
  .extern C1TMRSET         /* 0xBF88B078 */
  .extern C1TMRINV         /* 0xBF88B07C */
  .extern C1RXM0           /* 0xBF88B080 */
  .extern C1RXM0CLR        /* 0xBF88B084 */
  .extern C1RXM0SET        /* 0xBF88B088 */
  .extern C1RXM0INV        /* 0xBF88B08C */
  .extern C1RXM1           /* 0xBF88B090 */
  .extern C1RXM1CLR        /* 0xBF88B094 */
  .extern C1RXM1SET        /* 0xBF88B098 */
  .extern C1RXM1INV        /* 0xBF88B09C */
  .extern C1RXM2           /* 0xBF88B0A0 */
  .extern C1RXM2CLR        /* 0xBF88B0A4 */
  .extern C1RXM2SET        /* 0xBF88B0A8 */
  .extern C1RXM2INV        /* 0xBF88B0AC */
  .extern C1RXM3           /* 0xBF88B0B0 */
  .extern C1RXM3CLR        /* 0xBF88B0B4 */
  .extern C1RXM3SET        /* 0xBF88B0B8 */
  .extern C1RXM3INV        /* 0xBF88B0BC */
  .extern C1FLTCON0        /* 0xBF88B0C0 */
  .extern C1FLTCON0CLR     /* 0xBF88B0C4 */
  .extern C1FLTCON0SET     /* 0xBF88B0C8 */
  .extern C1FLTCON0INV     /* 0xBF88B0CC */
  .extern C1FLTCON1        /* 0xBF88B0D0 */
  .extern C1FLTCON1CLR     /* 0xBF88B0D4 */
  .extern C1FLTCON1SET     /* 0xBF88B0D8 */
  .extern C1FLTCON1INV     /* 0xBF88B0DC */
  .extern C1FLTCON2        /* 0xBF88B0E0 */
  .extern C1FLTCON2CLR     /* 0xBF88B0E4 */
  .extern C1FLTCON2SET     /* 0xBF88B0E8 */
  .extern C1FLTCON2INV     /* 0xBF88B0EC */
  .extern C1FLTCON3        /* 0xBF88B0F0 */
  .extern C1FLTCON3CLR     /* 0xBF88B0F4 */
  .extern C1FLTCON3SET     /* 0xBF88B0F8 */
  .extern C1FLTCON3INV     /* 0xBF88B0FC */
  .extern C1FLTCON4        /* 0xBF88B100 */
  .extern C1FLTCON4CLR     /* 0xBF88B104 */
  .extern C1FLTCON4SET     /* 0xBF88B108 */
  .extern C1FLTCON4INV     /* 0xBF88B10C */
  .extern C1FLTCON5        /* 0xBF88B110 */
  .extern C1FLTCON5CLR     /* 0xBF88B114 */
  .extern C1FLTCON5SET     /* 0xBF88B118 */
  .extern C1FLTCON5INV     /* 0xBF88B11C */
  .extern C1FLTCON6        /* 0xBF88B120 */
  .extern C1FLTCON6CLR     /* 0xBF88B124 */
  .extern C1FLTCON6SET     /* 0xBF88B128 */
  .extern C1FLTCON6INV     /* 0xBF88B12C */
  .extern C1FLTCON7        /* 0xBF88B130 */
  .extern C1FLTCON7CLR     /* 0xBF88B134 */
  .extern C1FLTCON7SET     /* 0xBF88B138 */
  .extern C1FLTCON7INV     /* 0xBF88B13C */
  .extern C1RXF0           /* 0xBF88B140 */
  .extern C1RXF0CLR        /* 0xBF88B144 */
  .extern C1RXF0SET        /* 0xBF88B148 */
  .extern C1RXF0INV        /* 0xBF88B14C */
  .extern C1RXF1           /* 0xBF88B150 */
  .extern C1RXF1CLR        /* 0xBF88B154 */
  .extern C1RXF1SET        /* 0xBF88B158 */
  .extern C1RXF1INV        /* 0xBF88B15C */
  .extern C1RXF2           /* 0xBF88B160 */
  .extern C1RXF2CLR        /* 0xBF88B164 */
  .extern C1RXF2SET        /* 0xBF88B168 */
  .extern C1RXF2INV        /* 0xBF88B16C */
  .extern C1RXF3           /* 0xBF88B170 */
  .extern C1RXF3CLR        /* 0xBF88B174 */
  .extern C1RXF3SET        /* 0xBF88B178 */
  .extern C1RXF3INV        /* 0xBF88B17C */
  .extern C1RXF4           /* 0xBF88B180 */
  .extern C1RXF4CLR        /* 0xBF88B184 */
  .extern C1RXF4SET        /* 0xBF88B188 */
  .extern C1RXF4INV        /* 0xBF88B18C */
  .extern C1RXF5           /* 0xBF88B190 */
  .extern C1RXF5CLR        /* 0xBF88B194 */
  .extern C1RXF5SET        /* 0xBF88B198 */
  .extern C1RXF5INV        /* 0xBF88B19C */
  .extern C1RXF6           /* 0xBF88B1A0 */
  .extern C1RXF6CLR        /* 0xBF88B1A4 */
  .extern C1RXF6SET        /* 0xBF88B1A8 */
  .extern C1RXF6INV        /* 0xBF88B1AC */
  .extern C1RXF7           /* 0xBF88B1B0 */
  .extern C1RXF7CLR        /* 0xBF88B1B4 */
  .extern C1RXF7SET        /* 0xBF88B1B8 */
  .extern C1RXF7INV        /* 0xBF88B1BC */
  .extern C1RXF8           /* 0xBF88B1C0 */
  .extern C1RXF8CLR        /* 0xBF88B1C4 */
  .extern C1RXF8SET        /* 0xBF88B1C8 */
  .extern C1RXF8INV        /* 0xBF88B1CC */
  .extern C1RXF9           /* 0xBF88B1D0 */
  .extern C1RXF9CLR        /* 0xBF88B1D4 */
  .extern C1RXF9SET        /* 0xBF88B1D8 */
  .extern C1RXF9INV        /* 0xBF88B1DC */
  .extern C1RXF10          /* 0xBF88B1E0 */
  .extern C1RXF10CLR       /* 0xBF88B1E4 */
  .extern C1RXF10SET       /* 0xBF88B1E8 */
  .extern C1RXF10INV       /* 0xBF88B1EC */
  .extern C1RXF11          /* 0xBF88B1F0 */
  .extern C1RXF11CLR       /* 0xBF88B1F4 */
  .extern C1RXF11SET       /* 0xBF88B1F8 */
  .extern C1RXF11INV       /* 0xBF88B1FC */
  .extern C1RXF12          /* 0xBF88B200 */
  .extern C1RXF12CLR       /* 0xBF88B204 */
  .extern C1RXF12SET       /* 0xBF88B208 */
  .extern C1RXF12INV       /* 0xBF88B20C */
  .extern C1RXF13          /* 0xBF88B210 */
  .extern C1RXF13CLR       /* 0xBF88B214 */
  .extern C1RXF13SET       /* 0xBF88B218 */
  .extern C1RXF13INV       /* 0xBF88B21C */
  .extern C1RXF14          /* 0xBF88B220 */
  .extern C1RXF14CLR       /* 0xBF88B224 */
  .extern C1RXF14SET       /* 0xBF88B228 */
  .extern C1RXF14INV       /* 0xBF88B22C */
  .extern C1RXF15          /* 0xBF88B230 */
  .extern C1RXF15CLR       /* 0xBF88B234 */
  .extern C1RXF15SET       /* 0xBF88B238 */
  .extern C1RXF15INV       /* 0xBF88B23C */
  .extern C1RXF16          /* 0xBF88B240 */
  .extern C1RXF16CLR       /* 0xBF88B244 */
  .extern C1RXF16SET       /* 0xBF88B248 */
  .extern C1RXF16INV       /* 0xBF88B24C */
  .extern C1RXF17          /* 0xBF88B250 */
  .extern C1RXF17CLR       /* 0xBF88B254 */
  .extern C1RXF17SET       /* 0xBF88B258 */
  .extern C1RXF17INV       /* 0xBF88B25C */
  .extern C1RXF18          /* 0xBF88B260 */
  .extern C1RXF18CLR       /* 0xBF88B264 */
  .extern C1RXF18SET       /* 0xBF88B268 */
  .extern C1RXF18INV       /* 0xBF88B26C */
  .extern C1RXF19          /* 0xBF88B270 */
  .extern C1RXF19CLR       /* 0xBF88B274 */
  .extern C1RXF19SET       /* 0xBF88B278 */
  .extern C1RXF19INV       /* 0xBF88B27C */
  .extern C1RXF20          /* 0xBF88B280 */
  .extern C1RXF20CLR       /* 0xBF88B284 */
  .extern C1RXF20SET       /* 0xBF88B288 */
  .extern C1RXF20INV       /* 0xBF88B28C */
  .extern C1RXF21          /* 0xBF88B290 */
  .extern C1RXF21CLR       /* 0xBF88B294 */
  .extern C1RXF21SET       /* 0xBF88B298 */
  .extern C1RXF21INV       /* 0xBF88B29C */
  .extern C1RXF22          /* 0xBF88B2A0 */
  .extern C1RXF22CLR       /* 0xBF88B2A4 */
  .extern C1RXF22SET       /* 0xBF88B2A8 */
  .extern C1RXF22INV       /* 0xBF88B2AC */
  .extern C1RXF23          /* 0xBF88B2B0 */
  .extern C1RXF23CLR       /* 0xBF88B2B4 */
  .extern C1RXF23SET       /* 0xBF88B2B8 */
  .extern C1RXF23INV       /* 0xBF88B2BC */
  .extern C1RXF24          /* 0xBF88B2C0 */
  .extern C1RXF24CLR       /* 0xBF88B2C4 */
  .extern C1RXF24SET       /* 0xBF88B2C8 */
  .extern C1RXF24INV       /* 0xBF88B2CC */
  .extern C1RXF25          /* 0xBF88B2D0 */
  .extern C1RXF25CLR       /* 0xBF88B2D4 */
  .extern C1RXF25SET       /* 0xBF88B2D8 */
  .extern C1RXF25INV       /* 0xBF88B2DC */
  .extern C1RXF26          /* 0xBF88B2E0 */
  .extern C1RXF26CLR       /* 0xBF88B2E4 */
  .extern C1RXF26SET       /* 0xBF88B2E8 */
  .extern C1RXF26INV       /* 0xBF88B2EC */
  .extern C1RXF27          /* 0xBF88B2F0 */
  .extern C1RXF27CLR       /* 0xBF88B2F4 */
  .extern C1RXF27SET       /* 0xBF88B2F8 */
  .extern C1RXF27INV       /* 0xBF88B2FC */
  .extern C1RXF28          /* 0xBF88B300 */
  .extern C1RXF28CLR       /* 0xBF88B304 */
  .extern C1RXF28SET       /* 0xBF88B308 */
  .extern C1RXF28INV       /* 0xBF88B30C */
  .extern C1RXF29          /* 0xBF88B310 */
  .extern C1RXF29CLR       /* 0xBF88B314 */
  .extern C1RXF29SET       /* 0xBF88B318 */
  .extern C1RXF29INV       /* 0xBF88B31C */
  .extern C1RXF30          /* 0xBF88B320 */
  .extern C1RXF30CLR       /* 0xBF88B324 */
  .extern C1RXF30SET       /* 0xBF88B328 */
  .extern C1RXF30INV       /* 0xBF88B32C */
  .extern C1RXF31          /* 0xBF88B330 */
  .extern C1RXF31CLR       /* 0xBF88B334 */
  .extern C1RXF31SET       /* 0xBF88B338 */
  .extern C1RXF31INV       /* 0xBF88B33C */
  .extern C1FIFOBA         /* 0xBF88B340 */
  .extern C1FIFOBACLR      /* 0xBF88B344 */
  .extern C1FIFOBASET      /* 0xBF88B348 */
  .extern C1FIFOBAINV      /* 0xBF88B34C */
  .extern C1FIFOCON0       /* 0xBF88B350 */
  .extern C1FIFOCON0CLR    /* 0xBF88B354 */
  .extern C1FIFOCON0SET    /* 0xBF88B358 */
  .extern C1FIFOCON0INV    /* 0xBF88B35C */
  .extern C1FIFOINT0       /* 0xBF88B360 */
  .extern C1FIFOINT0CLR    /* 0xBF88B364 */
  .extern C1FIFOINT0SET    /* 0xBF88B368 */
  .extern C1FIFOINT0INV    /* 0xBF88B36C */
  .extern C1FIFOUA0        /* 0xBF88B370 */
  .extern C1FIFOUA0CLR     /* 0xBF88B374 */
  .extern C1FIFOUA0SET     /* 0xBF88B378 */
  .extern C1FIFOUA0INV     /* 0xBF88B37C */
  .extern C1FIFOCI0        /* 0xBF88B380 */
  .extern C1FIFOCI0CLR     /* 0xBF88B384 */
  .extern C1FIFOCI0SET     /* 0xBF88B388 */
  .extern C1FIFOCI0INV     /* 0xBF88B38C */
  .extern C1FIFOCON1       /* 0xBF88B390 */
  .extern C1FIFOCON1CLR    /* 0xBF88B394 */
  .extern C1FIFOCON1SET    /* 0xBF88B398 */
  .extern C1FIFOCON1INV    /* 0xBF88B39C */
  .extern C1FIFOINT1       /* 0xBF88B3A0 */
  .extern C1FIFOINT1CLR    /* 0xBF88B3A4 */
  .extern C1FIFOINT1SET    /* 0xBF88B3A8 */
  .extern C1FIFOINT1INV    /* 0xBF88B3AC */
  .extern C1FIFOUA1        /* 0xBF88B3B0 */
  .extern C1FIFOUA1CLR     /* 0xBF88B3B4 */
  .extern C1FIFOUA1SET     /* 0xBF88B3B8 */
  .extern C1FIFOUA1INV     /* 0xBF88B3BC */
  .extern C1FIFOCI1        /* 0xBF88B3C0 */
  .extern C1FIFOCI1CLR     /* 0xBF88B3C4 */
  .extern C1FIFOCI1SET     /* 0xBF88B3C8 */
  .extern C1FIFOCI1INV     /* 0xBF88B3CC */
  .extern C1FIFOCON2       /* 0xBF88B3D0 */
  .extern C1FIFOCON2CLR    /* 0xBF88B3D4 */
  .extern C1FIFOCON2SET    /* 0xBF88B3D8 */
  .extern C1FIFOCON2INV    /* 0xBF88B3DC */
  .extern C1FIFOINT2       /* 0xBF88B3E0 */
  .extern C1FIFOINT2CLR    /* 0xBF88B3E4 */
  .extern C1FIFOINT2SET    /* 0xBF88B3E8 */
  .extern C1FIFOINT2INV    /* 0xBF88B3EC */
  .extern C1FIFOUA2        /* 0xBF88B3F0 */
  .extern C1FIFOUA2CLR     /* 0xBF88B3F4 */
  .extern C1FIFOUA2SET     /* 0xBF88B3F8 */
  .extern C1FIFOUA2INV     /* 0xBF88B3FC */
  .extern C1FIFOCI2        /* 0xBF88B400 */
  .extern C1FIFOCI2CLR     /* 0xBF88B404 */
  .extern C1FIFOCI2SET     /* 0xBF88B408 */
  .extern C1FIFOCI2INV     /* 0xBF88B40C */
  .extern C1FIFOCON3       /* 0xBF88B410 */
  .extern C1FIFOCON3CLR    /* 0xBF88B414 */
  .extern C1FIFOCON3SET    /* 0xBF88B418 */
  .extern C1FIFOCON3INV    /* 0xBF88B41C */
  .extern C1FIFOINT3       /* 0xBF88B420 */
  .extern C1FIFOINT3CLR    /* 0xBF88B424 */
  .extern C1FIFOINT3SET    /* 0xBF88B428 */
  .extern C1FIFOINT3INV    /* 0xBF88B42C */
  .extern C1FIFOUA3        /* 0xBF88B430 */
  .extern C1FIFOUA3CLR     /* 0xBF88B434 */
  .extern C1FIFOUA3SET     /* 0xBF88B438 */
  .extern C1FIFOUA3INV     /* 0xBF88B43C */
  .extern C1FIFOCI3        /* 0xBF88B440 */
  .extern C1FIFOCI3CLR     /* 0xBF88B444 */
  .extern C1FIFOCI3SET     /* 0xBF88B448 */
  .extern C1FIFOCI3INV     /* 0xBF88B44C */
  .extern C1FIFOCON4       /* 0xBF88B450 */
  .extern C1FIFOCON4CLR    /* 0xBF88B454 */
  .extern C1FIFOCON4SET    /* 0xBF88B458 */
  .extern C1FIFOCON4INV    /* 0xBF88B45C */
  .extern C1FIFOINT4       /* 0xBF88B460 */
  .extern C1FIFOINT4CLR    /* 0xBF88B464 */
  .extern C1FIFOINT4SET    /* 0xBF88B468 */
  .extern C1FIFOINT4INV    /* 0xBF88B46C */
  .extern C1FIFOUA4        /* 0xBF88B470 */
  .extern C1FIFOUA4CLR     /* 0xBF88B474 */
  .extern C1FIFOUA4SET     /* 0xBF88B478 */
  .extern C1FIFOUA4INV     /* 0xBF88B47C */
  .extern C1FIFOCI4        /* 0xBF88B480 */
  .extern C1FIFOCI4CLR     /* 0xBF88B484 */
  .extern C1FIFOCI4SET     /* 0xBF88B488 */
  .extern C1FIFOCI4INV     /* 0xBF88B48C */
  .extern C1FIFOCON5       /* 0xBF88B490 */
  .extern C1FIFOCON5CLR    /* 0xBF88B494 */
  .extern C1FIFOCON5SET    /* 0xBF88B498 */
  .extern C1FIFOCON5INV    /* 0xBF88B49C */
  .extern C1FIFOINT5       /* 0xBF88B4A0 */
  .extern C1FIFOINT5CLR    /* 0xBF88B4A4 */
  .extern C1FIFOINT5SET    /* 0xBF88B4A8 */
  .extern C1FIFOINT5INV    /* 0xBF88B4AC */
  .extern C1FIFOUA5        /* 0xBF88B4B0 */
  .extern C1FIFOUA5CLR     /* 0xBF88B4B4 */
  .extern C1FIFOUA5SET     /* 0xBF88B4B8 */
  .extern C1FIFOUA5INV     /* 0xBF88B4BC */
  .extern C1FIFOCI5        /* 0xBF88B4C0 */
  .extern C1FIFOCI5CLR     /* 0xBF88B4C4 */
  .extern C1FIFOCI5SET     /* 0xBF88B4C8 */
  .extern C1FIFOCI5INV     /* 0xBF88B4CC */
  .extern C1FIFOCON6       /* 0xBF88B4D0 */
  .extern C1FIFOCON6CLR    /* 0xBF88B4D4 */
  .extern C1FIFOCON6SET    /* 0xBF88B4D8 */
  .extern C1FIFOCON6INV    /* 0xBF88B4DC */
  .extern C1FIFOINT6       /* 0xBF88B4E0 */
  .extern C1FIFOINT6CLR    /* 0xBF88B4E4 */
  .extern C1FIFOINT6SET    /* 0xBF88B4E8 */
  .extern C1FIFOINT6INV    /* 0xBF88B4EC */
  .extern C1FIFOUA6        /* 0xBF88B4F0 */
  .extern C1FIFOUA6CLR     /* 0xBF88B4F4 */
  .extern C1FIFOUA6SET     /* 0xBF88B4F8 */
  .extern C1FIFOUA6INV     /* 0xBF88B4FC */
  .extern C1FIFOCI6        /* 0xBF88B500 */
  .extern C1FIFOCI6CLR     /* 0xBF88B504 */
  .extern C1FIFOCI6SET     /* 0xBF88B508 */
  .extern C1FIFOCI6INV     /* 0xBF88B50C */
  .extern C1FIFOCON7       /* 0xBF88B510 */
  .extern C1FIFOCON7CLR    /* 0xBF88B514 */
  .extern C1FIFOCON7SET    /* 0xBF88B518 */
  .extern C1FIFOCON7INV    /* 0xBF88B51C */
  .extern C1FIFOINT7       /* 0xBF88B520 */
  .extern C1FIFOINT7CLR    /* 0xBF88B524 */
  .extern C1FIFOINT7SET    /* 0xBF88B528 */
  .extern C1FIFOINT7INV    /* 0xBF88B52C */
  .extern C1FIFOUA7        /* 0xBF88B530 */
  .extern C1FIFOUA7CLR     /* 0xBF88B534 */
  .extern C1FIFOUA7SET     /* 0xBF88B538 */
  .extern C1FIFOUA7INV     /* 0xBF88B53C */
  .extern C1FIFOCI7        /* 0xBF88B540 */
  .extern C1FIFOCI7CLR     /* 0xBF88B544 */
  .extern C1FIFOCI7SET     /* 0xBF88B548 */
  .extern C1FIFOCI7INV     /* 0xBF88B54C */
  .extern C1FIFOCON8       /* 0xBF88B550 */
  .extern C1FIFOCON8CLR    /* 0xBF88B554 */
  .extern C1FIFOCON8SET    /* 0xBF88B558 */
  .extern C1FIFOCON8INV    /* 0xBF88B55C */
  .extern C1FIFOINT8       /* 0xBF88B560 */
  .extern C1FIFOINT8CLR    /* 0xBF88B564 */
  .extern C1FIFOINT8SET    /* 0xBF88B568 */
  .extern C1FIFOINT8INV    /* 0xBF88B56C */
  .extern C1FIFOUA8        /* 0xBF88B570 */
  .extern C1FIFOUA8CLR     /* 0xBF88B574 */
  .extern C1FIFOUA8SET     /* 0xBF88B578 */
  .extern C1FIFOUA8INV     /* 0xBF88B57C */
  .extern C1FIFOCI8        /* 0xBF88B580 */
  .extern C1FIFOCI8CLR     /* 0xBF88B584 */
  .extern C1FIFOCI8SET     /* 0xBF88B588 */
  .extern C1FIFOCI8INV     /* 0xBF88B58C */
  .extern C1FIFOCON9       /* 0xBF88B590 */
  .extern C1FIFOCON9CLR    /* 0xBF88B594 */
  .extern C1FIFOCON9SET    /* 0xBF88B598 */
  .extern C1FIFOCON9INV    /* 0xBF88B59C */
  .extern C1FIFOINT9       /* 0xBF88B5A0 */
  .extern C1FIFOINT9CLR    /* 0xBF88B5A4 */
  .extern C1FIFOINT9SET    /* 0xBF88B5A8 */
  .extern C1FIFOINT9INV    /* 0xBF88B5AC */
  .extern C1FIFOUA9        /* 0xBF88B5B0 */
  .extern C1FIFOUA9CLR     /* 0xBF88B5B4 */
  .extern C1FIFOUA9SET     /* 0xBF88B5B8 */
  .extern C1FIFOUA9INV     /* 0xBF88B5BC */
  .extern C1FIFOCI9        /* 0xBF88B5C0 */
  .extern C1FIFOCI9CLR     /* 0xBF88B5C4 */
  .extern C1FIFOCI9SET     /* 0xBF88B5C8 */
  .extern C1FIFOCI9INV     /* 0xBF88B5CC */
  .extern C1FIFOCON10      /* 0xBF88B5D0 */
  .extern C1FIFOCON10CLR   /* 0xBF88B5D4 */
  .extern C1FIFOCON10SET   /* 0xBF88B5D8 */
  .extern C1FIFOCON10INV   /* 0xBF88B5DC */
  .extern C1FIFOINT10      /* 0xBF88B5E0 */
  .extern C1FIFOINT10CLR   /* 0xBF88B5E4 */
  .extern C1FIFOINT10SET   /* 0xBF88B5E8 */
  .extern C1FIFOINT10INV   /* 0xBF88B5EC */
  .extern C1FIFOUA10       /* 0xBF88B5F0 */
  .extern C1FIFOUA10CLR    /* 0xBF88B5F4 */
  .extern C1FIFOUA10SET    /* 0xBF88B5F8 */
  .extern C1FIFOUA10INV    /* 0xBF88B5FC */
  .extern C1FIFOCI10       /* 0xBF88B600 */
  .extern C1FIFOCI10CLR    /* 0xBF88B604 */
  .extern C1FIFOCI10SET    /* 0xBF88B608 */
  .extern C1FIFOCI10INV    /* 0xBF88B60C */
  .extern C1FIFOCON11      /* 0xBF88B610 */
  .extern C1FIFOCON11CLR   /* 0xBF88B614 */
  .extern C1FIFOCON11SET   /* 0xBF88B618 */
  .extern C1FIFOCON11INV   /* 0xBF88B61C */
  .extern C1FIFOINT11      /* 0xBF88B620 */
  .extern C1FIFOINT11CLR   /* 0xBF88B624 */
  .extern C1FIFOINT11SET   /* 0xBF88B628 */
  .extern C1FIFOINT11INV   /* 0xBF88B62C */
  .extern C1FIFOUA11       /* 0xBF88B630 */
  .extern C1FIFOUA11CLR    /* 0xBF88B634 */
  .extern C1FIFOUA11SET    /* 0xBF88B638 */
  .extern C1FIFOUA11INV    /* 0xBF88B63C */
  .extern C1FIFOCI11       /* 0xBF88B640 */
  .extern C1FIFOCI11CLR    /* 0xBF88B644 */
  .extern C1FIFOCI11SET    /* 0xBF88B648 */
  .extern C1FIFOCI11INV    /* 0xBF88B64C */
  .extern C1FIFOCON12      /* 0xBF88B650 */
  .extern C1FIFOCON12CLR   /* 0xBF88B654 */
  .extern C1FIFOCON12SET   /* 0xBF88B658 */
  .extern C1FIFOCON12INV   /* 0xBF88B65C */
  .extern C1FIFOINT12      /* 0xBF88B660 */
  .extern C1FIFOINT12CLR   /* 0xBF88B664 */
  .extern C1FIFOINT12SET   /* 0xBF88B668 */
  .extern C1FIFOINT12INV   /* 0xBF88B66C */
  .extern C1FIFOUA12       /* 0xBF88B670 */
  .extern C1FIFOUA12CLR    /* 0xBF88B674 */
  .extern C1FIFOUA12SET    /* 0xBF88B678 */
  .extern C1FIFOUA12INV    /* 0xBF88B67C */
  .extern C1FIFOCI12       /* 0xBF88B680 */
  .extern C1FIFOCI12CLR    /* 0xBF88B684 */
  .extern C1FIFOCI12SET    /* 0xBF88B688 */
  .extern C1FIFOCI12INV    /* 0xBF88B68C */
  .extern C1FIFOCON13      /* 0xBF88B690 */
  .extern C1FIFOCON13CLR   /* 0xBF88B694 */
  .extern C1FIFOCON13SET   /* 0xBF88B698 */
  .extern C1FIFOCON13INV   /* 0xBF88B69C */
