HomuraVehicle/homuraLib_v2/machine/device/p32mx795f512h_forVC.c
  .extern C1FIFOINT13      /* 0xBF88B6A0 */
  .extern C1FIFOINT13CLR   /* 0xBF88B6A4 */
  .extern C1FIFOINT13SET   /* 0xBF88B6A8 */
  .extern C1FIFOINT13INV   /* 0xBF88B6AC */
  .extern C1FIFOUA13       /* 0xBF88B6B0 */
  .extern C1FIFOUA13CLR    /* 0xBF88B6B4 */
  .extern C1FIFOUA13SET    /* 0xBF88B6B8 */
  .extern C1FIFOUA13INV    /* 0xBF88B6BC */
  .extern C1FIFOCI13       /* 0xBF88B6C0 */
  .extern C1FIFOCI13CLR    /* 0xBF88B6C4 */
  .extern C1FIFOCI13SET    /* 0xBF88B6C8 */
  .extern C1FIFOCI13INV    /* 0xBF88B6CC */
  .extern C1FIFOCON14      /* 0xBF88B6D0 */
  .extern C1FIFOCON14CLR   /* 0xBF88B6D4 */
  .extern C1FIFOCON14SET   /* 0xBF88B6D8 */
  .extern C1FIFOCON14INV   /* 0xBF88B6DC */
  .extern C1FIFOINT14      /* 0xBF88B6E0 */
  .extern C1FIFOINT14CLR   /* 0xBF88B6E4 */
  .extern C1FIFOINT14SET   /* 0xBF88B6E8 */
  .extern C1FIFOINT14INV   /* 0xBF88B6EC */
  .extern C1FIFOUA14       /* 0xBF88B6F0 */
  .extern C1FIFOUA14CLR    /* 0xBF88B6F4 */
  .extern C1FIFOUA14SET    /* 0xBF88B6F8 */
  .extern C1FIFOUA14INV    /* 0xBF88B6FC */
  .extern C1FIFOCI14       /* 0xBF88B700 */
  .extern C1FIFOCI14CLR    /* 0xBF88B704 */
  .extern C1FIFOCI14SET    /* 0xBF88B708 */
  .extern C1FIFOCI14INV    /* 0xBF88B70C */
  .extern C1FIFOCON15      /* 0xBF88B710 */
  .extern C1FIFOCON15CLR   /* 0xBF88B714 */
  .extern C1FIFOCON15SET   /* 0xBF88B718 */
  .extern C1FIFOCON15INV   /* 0xBF88B71C */
  .extern C1FIFOINT15      /* 0xBF88B720 */
  .extern C1FIFOINT15CLR   /* 0xBF88B724 */
  .extern C1FIFOINT15SET   /* 0xBF88B728 */
  .extern C1FIFOINT15INV   /* 0xBF88B72C */
  .extern C1FIFOUA15       /* 0xBF88B730 */
  .extern C1FIFOUA15CLR    /* 0xBF88B734 */
  .extern C1FIFOUA15SET    /* 0xBF88B738 */
  .extern C1FIFOUA15INV    /* 0xBF88B73C */
  .extern C1FIFOCI15       /* 0xBF88B740 */
  .extern C1FIFOCI15CLR    /* 0xBF88B744 */
  .extern C1FIFOCI15SET    /* 0xBF88B748 */
  .extern C1FIFOCI15INV    /* 0xBF88B74C */
  .extern C1FIFOCON16      /* 0xBF88B750 */
  .extern C1FIFOCON16CLR   /* 0xBF88B754 */
  .extern C1FIFOCON16SET   /* 0xBF88B758 */
  .extern C1FIFOCON16INV   /* 0xBF88B75C */
  .extern C1FIFOINT16      /* 0xBF88B760 */
  .extern C1FIFOINT16CLR   /* 0xBF88B764 */
  .extern C1FIFOINT16SET   /* 0xBF88B768 */
  .extern C1FIFOINT16INV   /* 0xBF88B76C */
  .extern C1FIFOUA16       /* 0xBF88B770 */
  .extern C1FIFOUA16CLR    /* 0xBF88B774 */
  .extern C1FIFOUA16SET    /* 0xBF88B778 */
  .extern C1FIFOUA16INV    /* 0xBF88B77C */
  .extern C1FIFOCI16       /* 0xBF88B780 */
  .extern C1FIFOCI16CLR    /* 0xBF88B784 */
  .extern C1FIFOCI16SET    /* 0xBF88B788 */
  .extern C1FIFOCI16INV    /* 0xBF88B78C */
  .extern C1FIFOCON17      /* 0xBF88B790 */
  .extern C1FIFOCON17CLR   /* 0xBF88B794 */
  .extern C1FIFOCON17SET   /* 0xBF88B798 */
  .extern C1FIFOCON17INV   /* 0xBF88B79C */
  .extern C1FIFOINT17      /* 0xBF88B7A0 */
  .extern C1FIFOINT17CLR   /* 0xBF88B7A4 */
  .extern C1FIFOINT17SET   /* 0xBF88B7A8 */
  .extern C1FIFOINT17INV   /* 0xBF88B7AC */
  .extern C1FIFOUA17       /* 0xBF88B7B0 */
  .extern C1FIFOUA17CLR    /* 0xBF88B7B4 */
  .extern C1FIFOUA17SET    /* 0xBF88B7B8 */
  .extern C1FIFOUA17INV    /* 0xBF88B7BC */
  .extern C1FIFOCI17       /* 0xBF88B7C0 */
  .extern C1FIFOCI17CLR    /* 0xBF88B7C4 */
  .extern C1FIFOCI17SET    /* 0xBF88B7C8 */
  .extern C1FIFOCI17INV    /* 0xBF88B7CC */
  .extern C1FIFOCON18      /* 0xBF88B7D0 */
  .extern C1FIFOCON18CLR   /* 0xBF88B7D4 */
  .extern C1FIFOCON18SET   /* 0xBF88B7D8 */
  .extern C1FIFOCON18INV   /* 0xBF88B7DC */
  .extern C1FIFOINT18      /* 0xBF88B7E0 */
  .extern C1FIFOINT18CLR   /* 0xBF88B7E4 */
  .extern C1FIFOINT18SET   /* 0xBF88B7E8 */
  .extern C1FIFOINT18INV   /* 0xBF88B7EC */
  .extern C1FIFOUA18       /* 0xBF88B7F0 */
  .extern C1FIFOUA18CLR    /* 0xBF88B7F4 */
  .extern C1FIFOUA18SET    /* 0xBF88B7F8 */
  .extern C1FIFOUA18INV    /* 0xBF88B7FC */
  .extern C1FIFOCI18       /* 0xBF88B800 */
  .extern C1FIFOCI18CLR    /* 0xBF88B804 */
  .extern C1FIFOCI18SET    /* 0xBF88B808 */
  .extern C1FIFOCI18INV    /* 0xBF88B80C */
  .extern C1FIFOCON19      /* 0xBF88B810 */
  .extern C1FIFOCON19CLR   /* 0xBF88B814 */
  .extern C1FIFOCON19SET   /* 0xBF88B818 */
  .extern C1FIFOCON19INV   /* 0xBF88B81C */
  .extern C1FIFOINT19      /* 0xBF88B820 */
  .extern C1FIFOINT19CLR   /* 0xBF88B824 */
  .extern C1FIFOINT19SET   /* 0xBF88B828 */
  .extern C1FIFOINT19INV   /* 0xBF88B82C */
  .extern C1FIFOUA19       /* 0xBF88B830 */
  .extern C1FIFOUA19CLR    /* 0xBF88B834 */
  .extern C1FIFOUA19SET    /* 0xBF88B838 */
  .extern C1FIFOUA19INV    /* 0xBF88B83C */
  .extern C1FIFOCI19       /* 0xBF88B840 */
  .extern C1FIFOCI19CLR    /* 0xBF88B844 */
  .extern C1FIFOCI19SET    /* 0xBF88B848 */
  .extern C1FIFOCI19INV    /* 0xBF88B84C */
  .extern C1FIFOCON20      /* 0xBF88B850 */
  .extern C1FIFOCON20CLR   /* 0xBF88B854 */
  .extern C1FIFOCON20SET   /* 0xBF88B858 */
  .extern C1FIFOCON20INV   /* 0xBF88B85C */
  .extern C1FIFOINT20      /* 0xBF88B860 */
  .extern C1FIFOINT20CLR   /* 0xBF88B864 */
  .extern C1FIFOINT20SET   /* 0xBF88B868 */
  .extern C1FIFOINT20INV   /* 0xBF88B86C */
  .extern C1FIFOUA20       /* 0xBF88B870 */
  .extern C1FIFOUA20CLR    /* 0xBF88B874 */
  .extern C1FIFOUA20SET    /* 0xBF88B878 */
  .extern C1FIFOUA20INV    /* 0xBF88B87C */
  .extern C1FIFOCI20       /* 0xBF88B880 */
  .extern C1FIFOCI20CLR    /* 0xBF88B884 */
  .extern C1FIFOCI20SET    /* 0xBF88B888 */
  .extern C1FIFOCI20INV    /* 0xBF88B88C */
  .extern C1FIFOCON21      /* 0xBF88B890 */
  .extern C1FIFOCON21CLR   /* 0xBF88B894 */
  .extern C1FIFOCON21SET   /* 0xBF88B898 */
  .extern C1FIFOCON21INV   /* 0xBF88B89C */
  .extern C1FIFOINT21      /* 0xBF88B8A0 */
  .extern C1FIFOINT21CLR   /* 0xBF88B8A4 */
  .extern C1FIFOINT21SET   /* 0xBF88B8A8 */
  .extern C1FIFOINT21INV   /* 0xBF88B8AC */
  .extern C1FIFOUA21       /* 0xBF88B8B0 */
  .extern C1FIFOUA21CLR    /* 0xBF88B8B4 */
  .extern C1FIFOUA21SET    /* 0xBF88B8B8 */
  .extern C1FIFOUA21INV    /* 0xBF88B8BC */
  .extern C1FIFOCI21       /* 0xBF88B8C0 */
  .extern C1FIFOCI21CLR    /* 0xBF88B8C4 */
  .extern C1FIFOCI21SET    /* 0xBF88B8C8 */
  .extern C1FIFOCI21INV    /* 0xBF88B8CC */
  .extern C1FIFOCON22      /* 0xBF88B8D0 */
  .extern C1FIFOCON22CLR   /* 0xBF88B8D4 */
  .extern C1FIFOCON22SET   /* 0xBF88B8D8 */
  .extern C1FIFOCON22INV   /* 0xBF88B8DC */
  .extern C1FIFOINT22      /* 0xBF88B8E0 */
  .extern C1FIFOINT22CLR   /* 0xBF88B8E4 */
  .extern C1FIFOINT22SET   /* 0xBF88B8E8 */
  .extern C1FIFOINT22INV   /* 0xBF88B8EC */
  .extern C1FIFOUA22       /* 0xBF88B8F0 */
  .extern C1FIFOUA22CLR    /* 0xBF88B8F4 */
  .extern C1FIFOUA22SET    /* 0xBF88B8F8 */
  .extern C1FIFOUA22INV    /* 0xBF88B8FC */
  .extern C1FIFOCI22       /* 0xBF88B900 */
  .extern C1FIFOCI22CLR    /* 0xBF88B904 */
  .extern C1FIFOCI22SET    /* 0xBF88B908 */
  .extern C1FIFOCI22INV    /* 0xBF88B90C */
  .extern C1FIFOCON23      /* 0xBF88B910 */
  .extern C1FIFOCON23CLR   /* 0xBF88B914 */
  .extern C1FIFOCON23SET   /* 0xBF88B918 */
  .extern C1FIFOCON23INV   /* 0xBF88B91C */
  .extern C1FIFOINT23      /* 0xBF88B920 */
  .extern C1FIFOINT23CLR   /* 0xBF88B924 */
  .extern C1FIFOINT23SET   /* 0xBF88B928 */
  .extern C1FIFOINT23INV   /* 0xBF88B92C */
  .extern C1FIFOUA23       /* 0xBF88B930 */
  .extern C1FIFOUA23CLR    /* 0xBF88B934 */
  .extern C1FIFOUA23SET    /* 0xBF88B938 */
  .extern C1FIFOUA23INV    /* 0xBF88B93C */
  .extern C1FIFOCI23       /* 0xBF88B940 */
  .extern C1FIFOCI23CLR    /* 0xBF88B944 */
  .extern C1FIFOCI23SET    /* 0xBF88B948 */
  .extern C1FIFOCI23INV    /* 0xBF88B94C */
  .extern C1FIFOCON24      /* 0xBF88B950 */
  .extern C1FIFOCON24CLR   /* 0xBF88B954 */
  .extern C1FIFOCON24SET   /* 0xBF88B958 */
  .extern C1FIFOCON24INV   /* 0xBF88B95C */
  .extern C1FIFOINT24      /* 0xBF88B960 */
  .extern C1FIFOINT24CLR   /* 0xBF88B964 */
  .extern C1FIFOINT24SET   /* 0xBF88B968 */
  .extern C1FIFOINT24INV   /* 0xBF88B96C */
  .extern C1FIFOUA24       /* 0xBF88B970 */
  .extern C1FIFOUA24CLR    /* 0xBF88B974 */
  .extern C1FIFOUA24SET    /* 0xBF88B978 */
  .extern C1FIFOUA24INV    /* 0xBF88B97C */
  .extern C1FIFOCI24       /* 0xBF88B980 */
  .extern C1FIFOCI24CLR    /* 0xBF88B984 */
  .extern C1FIFOCI24SET    /* 0xBF88B988 */
  .extern C1FIFOCI24INV    /* 0xBF88B98C */
  .extern C1FIFOCON25      /* 0xBF88B990 */
  .extern C1FIFOCON25CLR   /* 0xBF88B994 */
  .extern C1FIFOCON25SET   /* 0xBF88B998 */
  .extern C1FIFOCON25INV   /* 0xBF88B99C */
  .extern C1FIFOINT25      /* 0xBF88B9A0 */
  .extern C1FIFOINT25CLR   /* 0xBF88B9A4 */
  .extern C1FIFOINT25SET   /* 0xBF88B9A8 */
  .extern C1FIFOINT25INV   /* 0xBF88B9AC */
  .extern C1FIFOUA25       /* 0xBF88B9B0 */
  .extern C1FIFOUA25CLR    /* 0xBF88B9B4 */
  .extern C1FIFOUA25SET    /* 0xBF88B9B8 */
  .extern C1FIFOUA25INV    /* 0xBF88B9BC */
  .extern C1FIFOCI25       /* 0xBF88B9C0 */
  .extern C1FIFOCI25CLR    /* 0xBF88B9C4 */
  .extern C1FIFOCI25SET    /* 0xBF88B9C8 */
  .extern C1FIFOCI25INV    /* 0xBF88B9CC */
  .extern C1FIFOCON26      /* 0xBF88B9D0 */
  .extern C1FIFOCON26CLR   /* 0xBF88B9D4 */
  .extern C1FIFOCON26SET   /* 0xBF88B9D8 */
  .extern C1FIFOCON26INV   /* 0xBF88B9DC */
  .extern C1FIFOINT26      /* 0xBF88B9E0 */
  .extern C1FIFOINT26CLR   /* 0xBF88B9E4 */
  .extern C1FIFOINT26SET   /* 0xBF88B9E8 */
  .extern C1FIFOINT26INV   /* 0xBF88B9EC */
  .extern C1FIFOUA26       /* 0xBF88B9F0 */
  .extern C1FIFOUA26CLR    /* 0xBF88B9F4 */
  .extern C1FIFOUA26SET    /* 0xBF88B9F8 */
  .extern C1FIFOUA26INV    /* 0xBF88B9FC */
  .extern C1FIFOCI26       /* 0xBF88BA00 */
  .extern C1FIFOCI26CLR    /* 0xBF88BA04 */
  .extern C1FIFOCI26SET    /* 0xBF88BA08 */
  .extern C1FIFOCI26INV    /* 0xBF88BA0C */
  .extern C1FIFOCON27      /* 0xBF88BA10 */
  .extern C1FIFOCON27CLR   /* 0xBF88BA14 */
  .extern C1FIFOCON27SET   /* 0xBF88BA18 */
  .extern C1FIFOCON27INV   /* 0xBF88BA1C */
  .extern C1FIFOINT27      /* 0xBF88BA20 */
  .extern C1FIFOINT27CLR   /* 0xBF88BA24 */
  .extern C1FIFOINT27SET   /* 0xBF88BA28 */
  .extern C1FIFOINT27INV   /* 0xBF88BA2C */
  .extern C1FIFOUA27       /* 0xBF88BA30 */
  .extern C1FIFOUA27CLR    /* 0xBF88BA34 */
  .extern C1FIFOUA27SET    /* 0xBF88BA38 */
  .extern C1FIFOUA27INV    /* 0xBF88BA3C */
  .extern C1FIFOCI27       /* 0xBF88BA40 */
  .extern C1FIFOCI27CLR    /* 0xBF88BA44 */
  .extern C1FIFOCI27SET    /* 0xBF88BA48 */
  .extern C1FIFOCI27INV    /* 0xBF88BA4C */
  .extern C1FIFOCON28      /* 0xBF88BA50 */
  .extern C1FIFOCON28CLR   /* 0xBF88BA54 */
  .extern C1FIFOCON28SET   /* 0xBF88BA58 */
  .extern C1FIFOCON28INV   /* 0xBF88BA5C */
  .extern C1FIFOINT28      /* 0xBF88BA60 */
  .extern C1FIFOINT28CLR   /* 0xBF88BA64 */
  .extern C1FIFOINT28SET   /* 0xBF88BA68 */
  .extern C1FIFOINT28INV   /* 0xBF88BA6C */
  .extern C1FIFOUA28       /* 0xBF88BA70 */
  .extern C1FIFOUA28CLR    /* 0xBF88BA74 */
  .extern C1FIFOUA28SET    /* 0xBF88BA78 */
  .extern C1FIFOUA28INV    /* 0xBF88BA7C */
  .extern C1FIFOCI28       /* 0xBF88BA80 */
  .extern C1FIFOCI28CLR    /* 0xBF88BA84 */
  .extern C1FIFOCI28SET    /* 0xBF88BA88 */
  .extern C1FIFOCI28INV    /* 0xBF88BA8C */
  .extern C1FIFOCON29      /* 0xBF88BA90 */
  .extern C1FIFOCON29CLR   /* 0xBF88BA94 */
  .extern C1FIFOCON29SET   /* 0xBF88BA98 */
  .extern C1FIFOCON29INV   /* 0xBF88BA9C */
  .extern C1FIFOINT29      /* 0xBF88BAA0 */
  .extern C1FIFOINT29CLR   /* 0xBF88BAA4 */
  .extern C1FIFOINT29SET   /* 0xBF88BAA8 */
  .extern C1FIFOINT29INV   /* 0xBF88BAAC */
  .extern C1FIFOUA29       /* 0xBF88BAB0 */
  .extern C1FIFOUA29CLR    /* 0xBF88BAB4 */
  .extern C1FIFOUA29SET    /* 0xBF88BAB8 */
  .extern C1FIFOUA29INV    /* 0xBF88BABC */
  .extern C1FIFOCI29       /* 0xBF88BAC0 */
  .extern C1FIFOCI29CLR    /* 0xBF88BAC4 */
  .extern C1FIFOCI29SET    /* 0xBF88BAC8 */
  .extern C1FIFOCI29INV    /* 0xBF88BACC */
  .extern C1FIFOCON30      /* 0xBF88BAD0 */
  .extern C1FIFOCON30CLR   /* 0xBF88BAD4 */
  .extern C1FIFOCON30SET   /* 0xBF88BAD8 */
  .extern C1FIFOCON30INV   /* 0xBF88BADC */
  .extern C1FIFOINT30      /* 0xBF88BAE0 */
  .extern C1FIFOINT30CLR   /* 0xBF88BAE4 */
  .extern C1FIFOINT30SET   /* 0xBF88BAE8 */
  .extern C1FIFOINT30INV   /* 0xBF88BAEC */
  .extern C1FIFOUA30       /* 0xBF88BAF0 */
  .extern C1FIFOUA30CLR    /* 0xBF88BAF4 */
  .extern C1FIFOUA30SET    /* 0xBF88BAF8 */
  .extern C1FIFOUA30INV    /* 0xBF88BAFC */
  .extern C1FIFOCI30       /* 0xBF88BB00 */
  .extern C1FIFOCI30CLR    /* 0xBF88BB04 */
  .extern C1FIFOCI30SET    /* 0xBF88BB08 */
  .extern C1FIFOCI30INV    /* 0xBF88BB0C */
  .extern C1FIFOCON31      /* 0xBF88BB10 */
  .extern C1FIFOCON31CLR   /* 0xBF88BB14 */
  .extern C1FIFOCON31SET   /* 0xBF88BB18 */
  .extern C1FIFOCON31INV   /* 0xBF88BB1C */
  .extern C1FIFOINT31      /* 0xBF88BB20 */
  .extern C1FIFOINT31CLR   /* 0xBF88BB24 */
  .extern C1FIFOINT31SET   /* 0xBF88BB28 */
  .extern C1FIFOINT31INV   /* 0xBF88BB2C */
  .extern C1FIFOUA31       /* 0xBF88BB30 */
  .extern C1FIFOUA31CLR    /* 0xBF88BB34 */
  .extern C1FIFOUA31SET    /* 0xBF88BB38 */
  .extern C1FIFOUA31INV    /* 0xBF88BB3C */
  .extern C1FIFOCI31       /* 0xBF88BB40 */
  .extern C1FIFOCI31CLR    /* 0xBF88BB44 */
  .extern C1FIFOCI31SET    /* 0xBF88BB48 */
  .extern C1FIFOCI31INV    /* 0xBF88BB4C */
  .extern C2CON            /* 0xBF88C000 */
  .extern C2CONCLR         /* 0xBF88C004 */
  .extern C2CONSET         /* 0xBF88C008 */
  .extern C2CONINV         /* 0xBF88C00C */
  .extern C2CFG            /* 0xBF88C010 */
  .extern C2CFGCLR         /* 0xBF88C014 */
  .extern C2CFGSET         /* 0xBF88C018 */
  .extern C2CFGINV         /* 0xBF88C01C */
  .extern C2INT            /* 0xBF88C020 */
  .extern C2INTCLR         /* 0xBF88C024 */
  .extern C2INTSET         /* 0xBF88C028 */
  .extern C2INTINV         /* 0xBF88C02C */
  .extern C2VEC            /* 0xBF88C030 */
  .extern C2VECCLR         /* 0xBF88C034 */
  .extern C2VECSET         /* 0xBF88C038 */
  .extern C2VECINV         /* 0xBF88C03C */
  .extern C2TREC           /* 0xBF88C040 */
  .extern C2TRECCLR        /* 0xBF88C044 */
  .extern C2TRECSET        /* 0xBF88C048 */
  .extern C2TRECINV        /* 0xBF88C04C */
  .extern C2FSTAT          /* 0xBF88C050 */
  .extern C2FSTATCLR       /* 0xBF88C054 */
  .extern C2FSTATSET       /* 0xBF88C058 */
  .extern C2FSTATINV       /* 0xBF88C05C */
  .extern C2RXOVF          /* 0xBF88C060 */
  .extern C2RXOVFCLR       /* 0xBF88C064 */
  .extern C2RXOVFSET       /* 0xBF88C068 */
  .extern C2RXOVFINV       /* 0xBF88C06C */
  .extern C2TMR            /* 0xBF88C070 */
  .extern C2TMRCLR         /* 0xBF88C074 */
  .extern C2TMRSET         /* 0xBF88C078 */
  .extern C2TMRINV         /* 0xBF88C07C */
  .extern C2RXM0           /* 0xBF88C080 */
  .extern C2RXM0CLR        /* 0xBF88C084 */
  .extern C2RXM0SET        /* 0xBF88C088 */
  .extern C2RXM0INV        /* 0xBF88C08C */
  .extern C2RXM1           /* 0xBF88C090 */
  .extern C2RXM1CLR        /* 0xBF88C094 */
  .extern C2RXM1SET        /* 0xBF88C098 */
  .extern C2RXM1INV        /* 0xBF88C09C */
  .extern C2RXM2           /* 0xBF88C0A0 */
  .extern C2RXM2CLR        /* 0xBF88C0A4 */
  .extern C2RXM2SET        /* 0xBF88C0A8 */
  .extern C2RXM2INV        /* 0xBF88C0AC */
  .extern C2RXM3           /* 0xBF88C0B0 */
  .extern C2RXM3CLR        /* 0xBF88C0B4 */
  .extern C2RXM3SET        /* 0xBF88C0B8 */
  .extern C2RXM3INV        /* 0xBF88C0BC */
  .extern C2FLTCON0        /* 0xBF88C0C0 */
  .extern C2FLTCON0CLR     /* 0xBF88C0C4 */
  .extern C2FLTCON0SET     /* 0xBF88C0C8 */
  .extern C2FLTCON0INV     /* 0xBF88C0CC */
  .extern C2FLTCON1        /* 0xBF88C0D0 */
  .extern C2FLTCON1CLR     /* 0xBF88C0D4 */
  .extern C2FLTCON1SET     /* 0xBF88C0D8 */
  .extern C2FLTCON1INV     /* 0xBF88C0DC */
  .extern C2FLTCON2        /* 0xBF88C0E0 */
  .extern C2FLTCON2CLR     /* 0xBF88C0E4 */
  .extern C2FLTCON2SET     /* 0xBF88C0E8 */
  .extern C2FLTCON2INV     /* 0xBF88C0EC */
  .extern C2FLTCON3        /* 0xBF88C0F0 */
  .extern C2FLTCON3CLR     /* 0xBF88C0F4 */
  .extern C2FLTCON3SET     /* 0xBF88C0F8 */
  .extern C2FLTCON3INV     /* 0xBF88C0FC */
  .extern C2FLTCON4        /* 0xBF88C100 */
  .extern C2FLTCON4CLR     /* 0xBF88C104 */
  .extern C2FLTCON4SET     /* 0xBF88C108 */
  .extern C2FLTCON4INV     /* 0xBF88C10C */
  .extern C2FLTCON5        /* 0xBF88C110 */
  .extern C2FLTCON5CLR     /* 0xBF88C114 */
  .extern C2FLTCON5SET     /* 0xBF88C118 */
  .extern C2FLTCON5INV     /* 0xBF88C11C */
  .extern C2FLTCON6        /* 0xBF88C120 */
  .extern C2FLTCON6CLR     /* 0xBF88C124 */
  .extern C2FLTCON6SET     /* 0xBF88C128 */
  .extern C2FLTCON6INV     /* 0xBF88C12C */
  .extern C2FLTCON7        /* 0xBF88C130 */
  .extern C2FLTCON7CLR     /* 0xBF88C134 */
  .extern C2FLTCON7SET     /* 0xBF88C138 */
  .extern C2FLTCON7INV     /* 0xBF88C13C */
  .extern C2RXF0           /* 0xBF88C140 */
  .extern C2RXF0CLR        /* 0xBF88C144 */
  .extern C2RXF0SET        /* 0xBF88C148 */
  .extern C2RXF0INV        /* 0xBF88C14C */
  .extern C2RXF1           /* 0xBF88C150 */
  .extern C2RXF1CLR        /* 0xBF88C154 */
  .extern C2RXF1SET        /* 0xBF88C158 */
  .extern C2RXF1INV        /* 0xBF88C15C */
  .extern C2RXF2           /* 0xBF88C160 */
  .extern C2RXF2CLR        /* 0xBF88C164 */
  .extern C2RXF2SET        /* 0xBF88C168 */
  .extern C2RXF2INV        /* 0xBF88C16C */
  .extern C2RXF3           /* 0xBF88C170 */
  .extern C2RXF3CLR        /* 0xBF88C174 */
  .extern C2RXF3SET        /* 0xBF88C178 */
  .extern C2RXF3INV        /* 0xBF88C17C */
  .extern C2RXF4           /* 0xBF88C180 */
  .extern C2RXF4CLR        /* 0xBF88C184 */
  .extern C2RXF4SET        /* 0xBF88C188 */
  .extern C2RXF4INV        /* 0xBF88C18C */
  .extern C2RXF5           /* 0xBF88C190 */
  .extern C2RXF5CLR        /* 0xBF88C194 */
  .extern C2RXF5SET        /* 0xBF88C198 */
  .extern C2RXF5INV        /* 0xBF88C19C */
  .extern C2RXF6           /* 0xBF88C1A0 */
  .extern C2RXF6CLR        /* 0xBF88C1A4 */
  .extern C2RXF6SET        /* 0xBF88C1A8 */
  .extern C2RXF6INV        /* 0xBF88C1AC */
  .extern C2RXF7           /* 0xBF88C1B0 */
  .extern C2RXF7CLR        /* 0xBF88C1B4 */
  .extern C2RXF7SET        /* 0xBF88C1B8 */
  .extern C2RXF7INV        /* 0xBF88C1BC */
  .extern C2RXF8           /* 0xBF88C1C0 */
  .extern C2RXF8CLR        /* 0xBF88C1C4 */
  .extern C2RXF8SET        /* 0xBF88C1C8 */
  .extern C2RXF8INV        /* 0xBF88C1CC */
  .extern C2RXF9           /* 0xBF88C1D0 */
  .extern C2RXF9CLR        /* 0xBF88C1D4 */
  .extern C2RXF9SET        /* 0xBF88C1D8 */
  .extern C2RXF9INV        /* 0xBF88C1DC */
  .extern C2RXF10          /* 0xBF88C1E0 */
  .extern C2RXF10CLR       /* 0xBF88C1E4 */
  .extern C2RXF10SET       /* 0xBF88C1E8 */
  .extern C2RXF10INV       /* 0xBF88C1EC */
  .extern C2RXF11          /* 0xBF88C1F0 */
  .extern C2RXF11CLR       /* 0xBF88C1F4 */
  .extern C2RXF11SET       /* 0xBF88C1F8 */
  .extern C2RXF11INV       /* 0xBF88C1FC */
  .extern C2RXF12          /* 0xBF88C200 */
  .extern C2RXF12CLR       /* 0xBF88C204 */
  .extern C2RXF12SET       /* 0xBF88C208 */
  .extern C2RXF12INV       /* 0xBF88C20C */
  .extern C2RXF13          /* 0xBF88C210 */
  .extern C2RXF13CLR       /* 0xBF88C214 */
  .extern C2RXF13SET       /* 0xBF88C218 */
  .extern C2RXF13INV       /* 0xBF88C21C */
  .extern C2RXF14          /* 0xBF88C220 */
  .extern C2RXF14CLR       /* 0xBF88C224 */
  .extern C2RXF14SET       /* 0xBF88C228 */
  .extern C2RXF14INV       /* 0xBF88C22C */
  .extern C2RXF15          /* 0xBF88C230 */
  .extern C2RXF15CLR       /* 0xBF88C234 */
  .extern C2RXF15SET       /* 0xBF88C238 */
  .extern C2RXF15INV       /* 0xBF88C23C */
  .extern C2RXF16          /* 0xBF88C240 */
  .extern C2RXF16CLR       /* 0xBF88C244 */
  .extern C2RXF16SET       /* 0xBF88C248 */
  .extern C2RXF16INV       /* 0xBF88C24C */
  .extern C2RXF17          /* 0xBF88C250 */
  .extern C2RXF17CLR       /* 0xBF88C254 */
  .extern C2RXF17SET       /* 0xBF88C258 */
  .extern C2RXF17INV       /* 0xBF88C25C */
  .extern C2RXF18          /* 0xBF88C260 */
  .extern C2RXF18CLR       /* 0xBF88C264 */
  .extern C2RXF18SET       /* 0xBF88C268 */
  .extern C2RXF18INV       /* 0xBF88C26C */
  .extern C2RXF19          /* 0xBF88C270 */
  .extern C2RXF19CLR       /* 0xBF88C274 */
  .extern C2RXF19SET       /* 0xBF88C278 */
  .extern C2RXF19INV       /* 0xBF88C27C */
  .extern C2RXF20          /* 0xBF88C280 */
  .extern C2RXF20CLR       /* 0xBF88C284 */
  .extern C2RXF20SET       /* 0xBF88C288 */
  .extern C2RXF20INV       /* 0xBF88C28C */
  .extern C2RXF21          /* 0xBF88C290 */
  .extern C2RXF21CLR       /* 0xBF88C294 */
  .extern C2RXF21SET       /* 0xBF88C298 */
  .extern C2RXF21INV       /* 0xBF88C29C */
  .extern C2RXF22          /* 0xBF88C2A0 */
  .extern C2RXF22CLR       /* 0xBF88C2A4 */
  .extern C2RXF22SET       /* 0xBF88C2A8 */
  .extern C2RXF22INV       /* 0xBF88C2AC */
  .extern C2RXF23          /* 0xBF88C2B0 */
  .extern C2RXF23CLR       /* 0xBF88C2B4 */
  .extern C2RXF23SET       /* 0xBF88C2B8 */
  .extern C2RXF23INV       /* 0xBF88C2BC */
  .extern C2RXF24          /* 0xBF88C2C0 */
  .extern C2RXF24CLR       /* 0xBF88C2C4 */
  .extern C2RXF24SET       /* 0xBF88C2C8 */
  .extern C2RXF24INV       /* 0xBF88C2CC */
  .extern C2RXF25          /* 0xBF88C2D0 */
  .extern C2RXF25CLR       /* 0xBF88C2D4 */
  .extern C2RXF25SET       /* 0xBF88C2D8 */
  .extern C2RXF25INV       /* 0xBF88C2DC */
  .extern C2RXF26          /* 0xBF88C2E0 */
  .extern C2RXF26CLR       /* 0xBF88C2E4 */
  .extern C2RXF26SET       /* 0xBF88C2E8 */
  .extern C2RXF26INV       /* 0xBF88C2EC */
  .extern C2RXF27          /* 0xBF88C2F0 */
  .extern C2RXF27CLR       /* 0xBF88C2F4 */
  .extern C2RXF27SET       /* 0xBF88C2F8 */
  .extern C2RXF27INV       /* 0xBF88C2FC */
  .extern C2RXF28          /* 0xBF88C300 */
  .extern C2RXF28CLR       /* 0xBF88C304 */
  .extern C2RXF28SET       /* 0xBF88C308 */
  .extern C2RXF28INV       /* 0xBF88C30C */
  .extern C2RXF29          /* 0xBF88C310 */
  .extern C2RXF29CLR       /* 0xBF88C314 */
  .extern C2RXF29SET       /* 0xBF88C318 */
  .extern C2RXF29INV       /* 0xBF88C31C */
  .extern C2RXF30          /* 0xBF88C320 */
  .extern C2RXF30CLR       /* 0xBF88C324 */
  .extern C2RXF30SET       /* 0xBF88C328 */
  .extern C2RXF30INV       /* 0xBF88C32C */
  .extern C2RXF31          /* 0xBF88C330 */
  .extern C2RXF31CLR       /* 0xBF88C334 */
  .extern C2RXF31SET       /* 0xBF88C338 */
  .extern C2RXF31INV       /* 0xBF88C33C */
  .extern C2FIFOBA         /* 0xBF88C340 */
  .extern C2FIFOBACLR      /* 0xBF88C344 */
  .extern C2FIFOBASET      /* 0xBF88C348 */
  .extern C2FIFOBAINV      /* 0xBF88C34C */
  .extern C2FIFOCON0       /* 0xBF88C350 */
  .extern C2FIFOCON0CLR    /* 0xBF88C354 */
  .extern C2FIFOCON0SET    /* 0xBF88C358 */
  .extern C2FIFOCON0INV    /* 0xBF88C35C */
  .extern C2FIFOINT0       /* 0xBF88C360 */
  .extern C2FIFOINT0CLR    /* 0xBF88C364 */
  .extern C2FIFOINT0SET    /* 0xBF88C368 */
  .extern C2FIFOINT0INV    /* 0xBF88C36C */
  .extern C2FIFOUA0        /* 0xBF88C370 */
  .extern C2FIFOUA0CLR     /* 0xBF88C374 */
  .extern C2FIFOUA0SET     /* 0xBF88C378 */
  .extern C2FIFOUA0INV     /* 0xBF88C37C */
  .extern C2FIFOCI0        /* 0xBF88C380 */
  .extern C2FIFOCI0CLR     /* 0xBF88C384 */
  .extern C2FIFOCI0SET     /* 0xBF88C388 */
  .extern C2FIFOCI0INV     /* 0xBF88C38C */
  .extern C2FIFOCON1       /* 0xBF88C390 */
  .extern C2FIFOCON1CLR    /* 0xBF88C394 */
  .extern C2FIFOCON1SET    /* 0xBF88C398 */
  .extern C2FIFOCON1INV    /* 0xBF88C39C */
  .extern C2FIFOINT1       /* 0xBF88C3A0 */
  .extern C2FIFOINT1CLR    /* 0xBF88C3A4 */
  .extern C2FIFOINT1SET    /* 0xBF88C3A8 */
  .extern C2FIFOINT1INV    /* 0xBF88C3AC */
  .extern C2FIFOUA1        /* 0xBF88C3B0 */
  .extern C2FIFOUA1CLR     /* 0xBF88C3B4 */
  .extern C2FIFOUA1SET     /* 0xBF88C3B8 */
  .extern C2FIFOUA1INV     /* 0xBF88C3BC */
  .extern C2FIFOCI1        /* 0xBF88C3C0 */
  .extern C2FIFOCI1CLR     /* 0xBF88C3C4 */
  .extern C2FIFOCI1SET     /* 0xBF88C3C8 */
  .extern C2FIFOCI1INV     /* 0xBF88C3CC */
  .extern C2FIFOCON2       /* 0xBF88C3D0 */
