HomuraVehicle/homuraLib_v2/machine/device/p32mx795f512h_forVC.c
  .extern C2FIFOCON2CLR    /* 0xBF88C3D4 */
  .extern C2FIFOCON2SET    /* 0xBF88C3D8 */
  .extern C2FIFOCON2INV    /* 0xBF88C3DC */
  .extern C2FIFOINT2       /* 0xBF88C3E0 */
  .extern C2FIFOINT2CLR    /* 0xBF88C3E4 */
  .extern C2FIFOINT2SET    /* 0xBF88C3E8 */
  .extern C2FIFOINT2INV    /* 0xBF88C3EC */
  .extern C2FIFOUA2        /* 0xBF88C3F0 */
  .extern C2FIFOUA2CLR     /* 0xBF88C3F4 */
  .extern C2FIFOUA2SET     /* 0xBF88C3F8 */
  .extern C2FIFOUA2INV     /* 0xBF88C3FC */
  .extern C2FIFOCI2        /* 0xBF88C400 */
  .extern C2FIFOCI2CLR     /* 0xBF88C404 */
  .extern C2FIFOCI2SET     /* 0xBF88C408 */
  .extern C2FIFOCI2INV     /* 0xBF88C40C */
  .extern C2FIFOCON3       /* 0xBF88C410 */
  .extern C2FIFOCON3CLR    /* 0xBF88C414 */
  .extern C2FIFOCON3SET    /* 0xBF88C418 */
  .extern C2FIFOCON3INV    /* 0xBF88C41C */
  .extern C2FIFOINT3       /* 0xBF88C420 */
  .extern C2FIFOINT3CLR    /* 0xBF88C424 */
  .extern C2FIFOINT3SET    /* 0xBF88C428 */
  .extern C2FIFOINT3INV    /* 0xBF88C42C */
  .extern C2FIFOUA3        /* 0xBF88C430 */
  .extern C2FIFOUA3CLR     /* 0xBF88C434 */
  .extern C2FIFOUA3SET     /* 0xBF88C438 */
  .extern C2FIFOUA3INV     /* 0xBF88C43C */
  .extern C2FIFOCI3        /* 0xBF88C440 */
  .extern C2FIFOCI3CLR     /* 0xBF88C444 */
  .extern C2FIFOCI3SET     /* 0xBF88C448 */
  .extern C2FIFOCI3INV     /* 0xBF88C44C */
  .extern C2FIFOCON4       /* 0xBF88C450 */
  .extern C2FIFOCON4CLR    /* 0xBF88C454 */
  .extern C2FIFOCON4SET    /* 0xBF88C458 */
  .extern C2FIFOCON4INV    /* 0xBF88C45C */
  .extern C2FIFOINT4       /* 0xBF88C460 */
  .extern C2FIFOINT4CLR    /* 0xBF88C464 */
  .extern C2FIFOINT4SET    /* 0xBF88C468 */
  .extern C2FIFOINT4INV    /* 0xBF88C46C */
  .extern C2FIFOUA4        /* 0xBF88C470 */
  .extern C2FIFOUA4CLR     /* 0xBF88C474 */
  .extern C2FIFOUA4SET     /* 0xBF88C478 */
  .extern C2FIFOUA4INV     /* 0xBF88C47C */
  .extern C2FIFOCI4        /* 0xBF88C480 */
  .extern C2FIFOCI4CLR     /* 0xBF88C484 */
  .extern C2FIFOCI4SET     /* 0xBF88C488 */
  .extern C2FIFOCI4INV     /* 0xBF88C48C */
  .extern C2FIFOCON5       /* 0xBF88C490 */
  .extern C2FIFOCON5CLR    /* 0xBF88C494 */
  .extern C2FIFOCON5SET    /* 0xBF88C498 */
  .extern C2FIFOCON5INV    /* 0xBF88C49C */
  .extern C2FIFOINT5       /* 0xBF88C4A0 */
  .extern C2FIFOINT5CLR    /* 0xBF88C4A4 */
  .extern C2FIFOINT5SET    /* 0xBF88C4A8 */
  .extern C2FIFOINT5INV    /* 0xBF88C4AC */
  .extern C2FIFOUA5        /* 0xBF88C4B0 */
  .extern C2FIFOUA5CLR     /* 0xBF88C4B4 */
  .extern C2FIFOUA5SET     /* 0xBF88C4B8 */
  .extern C2FIFOUA5INV     /* 0xBF88C4BC */
  .extern C2FIFOCI5        /* 0xBF88C4C0 */
  .extern C2FIFOCI5CLR     /* 0xBF88C4C4 */
  .extern C2FIFOCI5SET     /* 0xBF88C4C8 */
  .extern C2FIFOCI5INV     /* 0xBF88C4CC */
  .extern C2FIFOCON6       /* 0xBF88C4D0 */
  .extern C2FIFOCON6CLR    /* 0xBF88C4D4 */
  .extern C2FIFOCON6SET    /* 0xBF88C4D8 */
  .extern C2FIFOCON6INV    /* 0xBF88C4DC */
  .extern C2FIFOINT6       /* 0xBF88C4E0 */
  .extern C2FIFOINT6CLR    /* 0xBF88C4E4 */
  .extern C2FIFOINT6SET    /* 0xBF88C4E8 */
  .extern C2FIFOINT6INV    /* 0xBF88C4EC */
  .extern C2FIFOUA6        /* 0xBF88C4F0 */
  .extern C2FIFOUA6CLR     /* 0xBF88C4F4 */
  .extern C2FIFOUA6SET     /* 0xBF88C4F8 */
  .extern C2FIFOUA6INV     /* 0xBF88C4FC */
  .extern C2FIFOCI6        /* 0xBF88C500 */
  .extern C2FIFOCI6CLR     /* 0xBF88C504 */
  .extern C2FIFOCI6SET     /* 0xBF88C508 */
  .extern C2FIFOCI6INV     /* 0xBF88C50C */
  .extern C2FIFOCON7       /* 0xBF88C510 */
  .extern C2FIFOCON7CLR    /* 0xBF88C514 */
  .extern C2FIFOCON7SET    /* 0xBF88C518 */
  .extern C2FIFOCON7INV    /* 0xBF88C51C */
  .extern C2FIFOINT7       /* 0xBF88C520 */
  .extern C2FIFOINT7CLR    /* 0xBF88C524 */
  .extern C2FIFOINT7SET    /* 0xBF88C528 */
  .extern C2FIFOINT7INV    /* 0xBF88C52C */
  .extern C2FIFOUA7        /* 0xBF88C530 */
  .extern C2FIFOUA7CLR     /* 0xBF88C534 */
  .extern C2FIFOUA7SET     /* 0xBF88C538 */
  .extern C2FIFOUA7INV     /* 0xBF88C53C */
  .extern C2FIFOCI7        /* 0xBF88C540 */
  .extern C2FIFOCI7CLR     /* 0xBF88C544 */
  .extern C2FIFOCI7SET     /* 0xBF88C548 */
  .extern C2FIFOCI7INV     /* 0xBF88C54C */
  .extern C2FIFOCON8       /* 0xBF88C550 */
  .extern C2FIFOCON8CLR    /* 0xBF88C554 */
  .extern C2FIFOCON8SET    /* 0xBF88C558 */
  .extern C2FIFOCON8INV    /* 0xBF88C55C */
  .extern C2FIFOINT8       /* 0xBF88C560 */
  .extern C2FIFOINT8CLR    /* 0xBF88C564 */
  .extern C2FIFOINT8SET    /* 0xBF88C568 */
  .extern C2FIFOINT8INV    /* 0xBF88C56C */
  .extern C2FIFOUA8        /* 0xBF88C570 */
  .extern C2FIFOUA8CLR     /* 0xBF88C574 */
  .extern C2FIFOUA8SET     /* 0xBF88C578 */
  .extern C2FIFOUA8INV     /* 0xBF88C57C */
  .extern C2FIFOCI8        /* 0xBF88C580 */
  .extern C2FIFOCI8CLR     /* 0xBF88C584 */
  .extern C2FIFOCI8SET     /* 0xBF88C588 */
  .extern C2FIFOCI8INV     /* 0xBF88C58C */
  .extern C2FIFOCON9       /* 0xBF88C590 */
  .extern C2FIFOCON9CLR    /* 0xBF88C594 */
  .extern C2FIFOCON9SET    /* 0xBF88C598 */
  .extern C2FIFOCON9INV    /* 0xBF88C59C */
  .extern C2FIFOINT9       /* 0xBF88C5A0 */
  .extern C2FIFOINT9CLR    /* 0xBF88C5A4 */
  .extern C2FIFOINT9SET    /* 0xBF88C5A8 */
  .extern C2FIFOINT9INV    /* 0xBF88C5AC */
  .extern C2FIFOUA9        /* 0xBF88C5B0 */
  .extern C2FIFOUA9CLR     /* 0xBF88C5B4 */
  .extern C2FIFOUA9SET     /* 0xBF88C5B8 */
  .extern C2FIFOUA9INV     /* 0xBF88C5BC */
  .extern C2FIFOCI9        /* 0xBF88C5C0 */
  .extern C2FIFOCI9CLR     /* 0xBF88C5C4 */
  .extern C2FIFOCI9SET     /* 0xBF88C5C8 */
  .extern C2FIFOCI9INV     /* 0xBF88C5CC */
  .extern C2FIFOCON10      /* 0xBF88C5D0 */
  .extern C2FIFOCON10CLR   /* 0xBF88C5D4 */
  .extern C2FIFOCON10SET   /* 0xBF88C5D8 */
  .extern C2FIFOCON10INV   /* 0xBF88C5DC */
  .extern C2FIFOINT10      /* 0xBF88C5E0 */
  .extern C2FIFOINT10CLR   /* 0xBF88C5E4 */
  .extern C2FIFOINT10SET   /* 0xBF88C5E8 */
  .extern C2FIFOINT10INV   /* 0xBF88C5EC */
  .extern C2FIFOUA10       /* 0xBF88C5F0 */
  .extern C2FIFOUA10CLR    /* 0xBF88C5F4 */
  .extern C2FIFOUA10SET    /* 0xBF88C5F8 */
  .extern C2FIFOUA10INV    /* 0xBF88C5FC */
  .extern C2FIFOCI10       /* 0xBF88C600 */
  .extern C2FIFOCI10CLR    /* 0xBF88C604 */
  .extern C2FIFOCI10SET    /* 0xBF88C608 */
  .extern C2FIFOCI10INV    /* 0xBF88C60C */
  .extern C2FIFOCON11      /* 0xBF88C610 */
  .extern C2FIFOCON11CLR   /* 0xBF88C614 */
  .extern C2FIFOCON11SET   /* 0xBF88C618 */
  .extern C2FIFOCON11INV   /* 0xBF88C61C */
  .extern C2FIFOINT11      /* 0xBF88C620 */
  .extern C2FIFOINT11CLR   /* 0xBF88C624 */
  .extern C2FIFOINT11SET   /* 0xBF88C628 */
  .extern C2FIFOINT11INV   /* 0xBF88C62C */
  .extern C2FIFOUA11       /* 0xBF88C630 */
  .extern C2FIFOUA11CLR    /* 0xBF88C634 */
  .extern C2FIFOUA11SET    /* 0xBF88C638 */
  .extern C2FIFOUA11INV    /* 0xBF88C63C */
  .extern C2FIFOCI11       /* 0xBF88C640 */
  .extern C2FIFOCI11CLR    /* 0xBF88C644 */
  .extern C2FIFOCI11SET    /* 0xBF88C648 */
  .extern C2FIFOCI11INV    /* 0xBF88C64C */
  .extern C2FIFOCON12      /* 0xBF88C650 */
  .extern C2FIFOCON12CLR   /* 0xBF88C654 */
  .extern C2FIFOCON12SET   /* 0xBF88C658 */
  .extern C2FIFOCON12INV   /* 0xBF88C65C */
  .extern C2FIFOINT12      /* 0xBF88C660 */
  .extern C2FIFOINT12CLR   /* 0xBF88C664 */
  .extern C2FIFOINT12SET   /* 0xBF88C668 */
  .extern C2FIFOINT12INV   /* 0xBF88C66C */
  .extern C2FIFOUA12       /* 0xBF88C670 */
  .extern C2FIFOUA12CLR    /* 0xBF88C674 */
  .extern C2FIFOUA12SET    /* 0xBF88C678 */
  .extern C2FIFOUA12INV    /* 0xBF88C67C */
  .extern C2FIFOCI12       /* 0xBF88C680 */
  .extern C2FIFOCI12CLR    /* 0xBF88C684 */
  .extern C2FIFOCI12SET    /* 0xBF88C688 */
  .extern C2FIFOCI12INV    /* 0xBF88C68C */
  .extern C2FIFOCON13      /* 0xBF88C690 */
  .extern C2FIFOCON13CLR   /* 0xBF88C694 */
  .extern C2FIFOCON13SET   /* 0xBF88C698 */
  .extern C2FIFOCON13INV   /* 0xBF88C69C */
  .extern C2FIFOINT13      /* 0xBF88C6A0 */
  .extern C2FIFOINT13CLR   /* 0xBF88C6A4 */
  .extern C2FIFOINT13SET   /* 0xBF88C6A8 */
  .extern C2FIFOINT13INV   /* 0xBF88C6AC */
  .extern C2FIFOUA13       /* 0xBF88C6B0 */
  .extern C2FIFOUA13CLR    /* 0xBF88C6B4 */
  .extern C2FIFOUA13SET    /* 0xBF88C6B8 */
  .extern C2FIFOUA13INV    /* 0xBF88C6BC */
  .extern C2FIFOCI13       /* 0xBF88C6C0 */
  .extern C2FIFOCI13CLR    /* 0xBF88C6C4 */
  .extern C2FIFOCI13SET    /* 0xBF88C6C8 */
  .extern C2FIFOCI13INV    /* 0xBF88C6CC */
  .extern C2FIFOCON14      /* 0xBF88C6D0 */
  .extern C2FIFOCON14CLR   /* 0xBF88C6D4 */
  .extern C2FIFOCON14SET   /* 0xBF88C6D8 */
  .extern C2FIFOCON14INV   /* 0xBF88C6DC */
  .extern C2FIFOINT14      /* 0xBF88C6E0 */
  .extern C2FIFOINT14CLR   /* 0xBF88C6E4 */
  .extern C2FIFOINT14SET   /* 0xBF88C6E8 */
  .extern C2FIFOINT14INV   /* 0xBF88C6EC */
  .extern C2FIFOUA14       /* 0xBF88C6F0 */
  .extern C2FIFOUA14CLR    /* 0xBF88C6F4 */
  .extern C2FIFOUA14SET    /* 0xBF88C6F8 */
  .extern C2FIFOUA14INV    /* 0xBF88C6FC */
  .extern C2FIFOCI14       /* 0xBF88C700 */
  .extern C2FIFOCI14CLR    /* 0xBF88C704 */
  .extern C2FIFOCI14SET    /* 0xBF88C708 */
  .extern C2FIFOCI14INV    /* 0xBF88C70C */
  .extern C2FIFOCON15      /* 0xBF88C710 */
  .extern C2FIFOCON15CLR   /* 0xBF88C714 */
  .extern C2FIFOCON15SET   /* 0xBF88C718 */
  .extern C2FIFOCON15INV   /* 0xBF88C71C */
  .extern C2FIFOINT15      /* 0xBF88C720 */
  .extern C2FIFOINT15CLR   /* 0xBF88C724 */
  .extern C2FIFOINT15SET   /* 0xBF88C728 */
  .extern C2FIFOINT15INV   /* 0xBF88C72C */
  .extern C2FIFOUA15       /* 0xBF88C730 */
  .extern C2FIFOUA15CLR    /* 0xBF88C734 */
  .extern C2FIFOUA15SET    /* 0xBF88C738 */
  .extern C2FIFOUA15INV    /* 0xBF88C73C */
  .extern C2FIFOCI15       /* 0xBF88C740 */
  .extern C2FIFOCI15CLR    /* 0xBF88C744 */
  .extern C2FIFOCI15SET    /* 0xBF88C748 */
  .extern C2FIFOCI15INV    /* 0xBF88C74C */
  .extern C2FIFOCON16      /* 0xBF88C750 */
  .extern C2FIFOCON16CLR   /* 0xBF88C754 */
  .extern C2FIFOCON16SET   /* 0xBF88C758 */
  .extern C2FIFOCON16INV   /* 0xBF88C75C */
  .extern C2FIFOINT16      /* 0xBF88C760 */
  .extern C2FIFOINT16CLR   /* 0xBF88C764 */
  .extern C2FIFOINT16SET   /* 0xBF88C768 */
  .extern C2FIFOINT16INV   /* 0xBF88C76C */
  .extern C2FIFOUA16       /* 0xBF88C770 */
  .extern C2FIFOUA16CLR    /* 0xBF88C774 */
  .extern C2FIFOUA16SET    /* 0xBF88C778 */
  .extern C2FIFOUA16INV    /* 0xBF88C77C */
  .extern C2FIFOCI16       /* 0xBF88C780 */
  .extern C2FIFOCI16CLR    /* 0xBF88C784 */
  .extern C2FIFOCI16SET    /* 0xBF88C788 */
  .extern C2FIFOCI16INV    /* 0xBF88C78C */
  .extern C2FIFOCON17      /* 0xBF88C790 */
  .extern C2FIFOCON17CLR   /* 0xBF88C794 */
  .extern C2FIFOCON17SET   /* 0xBF88C798 */
  .extern C2FIFOCON17INV   /* 0xBF88C79C */
  .extern C2FIFOINT17      /* 0xBF88C7A0 */
  .extern C2FIFOINT17CLR   /* 0xBF88C7A4 */
  .extern C2FIFOINT17SET   /* 0xBF88C7A8 */
  .extern C2FIFOINT17INV   /* 0xBF88C7AC */
  .extern C2FIFOUA17       /* 0xBF88C7B0 */
  .extern C2FIFOUA17CLR    /* 0xBF88C7B4 */
  .extern C2FIFOUA17SET    /* 0xBF88C7B8 */
  .extern C2FIFOUA17INV    /* 0xBF88C7BC */
  .extern C2FIFOCI17       /* 0xBF88C7C0 */
  .extern C2FIFOCI17CLR    /* 0xBF88C7C4 */
  .extern C2FIFOCI17SET    /* 0xBF88C7C8 */
  .extern C2FIFOCI17INV    /* 0xBF88C7CC */
  .extern C2FIFOCON18      /* 0xBF88C7D0 */
  .extern C2FIFOCON18CLR   /* 0xBF88C7D4 */
  .extern C2FIFOCON18SET   /* 0xBF88C7D8 */
  .extern C2FIFOCON18INV   /* 0xBF88C7DC */
  .extern C2FIFOINT18      /* 0xBF88C7E0 */
  .extern C2FIFOINT18CLR   /* 0xBF88C7E4 */
  .extern C2FIFOINT18SET   /* 0xBF88C7E8 */
  .extern C2FIFOINT18INV   /* 0xBF88C7EC */
  .extern C2FIFOUA18       /* 0xBF88C7F0 */
  .extern C2FIFOUA18CLR    /* 0xBF88C7F4 */
  .extern C2FIFOUA18SET    /* 0xBF88C7F8 */
  .extern C2FIFOUA18INV    /* 0xBF88C7FC */
  .extern C2FIFOCI18       /* 0xBF88C800 */
  .extern C2FIFOCI18CLR    /* 0xBF88C804 */
  .extern C2FIFOCI18SET    /* 0xBF88C808 */
  .extern C2FIFOCI18INV    /* 0xBF88C80C */
  .extern C2FIFOCON19      /* 0xBF88C810 */
  .extern C2FIFOCON19CLR   /* 0xBF88C814 */
  .extern C2FIFOCON19SET   /* 0xBF88C818 */
  .extern C2FIFOCON19INV   /* 0xBF88C81C */
  .extern C2FIFOINT19      /* 0xBF88C820 */
  .extern C2FIFOINT19CLR   /* 0xBF88C824 */
  .extern C2FIFOINT19SET   /* 0xBF88C828 */
  .extern C2FIFOINT19INV   /* 0xBF88C82C */
  .extern C2FIFOUA19       /* 0xBF88C830 */
  .extern C2FIFOUA19CLR    /* 0xBF88C834 */
  .extern C2FIFOUA19SET    /* 0xBF88C838 */
  .extern C2FIFOUA19INV    /* 0xBF88C83C */
  .extern C2FIFOCI19       /* 0xBF88C840 */
  .extern C2FIFOCI19CLR    /* 0xBF88C844 */
  .extern C2FIFOCI19SET    /* 0xBF88C848 */
  .extern C2FIFOCI19INV    /* 0xBF88C84C */
  .extern C2FIFOCON20      /* 0xBF88C850 */
  .extern C2FIFOCON20CLR   /* 0xBF88C854 */
  .extern C2FIFOCON20SET   /* 0xBF88C858 */
  .extern C2FIFOCON20INV   /* 0xBF88C85C */
  .extern C2FIFOINT20      /* 0xBF88C860 */
  .extern C2FIFOINT20CLR   /* 0xBF88C864 */
  .extern C2FIFOINT20SET   /* 0xBF88C868 */
  .extern C2FIFOINT20INV   /* 0xBF88C86C */
  .extern C2FIFOUA20       /* 0xBF88C870 */
  .extern C2FIFOUA20CLR    /* 0xBF88C874 */
  .extern C2FIFOUA20SET    /* 0xBF88C878 */
  .extern C2FIFOUA20INV    /* 0xBF88C87C */
  .extern C2FIFOCI20       /* 0xBF88C880 */
  .extern C2FIFOCI20CLR    /* 0xBF88C884 */
  .extern C2FIFOCI20SET    /* 0xBF88C888 */
  .extern C2FIFOCI20INV    /* 0xBF88C88C */
  .extern C2FIFOCON21      /* 0xBF88C890 */
  .extern C2FIFOCON21CLR   /* 0xBF88C894 */
  .extern C2FIFOCON21SET   /* 0xBF88C898 */
  .extern C2FIFOCON21INV   /* 0xBF88C89C */
  .extern C2FIFOINT21      /* 0xBF88C8A0 */
  .extern C2FIFOINT21CLR   /* 0xBF88C8A4 */
  .extern C2FIFOINT21SET   /* 0xBF88C8A8 */
  .extern C2FIFOINT21INV   /* 0xBF88C8AC */
  .extern C2FIFOUA21       /* 0xBF88C8B0 */
  .extern C2FIFOUA21CLR    /* 0xBF88C8B4 */
  .extern C2FIFOUA21SET    /* 0xBF88C8B8 */
  .extern C2FIFOUA21INV    /* 0xBF88C8BC */
  .extern C2FIFOCI21       /* 0xBF88C8C0 */
  .extern C2FIFOCI21CLR    /* 0xBF88C8C4 */
  .extern C2FIFOCI21SET    /* 0xBF88C8C8 */
  .extern C2FIFOCI21INV    /* 0xBF88C8CC */
  .extern C2FIFOCON22      /* 0xBF88C8D0 */
  .extern C2FIFOCON22CLR   /* 0xBF88C8D4 */
  .extern C2FIFOCON22SET   /* 0xBF88C8D8 */
  .extern C2FIFOCON22INV   /* 0xBF88C8DC */
  .extern C2FIFOINT22      /* 0xBF88C8E0 */
  .extern C2FIFOINT22CLR   /* 0xBF88C8E4 */
  .extern C2FIFOINT22SET   /* 0xBF88C8E8 */
  .extern C2FIFOINT22INV   /* 0xBF88C8EC */
  .extern C2FIFOUA22       /* 0xBF88C8F0 */
  .extern C2FIFOUA22CLR    /* 0xBF88C8F4 */
  .extern C2FIFOUA22SET    /* 0xBF88C8F8 */
  .extern C2FIFOUA22INV    /* 0xBF88C8FC */
  .extern C2FIFOCI22       /* 0xBF88C900 */
  .extern C2FIFOCI22CLR    /* 0xBF88C904 */
  .extern C2FIFOCI22SET    /* 0xBF88C908 */
  .extern C2FIFOCI22INV    /* 0xBF88C90C */
  .extern C2FIFOCON23      /* 0xBF88C910 */
  .extern C2FIFOCON23CLR   /* 0xBF88C914 */
  .extern C2FIFOCON23SET   /* 0xBF88C918 */
  .extern C2FIFOCON23INV   /* 0xBF88C91C */
  .extern C2FIFOINT23      /* 0xBF88C920 */
  .extern C2FIFOINT23CLR   /* 0xBF88C924 */
  .extern C2FIFOINT23SET   /* 0xBF88C928 */
  .extern C2FIFOINT23INV   /* 0xBF88C92C */
  .extern C2FIFOUA23       /* 0xBF88C930 */
  .extern C2FIFOUA23CLR    /* 0xBF88C934 */
  .extern C2FIFOUA23SET    /* 0xBF88C938 */
  .extern C2FIFOUA23INV    /* 0xBF88C93C */
  .extern C2FIFOCI23       /* 0xBF88C940 */
  .extern C2FIFOCI23CLR    /* 0xBF88C944 */
  .extern C2FIFOCI23SET    /* 0xBF88C948 */
  .extern C2FIFOCI23INV    /* 0xBF88C94C */
  .extern C2FIFOCON24      /* 0xBF88C950 */
  .extern C2FIFOCON24CLR   /* 0xBF88C954 */
  .extern C2FIFOCON24SET   /* 0xBF88C958 */
  .extern C2FIFOCON24INV   /* 0xBF88C95C */
  .extern C2FIFOINT24      /* 0xBF88C960 */
  .extern C2FIFOINT24CLR   /* 0xBF88C964 */
  .extern C2FIFOINT24SET   /* 0xBF88C968 */
  .extern C2FIFOINT24INV   /* 0xBF88C96C */
  .extern C2FIFOUA24       /* 0xBF88C970 */
  .extern C2FIFOUA24CLR    /* 0xBF88C974 */
  .extern C2FIFOUA24SET    /* 0xBF88C978 */
  .extern C2FIFOUA24INV    /* 0xBF88C97C */
  .extern C2FIFOCI24       /* 0xBF88C980 */
  .extern C2FIFOCI24CLR    /* 0xBF88C984 */
  .extern C2FIFOCI24SET    /* 0xBF88C988 */
  .extern C2FIFOCI24INV    /* 0xBF88C98C */
  .extern C2FIFOCON25      /* 0xBF88C990 */
  .extern C2FIFOCON25CLR   /* 0xBF88C994 */
  .extern C2FIFOCON25SET   /* 0xBF88C998 */
  .extern C2FIFOCON25INV   /* 0xBF88C99C */
  .extern C2FIFOINT25      /* 0xBF88C9A0 */
  .extern C2FIFOINT25CLR   /* 0xBF88C9A4 */
  .extern C2FIFOINT25SET   /* 0xBF88C9A8 */
  .extern C2FIFOINT25INV   /* 0xBF88C9AC */
  .extern C2FIFOUA25       /* 0xBF88C9B0 */
  .extern C2FIFOUA25CLR    /* 0xBF88C9B4 */
  .extern C2FIFOUA25SET    /* 0xBF88C9B8 */
  .extern C2FIFOUA25INV    /* 0xBF88C9BC */
  .extern C2FIFOCI25       /* 0xBF88C9C0 */
  .extern C2FIFOCI25CLR    /* 0xBF88C9C4 */
  .extern C2FIFOCI25SET    /* 0xBF88C9C8 */
  .extern C2FIFOCI25INV    /* 0xBF88C9CC */
  .extern C2FIFOCON26      /* 0xBF88C9D0 */
  .extern C2FIFOCON26CLR   /* 0xBF88C9D4 */
  .extern C2FIFOCON26SET   /* 0xBF88C9D8 */
  .extern C2FIFOCON26INV   /* 0xBF88C9DC */
  .extern C2FIFOINT26      /* 0xBF88C9E0 */
  .extern C2FIFOINT26CLR   /* 0xBF88C9E4 */
  .extern C2FIFOINT26SET   /* 0xBF88C9E8 */
  .extern C2FIFOINT26INV   /* 0xBF88C9EC */
  .extern C2FIFOUA26       /* 0xBF88C9F0 */
  .extern C2FIFOUA26CLR    /* 0xBF88C9F4 */
  .extern C2FIFOUA26SET    /* 0xBF88C9F8 */
  .extern C2FIFOUA26INV    /* 0xBF88C9FC */
  .extern C2FIFOCI26       /* 0xBF88CA00 */
  .extern C2FIFOCI26CLR    /* 0xBF88CA04 */
  .extern C2FIFOCI26SET    /* 0xBF88CA08 */
  .extern C2FIFOCI26INV    /* 0xBF88CA0C */
  .extern C2FIFOCON27      /* 0xBF88CA10 */
  .extern C2FIFOCON27CLR   /* 0xBF88CA14 */
  .extern C2FIFOCON27SET   /* 0xBF88CA18 */
  .extern C2FIFOCON27INV   /* 0xBF88CA1C */
  .extern C2FIFOINT27      /* 0xBF88CA20 */
  .extern C2FIFOINT27CLR   /* 0xBF88CA24 */
  .extern C2FIFOINT27SET   /* 0xBF88CA28 */
  .extern C2FIFOINT27INV   /* 0xBF88CA2C */
  .extern C2FIFOUA27       /* 0xBF88CA30 */
  .extern C2FIFOUA27CLR    /* 0xBF88CA34 */
  .extern C2FIFOUA27SET    /* 0xBF88CA38 */
  .extern C2FIFOUA27INV    /* 0xBF88CA3C */
  .extern C2FIFOCI27       /* 0xBF88CA40 */
  .extern C2FIFOCI27CLR    /* 0xBF88CA44 */
  .extern C2FIFOCI27SET    /* 0xBF88CA48 */
  .extern C2FIFOCI27INV    /* 0xBF88CA4C */
  .extern C2FIFOCON28      /* 0xBF88CA50 */
  .extern C2FIFOCON28CLR   /* 0xBF88CA54 */
  .extern C2FIFOCON28SET   /* 0xBF88CA58 */
  .extern C2FIFOCON28INV   /* 0xBF88CA5C */
  .extern C2FIFOINT28      /* 0xBF88CA60 */
  .extern C2FIFOINT28CLR   /* 0xBF88CA64 */
  .extern C2FIFOINT28SET   /* 0xBF88CA68 */
  .extern C2FIFOINT28INV   /* 0xBF88CA6C */
  .extern C2FIFOUA28       /* 0xBF88CA70 */
  .extern C2FIFOUA28CLR    /* 0xBF88CA74 */
  .extern C2FIFOUA28SET    /* 0xBF88CA78 */
  .extern C2FIFOUA28INV    /* 0xBF88CA7C */
  .extern C2FIFOCI28       /* 0xBF88CA80 */
  .extern C2FIFOCI28CLR    /* 0xBF88CA84 */
  .extern C2FIFOCI28SET    /* 0xBF88CA88 */
  .extern C2FIFOCI28INV    /* 0xBF88CA8C */
  .extern C2FIFOCON29      /* 0xBF88CA90 */
  .extern C2FIFOCON29CLR   /* 0xBF88CA94 */
  .extern C2FIFOCON29SET   /* 0xBF88CA98 */
  .extern C2FIFOCON29INV   /* 0xBF88CA9C */
  .extern C2FIFOINT29      /* 0xBF88CAA0 */
  .extern C2FIFOINT29CLR   /* 0xBF88CAA4 */
  .extern C2FIFOINT29SET   /* 0xBF88CAA8 */
  .extern C2FIFOINT29INV   /* 0xBF88CAAC */
  .extern C2FIFOUA29       /* 0xBF88CAB0 */
  .extern C2FIFOUA29CLR    /* 0xBF88CAB4 */
  .extern C2FIFOUA29SET    /* 0xBF88CAB8 */
  .extern C2FIFOUA29INV    /* 0xBF88CABC */
  .extern C2FIFOCI29       /* 0xBF88CAC0 */
  .extern C2FIFOCI29CLR    /* 0xBF88CAC4 */
  .extern C2FIFOCI29SET    /* 0xBF88CAC8 */
  .extern C2FIFOCI29INV    /* 0xBF88CACC */
  .extern C2FIFOCON30      /* 0xBF88CAD0 */
  .extern C2FIFOCON30CLR   /* 0xBF88CAD4 */
  .extern C2FIFOCON30SET   /* 0xBF88CAD8 */
  .extern C2FIFOCON30INV   /* 0xBF88CADC */
  .extern C2FIFOINT30      /* 0xBF88CAE0 */
  .extern C2FIFOINT30CLR   /* 0xBF88CAE4 */
  .extern C2FIFOINT30SET   /* 0xBF88CAE8 */
  .extern C2FIFOINT30INV   /* 0xBF88CAEC */
  .extern C2FIFOUA30       /* 0xBF88CAF0 */
  .extern C2FIFOUA30CLR    /* 0xBF88CAF4 */
  .extern C2FIFOUA30SET    /* 0xBF88CAF8 */
  .extern C2FIFOUA30INV    /* 0xBF88CAFC */
  .extern C2FIFOCI30       /* 0xBF88CB00 */
  .extern C2FIFOCI30CLR    /* 0xBF88CB04 */
  .extern C2FIFOCI30SET    /* 0xBF88CB08 */
  .extern C2FIFOCI30INV    /* 0xBF88CB0C */
  .extern C2FIFOCON31      /* 0xBF88CB10 */
  .extern C2FIFOCON31CLR   /* 0xBF88CB14 */
  .extern C2FIFOCON31SET   /* 0xBF88CB18 */
  .extern C2FIFOCON31INV   /* 0xBF88CB1C */
  .extern C2FIFOINT31      /* 0xBF88CB20 */
  .extern C2FIFOINT31CLR   /* 0xBF88CB24 */
  .extern C2FIFOINT31SET   /* 0xBF88CB28 */
  .extern C2FIFOINT31INV   /* 0xBF88CB2C */
  .extern C2FIFOUA31       /* 0xBF88CB30 */
  .extern C2FIFOUA31CLR    /* 0xBF88CB34 */
  .extern C2FIFOUA31SET    /* 0xBF88CB38 */
  .extern C2FIFOUA31INV    /* 0xBF88CB3C */
  .extern C2FIFOCI31       /* 0xBF88CB40 */
  .extern C2FIFOCI31CLR    /* 0xBF88CB44 */
  .extern C2FIFOCI31SET    /* 0xBF88CB48 */
  .extern C2FIFOCI31INV    /* 0xBF88CB4C */
  .extern DEVCFG3          /* 0xBFC02FF0 */
  .extern DEVCFG2          /* 0xBFC02FF4 */
  .extern DEVCFG1          /* 0xBFC02FF8 */
  .extern DEVCFG0          /* 0xBFC02FFC */
#else
#error Unknown language!
#endif

