HomuraVehicle/homuraLib_v2/machine/device/p32mx795f512h_forVC.c
#define _C1RXM0_EID_POSITION                     0x00000000
#define _C1RXM0_EID_MASK                         0x0003FFFF
#define _C1RXM0_EID_LENGTH                       0x00000012

#define _C1RXM0_MIDE_POSITION                    0x00000013
#define _C1RXM0_MIDE_MASK                        0x00080000
#define _C1RXM0_MIDE_LENGTH                      0x00000001

#define _C1RXM0_SID_POSITION                     0x00000015
#define _C1RXM0_SID_MASK                         0xFFE00000
#define _C1RXM0_SID_LENGTH                       0x0000000B

#define _C1RXM0_w_POSITION                       0x00000000
#define _C1RXM0_w_MASK                           0xFFFFFFFF
#define _C1RXM0_w_LENGTH                         0x00000020

#define _C1RXM1_EID_POSITION                     0x00000000
#define _C1RXM1_EID_MASK                         0x0003FFFF
#define _C1RXM1_EID_LENGTH                       0x00000012

#define _C1RXM1_MIDE_POSITION                    0x00000013
#define _C1RXM1_MIDE_MASK                        0x00080000
#define _C1RXM1_MIDE_LENGTH                      0x00000001

#define _C1RXM1_SID_POSITION                     0x00000015
#define _C1RXM1_SID_MASK                         0xFFE00000
#define _C1RXM1_SID_LENGTH                       0x0000000B

#define _C1RXM1_w_POSITION                       0x00000000
#define _C1RXM1_w_MASK                           0xFFFFFFFF
#define _C1RXM1_w_LENGTH                         0x00000020

#define _C1RXM2_EID_POSITION                     0x00000000
#define _C1RXM2_EID_MASK                         0x0003FFFF
#define _C1RXM2_EID_LENGTH                       0x00000012

#define _C1RXM2_MIDE_POSITION                    0x00000013
#define _C1RXM2_MIDE_MASK                        0x00080000
#define _C1RXM2_MIDE_LENGTH                      0x00000001

#define _C1RXM2_SID_POSITION                     0x00000015
#define _C1RXM2_SID_MASK                         0xFFE00000
#define _C1RXM2_SID_LENGTH                       0x0000000B

#define _C1RXM2_w_POSITION                       0x00000000
#define _C1RXM2_w_MASK                           0xFFFFFFFF
#define _C1RXM2_w_LENGTH                         0x00000020

#define _C1RXM3_EID_POSITION                     0x00000000
#define _C1RXM3_EID_MASK                         0x0003FFFF
#define _C1RXM3_EID_LENGTH                       0x00000012

#define _C1RXM3_MIDE_POSITION                    0x00000013
#define _C1RXM3_MIDE_MASK                        0x00080000
#define _C1RXM3_MIDE_LENGTH                      0x00000001

#define _C1RXM3_SID_POSITION                     0x00000015
#define _C1RXM3_SID_MASK                         0xFFE00000
#define _C1RXM3_SID_LENGTH                       0x0000000B

#define _C1RXM3_w_POSITION                       0x00000000
#define _C1RXM3_w_MASK                           0xFFFFFFFF
#define _C1RXM3_w_LENGTH                         0x00000020

#define _C1FLTCON0_FSEL0_POSITION                0x00000000
#define _C1FLTCON0_FSEL0_MASK                    0x0000001F
#define _C1FLTCON0_FSEL0_LENGTH                  0x00000005

#define _C1FLTCON0_MSEL0_POSITION                0x00000005
#define _C1FLTCON0_MSEL0_MASK                    0x00000060
#define _C1FLTCON0_MSEL0_LENGTH                  0x00000002

#define _C1FLTCON0_FLTEN0_POSITION               0x00000007
#define _C1FLTCON0_FLTEN0_MASK                   0x00000080
#define _C1FLTCON0_FLTEN0_LENGTH                 0x00000001

#define _C1FLTCON0_FSEL1_POSITION                0x00000008
#define _C1FLTCON0_FSEL1_MASK                    0x00001F00
#define _C1FLTCON0_FSEL1_LENGTH                  0x00000005

#define _C1FLTCON0_MSEL1_POSITION                0x0000000D
#define _C1FLTCON0_MSEL1_MASK                    0x00006000
#define _C1FLTCON0_MSEL1_LENGTH                  0x00000002

#define _C1FLTCON0_FLTEN1_POSITION               0x0000000F
#define _C1FLTCON0_FLTEN1_MASK                   0x00008000
#define _C1FLTCON0_FLTEN1_LENGTH                 0x00000001

#define _C1FLTCON0_FSEL2_POSITION                0x00000010
#define _C1FLTCON0_FSEL2_MASK                    0x001F0000
#define _C1FLTCON0_FSEL2_LENGTH                  0x00000005

#define _C1FLTCON0_MSEL2_POSITION                0x00000015
#define _C1FLTCON0_MSEL2_MASK                    0x00600000
#define _C1FLTCON0_MSEL2_LENGTH                  0x00000002

#define _C1FLTCON0_FLTEN2_POSITION               0x00000017
#define _C1FLTCON0_FLTEN2_MASK                   0x00800000
#define _C1FLTCON0_FLTEN2_LENGTH                 0x00000001

#define _C1FLTCON0_FSEL3_POSITION                0x00000018
#define _C1FLTCON0_FSEL3_MASK                    0x1F000000
#define _C1FLTCON0_FSEL3_LENGTH                  0x00000005

#define _C1FLTCON0_MSEL3_POSITION                0x0000001D
#define _C1FLTCON0_MSEL3_MASK                    0x60000000
#define _C1FLTCON0_MSEL3_LENGTH                  0x00000002

#define _C1FLTCON0_FLTEN3_POSITION               0x0000001F
#define _C1FLTCON0_FLTEN3_MASK                   0x80000000
#define _C1FLTCON0_FLTEN3_LENGTH                 0x00000001

#define _C1FLTCON0_w_POSITION                    0x00000000
#define _C1FLTCON0_w_MASK                        0xFFFFFFFF
#define _C1FLTCON0_w_LENGTH                      0x00000020

#define _C1FLTCON1_FSEL4_POSITION                0x00000000
#define _C1FLTCON1_FSEL4_MASK                    0x0000001F
#define _C1FLTCON1_FSEL4_LENGTH                  0x00000005

#define _C1FLTCON1_MSEL4_POSITION                0x00000005
#define _C1FLTCON1_MSEL4_MASK                    0x00000060
#define _C1FLTCON1_MSEL4_LENGTH                  0x00000002

#define _C1FLTCON1_FLTEN4_POSITION               0x00000007
#define _C1FLTCON1_FLTEN4_MASK                   0x00000080
#define _C1FLTCON1_FLTEN4_LENGTH                 0x00000001

#define _C1FLTCON1_FSEL5_POSITION                0x00000008
#define _C1FLTCON1_FSEL5_MASK                    0x00001F00
#define _C1FLTCON1_FSEL5_LENGTH                  0x00000005

#define _C1FLTCON1_MSEL5_POSITION                0x0000000D
#define _C1FLTCON1_MSEL5_MASK                    0x00006000
#define _C1FLTCON1_MSEL5_LENGTH                  0x00000002

