HomuraVehicle/homuraLib_v2/machine/device/p32mx795f512h_forVC.c
#define _C1FLTCON4_FSEL16_POSITION               0x00000000
#define _C1FLTCON4_FSEL16_MASK                   0x0000001F
#define _C1FLTCON4_FSEL16_LENGTH                 0x00000005

#define _C1FLTCON4_MSEL16_POSITION               0x00000005
#define _C1FLTCON4_MSEL16_MASK                   0x00000060
#define _C1FLTCON4_MSEL16_LENGTH                 0x00000002

#define _C1FLTCON4_FLTEN16_POSITION              0x00000007
#define _C1FLTCON4_FLTEN16_MASK                  0x00000080
#define _C1FLTCON4_FLTEN16_LENGTH                0x00000001

#define _C1FLTCON4_FSEL17_POSITION               0x00000008
#define _C1FLTCON4_FSEL17_MASK                   0x00001F00
#define _C1FLTCON4_FSEL17_LENGTH                 0x00000005

#define _C1FLTCON4_MSEL17_POSITION               0x0000000D
#define _C1FLTCON4_MSEL17_MASK                   0x00006000
#define _C1FLTCON4_MSEL17_LENGTH                 0x00000002

#define _C1FLTCON4_FLTEN17_POSITION              0x0000000F
#define _C1FLTCON4_FLTEN17_MASK                  0x00008000
#define _C1FLTCON4_FLTEN17_LENGTH                0x00000001

#define _C1FLTCON4_FSEL18_POSITION               0x00000010
#define _C1FLTCON4_FSEL18_MASK                   0x001F0000
#define _C1FLTCON4_FSEL18_LENGTH                 0x00000005

#define _C1FLTCON4_MSEL18_POSITION               0x00000015
#define _C1FLTCON4_MSEL18_MASK                   0x00600000
#define _C1FLTCON4_MSEL18_LENGTH                 0x00000002

#define _C1FLTCON4_FLTEN18_POSITION              0x00000017
#define _C1FLTCON4_FLTEN18_MASK                  0x00800000
#define _C1FLTCON4_FLTEN18_LENGTH                0x00000001

#define _C1FLTCON4_FSEL19_POSITION               0x00000018
#define _C1FLTCON4_FSEL19_MASK                   0x1F000000
#define _C1FLTCON4_FSEL19_LENGTH                 0x00000005

#define _C1FLTCON4_MSEL19_POSITION               0x0000001D
#define _C1FLTCON4_MSEL19_MASK                   0x60000000
#define _C1FLTCON4_MSEL19_LENGTH                 0x00000002

#define _C1FLTCON4_FLTEN19_POSITION              0x0000001F
#define _C1FLTCON4_FLTEN19_MASK                  0x80000000
#define _C1FLTCON4_FLTEN19_LENGTH                0x00000001

#define _C1FLTCON4_w_POSITION                    0x00000000
#define _C1FLTCON4_w_MASK                        0xFFFFFFFF
#define _C1FLTCON4_w_LENGTH                      0x00000020

#define _C1FLTCON5_FSEL20_POSITION               0x00000000
#define _C1FLTCON5_FSEL20_MASK                   0x0000001F
#define _C1FLTCON5_FSEL20_LENGTH                 0x00000005

#define _C1FLTCON5_MSEL20_POSITION               0x00000005
#define _C1FLTCON5_MSEL20_MASK                   0x00000060
#define _C1FLTCON5_MSEL20_LENGTH                 0x00000002

#define _C1FLTCON5_FLTEN20_POSITION              0x00000007
#define _C1FLTCON5_FLTEN20_MASK                  0x00000080
#define _C1FLTCON5_FLTEN20_LENGTH                0x00000001

#define _C1FLTCON5_FSEL21_POSITION               0x00000008
#define _C1FLTCON5_FSEL21_MASK                   0x00001F00
#define _C1FLTCON5_FSEL21_LENGTH                 0x00000005

#define _C1FLTCON5_MSEL21_POSITION               0x0000000D
#define _C1FLTCON5_MSEL21_MASK                   0x00006000
#define _C1FLTCON5_MSEL21_LENGTH                 0x00000002

#define _C1FLTCON5_FLTEN21_POSITION              0x0000000F
#define _C1FLTCON5_FLTEN21_MASK                  0x00008000
#define _C1FLTCON5_FLTEN21_LENGTH                0x00000001

#define _C1FLTCON5_FSEL22_POSITION               0x00000010
#define _C1FLTCON5_FSEL22_MASK                   0x001F0000
#define _C1FLTCON5_FSEL22_LENGTH                 0x00000005

#define _C1FLTCON5_MSEL22_POSITION               0x00000015
#define _C1FLTCON5_MSEL22_MASK                   0x00600000
#define _C1FLTCON5_MSEL22_LENGTH                 0x00000002

#define _C1FLTCON5_FLTEN22_POSITION              0x00000017
#define _C1FLTCON5_FLTEN22_MASK                  0x00800000
#define _C1FLTCON5_FLTEN22_LENGTH                0x00000001

#define _C1FLTCON5_FSEL23_POSITION               0x00000018
#define _C1FLTCON5_FSEL23_MASK                   0x1F000000
#define _C1FLTCON5_FSEL23_LENGTH                 0x00000005

#define _C1FLTCON5_MSEL23_POSITION               0x0000001D
#define _C1FLTCON5_MSEL23_MASK                   0x60000000
#define _C1FLTCON5_MSEL23_LENGTH                 0x00000002

#define _C1FLTCON5_FLTEN23_POSITION              0x0000001F
#define _C1FLTCON5_FLTEN23_MASK                  0x80000000
#define _C1FLTCON5_FLTEN23_LENGTH                0x00000001

#define _C1FLTCON5_w_POSITION                    0x00000000
#define _C1FLTCON5_w_MASK                        0xFFFFFFFF
#define _C1FLTCON5_w_LENGTH                      0x00000020

#define _C1FLTCON6_FSEL24_POSITION               0x00000000
#define _C1FLTCON6_FSEL24_MASK                   0x0000001F
#define _C1FLTCON6_FSEL24_LENGTH                 0x00000005

#define _C1FLTCON6_MSEL24_POSITION               0x00000005
#define _C1FLTCON6_MSEL24_MASK                   0x00000060
#define _C1FLTCON6_MSEL24_LENGTH                 0x00000002

#define _C1FLTCON6_FLTEN24_POSITION              0x00000007
#define _C1FLTCON6_FLTEN24_MASK                  0x00000080
#define _C1FLTCON6_FLTEN24_LENGTH                0x00000001

#define _C1FLTCON6_FSEL25_POSITION               0x00000008
#define _C1FLTCON6_FSEL25_MASK                   0x00001F00
#define _C1FLTCON6_FSEL25_LENGTH                 0x00000005

#define _C1FLTCON6_MSEL25_POSITION               0x0000000D
#define _C1FLTCON6_MSEL25_MASK                   0x00006000
#define _C1FLTCON6_MSEL25_LENGTH                 0x00000002

#define _C1FLTCON6_FLTEN25_POSITION              0x0000000F
#define _C1FLTCON6_FLTEN25_MASK                  0x00008000
#define _C1FLTCON6_FLTEN25_LENGTH                0x00000001

#define _C1FLTCON6_FSEL26_POSITION               0x00000010
#define _C1FLTCON6_FSEL26_MASK                   0x001F0000
#define _C1FLTCON6_FSEL26_LENGTH                 0x00000005

#define _C1FLTCON6_MSEL26_POSITION               0x00000015
#define _C1FLTCON6_MSEL26_MASK                   0x00600000
#define _C1FLTCON6_MSEL26_LENGTH                 0x00000002

#define _C1FLTCON6_FLTEN26_POSITION              0x00000017
#define _C1FLTCON6_FLTEN26_MASK                  0x00800000
#define _C1FLTCON6_FLTEN26_LENGTH                0x00000001

