HomuraVehicle/homuraLib_v2/machine/device/p32mx795f512h_forVC.c
#define _C1FIFOCON0_TXPRI_POSITION               0x00000000
#define _C1FIFOCON0_TXPRI_MASK                   0x00000003
#define _C1FIFOCON0_TXPRI_LENGTH                 0x00000002

#define _C1FIFOCON0_RTREN_POSITION               0x00000002
#define _C1FIFOCON0_RTREN_MASK                   0x00000004
#define _C1FIFOCON0_RTREN_LENGTH                 0x00000001

#define _C1FIFOCON0_TXREQ_POSITION               0x00000003
#define _C1FIFOCON0_TXREQ_MASK                   0x00000008
#define _C1FIFOCON0_TXREQ_LENGTH                 0x00000001

#define _C1FIFOCON0_TXERR_POSITION               0x00000004
#define _C1FIFOCON0_TXERR_MASK                   0x00000010
#define _C1FIFOCON0_TXERR_LENGTH                 0x00000001

#define _C1FIFOCON0_TXLARB_POSITION              0x00000005
#define _C1FIFOCON0_TXLARB_MASK                  0x00000020
#define _C1FIFOCON0_TXLARB_LENGTH                0x00000001

#define _C1FIFOCON0_TXABAT_POSITION              0x00000006
#define _C1FIFOCON0_TXABAT_MASK                  0x00000040
#define _C1FIFOCON0_TXABAT_LENGTH                0x00000001

#define _C1FIFOCON0_TXEN_POSITION                0x00000007
#define _C1FIFOCON0_TXEN_MASK                    0x00000080
#define _C1FIFOCON0_TXEN_LENGTH                  0x00000001

#define _C1FIFOCON0_DONLY_POSITION               0x0000000C
#define _C1FIFOCON0_DONLY_MASK                   0x00001000
#define _C1FIFOCON0_DONLY_LENGTH                 0x00000001

#define _C1FIFOCON0_UINC_POSITION                0x0000000D
#define _C1FIFOCON0_UINC_MASK                    0x00002000
#define _C1FIFOCON0_UINC_LENGTH                  0x00000001

#define _C1FIFOCON0_FRESET_POSITION              0x0000000E
#define _C1FIFOCON0_FRESET_MASK                  0x00004000
#define _C1FIFOCON0_FRESET_LENGTH                0x00000001

#define _C1FIFOCON0_FSIZE_POSITION               0x00000010
#define _C1FIFOCON0_FSIZE_MASK                   0x001F0000
#define _C1FIFOCON0_FSIZE_LENGTH                 0x00000005

#define _C1FIFOCON0_w_POSITION                   0x00000000
#define _C1FIFOCON0_w_MASK                       0xFFFFFFFF
#define _C1FIFOCON0_w_LENGTH                     0x00000020

#define _C1FIFOINT0_RXNEMPTYIF_POSITION          0x00000000
#define _C1FIFOINT0_RXNEMPTYIF_MASK              0x00000001
#define _C1FIFOINT0_RXNEMPTYIF_LENGTH            0x00000001

#define _C1FIFOINT0_RXHALFIF_POSITION            0x00000001
#define _C1FIFOINT0_RXHALFIF_MASK                0x00000002
#define _C1FIFOINT0_RXHALFIF_LENGTH              0x00000001

#define _C1FIFOINT0_RXFULLIF_POSITION            0x00000002
#define _C1FIFOINT0_RXFULLIF_MASK                0x00000004
#define _C1FIFOINT0_RXFULLIF_LENGTH              0x00000001

#define _C1FIFOINT0_RXOVFLIF_POSITION            0x00000003
#define _C1FIFOINT0_RXOVFLIF_MASK                0x00000008
#define _C1FIFOINT0_RXOVFLIF_LENGTH              0x00000001

#define _C1FIFOINT0_TXEMPTYIF_POSITION           0x00000008
#define _C1FIFOINT0_TXEMPTYIF_MASK               0x00000100
#define _C1FIFOINT0_TXEMPTYIF_LENGTH             0x00000001

#define _C1FIFOINT0_TXHALFIF_POSITION            0x00000009
#define _C1FIFOINT0_TXHALFIF_MASK                0x00000200
#define _C1FIFOINT0_TXHALFIF_LENGTH              0x00000001

#define _C1FIFOINT0_TXNFULLIF_POSITION           0x0000000A
#define _C1FIFOINT0_TXNFULLIF_MASK               0x00000400
#define _C1FIFOINT0_TXNFULLIF_LENGTH             0x00000001

#define _C1FIFOINT0_RXNEMPTYIE_POSITION          0x00000010
#define _C1FIFOINT0_RXNEMPTYIE_MASK              0x00010000
#define _C1FIFOINT0_RXNEMPTYIE_LENGTH            0x00000001

#define _C1FIFOINT0_RXHALFIE_POSITION            0x00000011
#define _C1FIFOINT0_RXHALFIE_MASK                0x00020000
#define _C1FIFOINT0_RXHALFIE_LENGTH              0x00000001

#define _C1FIFOINT0_RXFULLIE_POSITION            0x00000012
#define _C1FIFOINT0_RXFULLIE_MASK                0x00040000
#define _C1FIFOINT0_RXFULLIE_LENGTH              0x00000001

#define _C1FIFOINT0_RXOVFLIE_POSITION            0x00000013
#define _C1FIFOINT0_RXOVFLIE_MASK                0x00080000
#define _C1FIFOINT0_RXOVFLIE_LENGTH              0x00000001

#define _C1FIFOINT0_TXEMPTYIE_POSITION           0x00000018
#define _C1FIFOINT0_TXEMPTYIE_MASK               0x01000000
#define _C1FIFOINT0_TXEMPTYIE_LENGTH             0x00000001

#define _C1FIFOINT0_TXHALFIE_POSITION            0x00000019
#define _C1FIFOINT0_TXHALFIE_MASK                0x02000000
#define _C1FIFOINT0_TXHALFIE_LENGTH              0x00000001

#define _C1FIFOINT0_TXNFULLIE_POSITION           0x0000001A
#define _C1FIFOINT0_TXNFULLIE_MASK               0x04000000
#define _C1FIFOINT0_TXNFULLIE_LENGTH             0x00000001

#define _C1FIFOINT0_w_POSITION                   0x00000000
#define _C1FIFOINT0_w_MASK                       0xFFFFFFFF
#define _C1FIFOINT0_w_LENGTH                     0x00000020

#define _C1FIFOCI0_CFIFOCI_POSITION              0x00000000
#define _C1FIFOCI0_CFIFOCI_MASK                  0x0000001F
#define _C1FIFOCI0_CFIFOCI_LENGTH                0x00000005

#define _C1FIFOCI0_w_POSITION                    0x00000000
#define _C1FIFOCI0_w_MASK                        0xFFFFFFFF
#define _C1FIFOCI0_w_LENGTH                      0x00000020

#define _C1FIFOCON1_TXPRI_POSITION               0x00000000
#define _C1FIFOCON1_TXPRI_MASK                   0x00000003
#define _C1FIFOCON1_TXPRI_LENGTH                 0x00000002

#define _C1FIFOCON1_RTREN_POSITION               0x00000002
#define _C1FIFOCON1_RTREN_MASK                   0x00000004
#define _C1FIFOCON1_RTREN_LENGTH                 0x00000001

#define _C1FIFOCON1_TXREQ_POSITION               0x00000003
#define _C1FIFOCON1_TXREQ_MASK                   0x00000008
#define _C1FIFOCON1_TXREQ_LENGTH                 0x00000001

#define _C1FIFOCON1_TXERR_POSITION               0x00000004
#define _C1FIFOCON1_TXERR_MASK                   0x00000010
#define _C1FIFOCON1_TXERR_LENGTH                 0x00000001

#define _C1FIFOCON1_TXLARB_POSITION              0x00000005
#define _C1FIFOCON1_TXLARB_MASK                  0x00000020
#define _C1FIFOCON1_TXLARB_LENGTH                0x00000001

