HomuraVehicle/homuraLib_v2/machine/device/p32mx795f512h_forVC.c
#define _C1FIFOINT9_TXNFULLIE_POSITION           0x0000001A
#define _C1FIFOINT9_TXNFULLIE_MASK               0x04000000
#define _C1FIFOINT9_TXNFULLIE_LENGTH             0x00000001

#define _C1FIFOINT9_w_POSITION                   0x00000000
#define _C1FIFOINT9_w_MASK                       0xFFFFFFFF
#define _C1FIFOINT9_w_LENGTH                     0x00000020

#define _C1FIFOCI9_CFIFOCI_POSITION              0x00000000
#define _C1FIFOCI9_CFIFOCI_MASK                  0x0000001F
#define _C1FIFOCI9_CFIFOCI_LENGTH                0x00000005

#define _C1FIFOCI9_w_POSITION                    0x00000000
#define _C1FIFOCI9_w_MASK                        0xFFFFFFFF
#define _C1FIFOCI9_w_LENGTH                      0x00000020

#define _C1FIFOCON10_TXPRI_POSITION              0x00000000
#define _C1FIFOCON10_TXPRI_MASK                  0x00000003
#define _C1FIFOCON10_TXPRI_LENGTH                0x00000002

#define _C1FIFOCON10_RTREN_POSITION              0x00000002
#define _C1FIFOCON10_RTREN_MASK                  0x00000004
#define _C1FIFOCON10_RTREN_LENGTH                0x00000001

#define _C1FIFOCON10_TXREQ_POSITION              0x00000003
#define _C1FIFOCON10_TXREQ_MASK                  0x00000008
#define _C1FIFOCON10_TXREQ_LENGTH                0x00000001

#define _C1FIFOCON10_TXERR_POSITION              0x00000004
#define _C1FIFOCON10_TXERR_MASK                  0x00000010
#define _C1FIFOCON10_TXERR_LENGTH                0x00000001

#define _C1FIFOCON10_TXLARB_POSITION             0x00000005
#define _C1FIFOCON10_TXLARB_MASK                 0x00000020
#define _C1FIFOCON10_TXLARB_LENGTH               0x00000001

#define _C1FIFOCON10_TXABAT_POSITION             0x00000006
#define _C1FIFOCON10_TXABAT_MASK                 0x00000040
#define _C1FIFOCON10_TXABAT_LENGTH               0x00000001

#define _C1FIFOCON10_TXEN_POSITION               0x00000007
#define _C1FIFOCON10_TXEN_MASK                   0x00000080
#define _C1FIFOCON10_TXEN_LENGTH                 0x00000001

#define _C1FIFOCON10_DONLY_POSITION              0x0000000C
#define _C1FIFOCON10_DONLY_MASK                  0x00001000
#define _C1FIFOCON10_DONLY_LENGTH                0x00000001

#define _C1FIFOCON10_UINC_POSITION               0x0000000D
#define _C1FIFOCON10_UINC_MASK                   0x00002000
#define _C1FIFOCON10_UINC_LENGTH                 0x00000001

#define _C1FIFOCON10_FRESET_POSITION             0x0000000E
#define _C1FIFOCON10_FRESET_MASK                 0x00004000
#define _C1FIFOCON10_FRESET_LENGTH               0x00000001

#define _C1FIFOCON10_FSIZE_POSITION              0x00000010
#define _C1FIFOCON10_FSIZE_MASK                  0x001F0000
#define _C1FIFOCON10_FSIZE_LENGTH                0x00000005

#define _C1FIFOCON10_w_POSITION                  0x00000000
#define _C1FIFOCON10_w_MASK                      0xFFFFFFFF
#define _C1FIFOCON10_w_LENGTH                    0x00000020

#define _C1FIFOINT10_RXNEMPTYIF_POSITION         0x00000000
#define _C1FIFOINT10_RXNEMPTYIF_MASK             0x00000001
#define _C1FIFOINT10_RXNEMPTYIF_LENGTH           0x00000001

#define _C1FIFOINT10_RXHALFIF_POSITION           0x00000001
#define _C1FIFOINT10_RXHALFIF_MASK               0x00000002
#define _C1FIFOINT10_RXHALFIF_LENGTH             0x00000001

#define _C1FIFOINT10_RXFULLIF_POSITION           0x00000002
#define _C1FIFOINT10_RXFULLIF_MASK               0x00000004
#define _C1FIFOINT10_RXFULLIF_LENGTH             0x00000001

#define _C1FIFOINT10_RXOVFLIF_POSITION           0x00000003
#define _C1FIFOINT10_RXOVFLIF_MASK               0x00000008
#define _C1FIFOINT10_RXOVFLIF_LENGTH             0x00000001

#define _C1FIFOINT10_TXEMPTYIF_POSITION          0x00000008
#define _C1FIFOINT10_TXEMPTYIF_MASK              0x00000100
#define _C1FIFOINT10_TXEMPTYIF_LENGTH            0x00000001

#define _C1FIFOINT10_TXHALFIF_POSITION           0x00000009
#define _C1FIFOINT10_TXHALFIF_MASK               0x00000200
#define _C1FIFOINT10_TXHALFIF_LENGTH             0x00000001

#define _C1FIFOINT10_TXNFULLIF_POSITION          0x0000000A
#define _C1FIFOINT10_TXNFULLIF_MASK              0x00000400
#define _C1FIFOINT10_TXNFULLIF_LENGTH            0x00000001

#define _C1FIFOINT10_RXNEMPTYIE_POSITION         0x00000010
#define _C1FIFOINT10_RXNEMPTYIE_MASK             0x00010000
#define _C1FIFOINT10_RXNEMPTYIE_LENGTH           0x00000001

#define _C1FIFOINT10_RXHALFIE_POSITION           0x00000011
#define _C1FIFOINT10_RXHALFIE_MASK               0x00020000
#define _C1FIFOINT10_RXHALFIE_LENGTH             0x00000001

#define _C1FIFOINT10_RXFULLIE_POSITION           0x00000012
#define _C1FIFOINT10_RXFULLIE_MASK               0x00040000
#define _C1FIFOINT10_RXFULLIE_LENGTH             0x00000001

#define _C1FIFOINT10_RXOVFLIE_POSITION           0x00000013
#define _C1FIFOINT10_RXOVFLIE_MASK               0x00080000
#define _C1FIFOINT10_RXOVFLIE_LENGTH             0x00000001

#define _C1FIFOINT10_TXEMPTYIE_POSITION          0x00000018
#define _C1FIFOINT10_TXEMPTYIE_MASK              0x01000000
#define _C1FIFOINT10_TXEMPTYIE_LENGTH            0x00000001

#define _C1FIFOINT10_TXHALFIE_POSITION           0x00000019
#define _C1FIFOINT10_TXHALFIE_MASK               0x02000000
#define _C1FIFOINT10_TXHALFIE_LENGTH             0x00000001

#define _C1FIFOINT10_TXNFULLIE_POSITION          0x0000001A
#define _C1FIFOINT10_TXNFULLIE_MASK              0x04000000
#define _C1FIFOINT10_TXNFULLIE_LENGTH            0x00000001

#define _C1FIFOINT10_w_POSITION                  0x00000000
#define _C1FIFOINT10_w_MASK                      0xFFFFFFFF
#define _C1FIFOINT10_w_LENGTH                    0x00000020

#define _C1FIFOCI10_CFIFOCI_POSITION             0x00000000
#define _C1FIFOCI10_CFIFOCI_MASK                 0x0000001F
#define _C1FIFOCI10_CFIFOCI_LENGTH               0x00000005

#define _C1FIFOCI10_w_POSITION                   0x00000000
#define _C1FIFOCI10_w_MASK                       0xFFFFFFFF
#define _C1FIFOCI10_w_LENGTH                     0x00000020

#define _C1FIFOCON11_TXPRI_POSITION              0x00000000
#define _C1FIFOCON11_TXPRI_MASK                  0x00000003
#define _C1FIFOCON11_TXPRI_LENGTH                0x00000002

#define _C1FIFOCON11_RTREN_POSITION              0x00000002
#define _C1FIFOCON11_RTREN_MASK                  0x00000004
#define _C1FIFOCON11_RTREN_LENGTH                0x00000001

#define _C1FIFOCON11_TXREQ_POSITION              0x00000003
#define _C1FIFOCON11_TXREQ_MASK                  0x00000008
#define _C1FIFOCON11_TXREQ_LENGTH                0x00000001

#define _C1FIFOCON11_TXERR_POSITION              0x00000004
#define _C1FIFOCON11_TXERR_MASK                  0x00000010
#define _C1FIFOCON11_TXERR_LENGTH                0x00000001

#define _C1FIFOCON11_TXLARB_POSITION             0x00000005
#define _C1FIFOCON11_TXLARB_MASK                 0x00000020
#define _C1FIFOCON11_TXLARB_LENGTH               0x00000001

#define _C1FIFOCON11_TXABAT_POSITION             0x00000006
#define _C1FIFOCON11_TXABAT_MASK                 0x00000040
#define _C1FIFOCON11_TXABAT_LENGTH               0x00000001

#define _C1FIFOCON11_TXEN_POSITION               0x00000007
#define _C1FIFOCON11_TXEN_MASK                   0x00000080
#define _C1FIFOCON11_TXEN_LENGTH                 0x00000001

