HomuraVehicle/homuraLib_v2/machine/device/p32mx795f512h_forVC.c
#define _C1FIFOINT12_RXHALFIF_POSITION           0x00000001
#define _C1FIFOINT12_RXHALFIF_MASK               0x00000002
#define _C1FIFOINT12_RXHALFIF_LENGTH             0x00000001

#define _C1FIFOINT12_RXFULLIF_POSITION           0x00000002
#define _C1FIFOINT12_RXFULLIF_MASK               0x00000004
#define _C1FIFOINT12_RXFULLIF_LENGTH             0x00000001

#define _C1FIFOINT12_RXOVFLIF_POSITION           0x00000003
#define _C1FIFOINT12_RXOVFLIF_MASK               0x00000008
#define _C1FIFOINT12_RXOVFLIF_LENGTH             0x00000001

#define _C1FIFOINT12_TXEMPTYIF_POSITION          0x00000008
#define _C1FIFOINT12_TXEMPTYIF_MASK              0x00000100
#define _C1FIFOINT12_TXEMPTYIF_LENGTH            0x00000001

#define _C1FIFOINT12_TXHALFIF_POSITION           0x00000009
#define _C1FIFOINT12_TXHALFIF_MASK               0x00000200
#define _C1FIFOINT12_TXHALFIF_LENGTH             0x00000001

#define _C1FIFOINT12_TXNFULLIF_POSITION          0x0000000A
#define _C1FIFOINT12_TXNFULLIF_MASK              0x00000400
#define _C1FIFOINT12_TXNFULLIF_LENGTH            0x00000001

#define _C1FIFOINT12_RXNEMPTYIE_POSITION         0x00000010
#define _C1FIFOINT12_RXNEMPTYIE_MASK             0x00010000
#define _C1FIFOINT12_RXNEMPTYIE_LENGTH           0x00000001

#define _C1FIFOINT12_RXHALFIE_POSITION           0x00000011
#define _C1FIFOINT12_RXHALFIE_MASK               0x00020000
#define _C1FIFOINT12_RXHALFIE_LENGTH             0x00000001

#define _C1FIFOINT12_RXFULLIE_POSITION           0x00000012
#define _C1FIFOINT12_RXFULLIE_MASK               0x00040000
#define _C1FIFOINT12_RXFULLIE_LENGTH             0x00000001

#define _C1FIFOINT12_RXOVFLIE_POSITION           0x00000013
#define _C1FIFOINT12_RXOVFLIE_MASK               0x00080000
#define _C1FIFOINT12_RXOVFLIE_LENGTH             0x00000001

#define _C1FIFOINT12_TXEMPTYIE_POSITION          0x00000018
#define _C1FIFOINT12_TXEMPTYIE_MASK              0x01000000
#define _C1FIFOINT12_TXEMPTYIE_LENGTH            0x00000001

#define _C1FIFOINT12_TXHALFIE_POSITION           0x00000019
#define _C1FIFOINT12_TXHALFIE_MASK               0x02000000
#define _C1FIFOINT12_TXHALFIE_LENGTH             0x00000001

#define _C1FIFOINT12_TXNFULLIE_POSITION          0x0000001A
#define _C1FIFOINT12_TXNFULLIE_MASK              0x04000000
#define _C1FIFOINT12_TXNFULLIE_LENGTH            0x00000001

#define _C1FIFOINT12_w_POSITION                  0x00000000
#define _C1FIFOINT12_w_MASK                      0xFFFFFFFF
#define _C1FIFOINT12_w_LENGTH                    0x00000020

#define _C1FIFOCI12_CFIFOCI_POSITION             0x00000000
#define _C1FIFOCI12_CFIFOCI_MASK                 0x0000001F
#define _C1FIFOCI12_CFIFOCI_LENGTH               0x00000005

#define _C1FIFOCI12_w_POSITION                   0x00000000
#define _C1FIFOCI12_w_MASK                       0xFFFFFFFF
#define _C1FIFOCI12_w_LENGTH                     0x00000020

#define _C1FIFOCON13_TXPRI_POSITION              0x00000000
#define _C1FIFOCON13_TXPRI_MASK                  0x00000003
#define _C1FIFOCON13_TXPRI_LENGTH                0x00000002

#define _C1FIFOCON13_RTREN_POSITION              0x00000002
#define _C1FIFOCON13_RTREN_MASK                  0x00000004
#define _C1FIFOCON13_RTREN_LENGTH                0x00000001

#define _C1FIFOCON13_TXREQ_POSITION              0x00000003
#define _C1FIFOCON13_TXREQ_MASK                  0x00000008
#define _C1FIFOCON13_TXREQ_LENGTH                0x00000001

#define _C1FIFOCON13_TXERR_POSITION              0x00000004
#define _C1FIFOCON13_TXERR_MASK                  0x00000010
#define _C1FIFOCON13_TXERR_LENGTH                0x00000001

#define _C1FIFOCON13_TXLARB_POSITION             0x00000005
#define _C1FIFOCON13_TXLARB_MASK                 0x00000020
#define _C1FIFOCON13_TXLARB_LENGTH               0x00000001

#define _C1FIFOCON13_TXABAT_POSITION             0x00000006
#define _C1FIFOCON13_TXABAT_MASK                 0x00000040
#define _C1FIFOCON13_TXABAT_LENGTH               0x00000001

#define _C1FIFOCON13_TXEN_POSITION               0x00000007
#define _C1FIFOCON13_TXEN_MASK                   0x00000080
#define _C1FIFOCON13_TXEN_LENGTH                 0x00000001

#define _C1FIFOCON13_DONLY_POSITION              0x0000000C
#define _C1FIFOCON13_DONLY_MASK                  0x00001000
#define _C1FIFOCON13_DONLY_LENGTH                0x00000001

#define _C1FIFOCON13_UINC_POSITION               0x0000000D
#define _C1FIFOCON13_UINC_MASK                   0x00002000
#define _C1FIFOCON13_UINC_LENGTH                 0x00000001

#define _C1FIFOCON13_FRESET_POSITION             0x0000000E
#define _C1FIFOCON13_FRESET_MASK                 0x00004000
#define _C1FIFOCON13_FRESET_LENGTH               0x00000001

#define _C1FIFOCON13_FSIZE_POSITION              0x00000010
#define _C1FIFOCON13_FSIZE_MASK                  0x001F0000
#define _C1FIFOCON13_FSIZE_LENGTH                0x00000005

#define _C1FIFOCON13_w_POSITION                  0x00000000
#define _C1FIFOCON13_w_MASK                      0xFFFFFFFF
#define _C1FIFOCON13_w_LENGTH                    0x00000020

#define _C1FIFOINT13_RXNEMPTYIF_POSITION         0x00000000
#define _C1FIFOINT13_RXNEMPTYIF_MASK             0x00000001
#define _C1FIFOINT13_RXNEMPTYIF_LENGTH           0x00000001

#define _C1FIFOINT13_RXHALFIF_POSITION           0x00000001
#define _C1FIFOINT13_RXHALFIF_MASK               0x00000002
#define _C1FIFOINT13_RXHALFIF_LENGTH             0x00000001

#define _C1FIFOINT13_RXFULLIF_POSITION           0x00000002
#define _C1FIFOINT13_RXFULLIF_MASK               0x00000004
#define _C1FIFOINT13_RXFULLIF_LENGTH             0x00000001

#define _C1FIFOINT13_RXOVFLIF_POSITION           0x00000003
#define _C1FIFOINT13_RXOVFLIF_MASK               0x00000008
#define _C1FIFOINT13_RXOVFLIF_LENGTH             0x00000001

#define _C1FIFOINT13_TXEMPTYIF_POSITION          0x00000008
#define _C1FIFOINT13_TXEMPTYIF_MASK              0x00000100
#define _C1FIFOINT13_TXEMPTYIF_LENGTH            0x00000001

#define _C1FIFOINT13_TXHALFIF_POSITION           0x00000009
#define _C1FIFOINT13_TXHALFIF_MASK               0x00000200
#define _C1FIFOINT13_TXHALFIF_LENGTH             0x00000001

