HomuraVehicle/homuraLib_v2/machine/device/p32mx795f512h_forVC.c
#define _C1FIFOINT31_RXOVFLIF_POSITION           0x00000003
#define _C1FIFOINT31_RXOVFLIF_MASK               0x00000008
#define _C1FIFOINT31_RXOVFLIF_LENGTH             0x00000001

#define _C1FIFOINT31_TXEMPTYIF_POSITION          0x00000008
#define _C1FIFOINT31_TXEMPTYIF_MASK              0x00000100
#define _C1FIFOINT31_TXEMPTYIF_LENGTH            0x00000001

#define _C1FIFOINT31_TXHALFIF_POSITION           0x00000009
#define _C1FIFOINT31_TXHALFIF_MASK               0x00000200
#define _C1FIFOINT31_TXHALFIF_LENGTH             0x00000001

#define _C1FIFOINT31_TXNFULLIF_POSITION          0x0000000A
#define _C1FIFOINT31_TXNFULLIF_MASK              0x00000400
#define _C1FIFOINT31_TXNFULLIF_LENGTH            0x00000001

#define _C1FIFOINT31_RXNEMPTYIE_POSITION         0x00000010
#define _C1FIFOINT31_RXNEMPTYIE_MASK             0x00010000
#define _C1FIFOINT31_RXNEMPTYIE_LENGTH           0x00000001

#define _C1FIFOINT31_RXHALFIE_POSITION           0x00000011
#define _C1FIFOINT31_RXHALFIE_MASK               0x00020000
#define _C1FIFOINT31_RXHALFIE_LENGTH             0x00000001

#define _C1FIFOINT31_RXFULLIE_POSITION           0x00000012
#define _C1FIFOINT31_RXFULLIE_MASK               0x00040000
#define _C1FIFOINT31_RXFULLIE_LENGTH             0x00000001

#define _C1FIFOINT31_RXOVFLIE_POSITION           0x00000013
#define _C1FIFOINT31_RXOVFLIE_MASK               0x00080000
#define _C1FIFOINT31_RXOVFLIE_LENGTH             0x00000001

#define _C1FIFOINT31_TXEMPTYIE_POSITION          0x00000018
#define _C1FIFOINT31_TXEMPTYIE_MASK              0x01000000
#define _C1FIFOINT31_TXEMPTYIE_LENGTH            0x00000001

#define _C1FIFOINT31_TXHALFIE_POSITION           0x00000019
#define _C1FIFOINT31_TXHALFIE_MASK               0x02000000
#define _C1FIFOINT31_TXHALFIE_LENGTH             0x00000001

#define _C1FIFOINT31_TXNFULLIE_POSITION          0x0000001A
#define _C1FIFOINT31_TXNFULLIE_MASK              0x04000000
#define _C1FIFOINT31_TXNFULLIE_LENGTH            0x00000001

#define _C1FIFOINT31_w_POSITION                  0x00000000
#define _C1FIFOINT31_w_MASK                      0xFFFFFFFF
#define _C1FIFOINT31_w_LENGTH                    0x00000020

#define _C1FIFOCI31_CFIFOCI_POSITION             0x00000000
#define _C1FIFOCI31_CFIFOCI_MASK                 0x0000001F
#define _C1FIFOCI31_CFIFOCI_LENGTH               0x00000005

#define _C1FIFOCI31_w_POSITION                   0x00000000
#define _C1FIFOCI31_w_MASK                       0xFFFFFFFF
#define _C1FIFOCI31_w_LENGTH                     0x00000020

#define _C2CON_DNCNT_POSITION                    0x00000000
#define _C2CON_DNCNT_MASK                        0x0000001F
#define _C2CON_DNCNT_LENGTH                      0x00000005

#define _C2CON_CANBUSY_POSITION                  0x0000000B
#define _C2CON_CANBUSY_MASK                      0x00000800
#define _C2CON_CANBUSY_LENGTH                    0x00000001

#define _C2CON_SIDL_POSITION                     0x0000000D
#define _C2CON_SIDL_MASK                         0x00002000
#define _C2CON_SIDL_LENGTH                       0x00000001

#define _C2CON_ON_POSITION                       0x0000000F
#define _C2CON_ON_MASK                           0x00008000
#define _C2CON_ON_LENGTH                         0x00000001

#define _C2CON_CANCAP_POSITION                   0x00000014
#define _C2CON_CANCAP_MASK                       0x00100000
#define _C2CON_CANCAP_LENGTH                     0x00000001

#define _C2CON_OPMOD_POSITION                    0x00000015
#define _C2CON_OPMOD_MASK                        0x00E00000
#define _C2CON_OPMOD_LENGTH                      0x00000003

#define _C2CON_REQOP_POSITION                    0x00000018
#define _C2CON_REQOP_MASK                        0x07000000
#define _C2CON_REQOP_LENGTH                      0x00000003

#define _C2CON_ABAT_POSITION                     0x0000001B
#define _C2CON_ABAT_MASK                         0x08000000
#define _C2CON_ABAT_LENGTH                       0x00000001

#define _C2CON_w_POSITION                        0x00000000
#define _C2CON_w_MASK                            0xFFFFFFFF
#define _C2CON_w_LENGTH                          0x00000020

#define _C2CFG_BRP_POSITION                      0x00000000
#define _C2CFG_BRP_MASK                          0x0000003F
#define _C2CFG_BRP_LENGTH                        0x00000006

#define _C2CFG_SJW_POSITION                      0x00000006
#define _C2CFG_SJW_MASK                          0x000000C0
#define _C2CFG_SJW_LENGTH                        0x00000002

#define _C2CFG_PRSEG_POSITION                    0x00000008
#define _C2CFG_PRSEG_MASK                        0x00000700
#define _C2CFG_PRSEG_LENGTH                      0x00000003

#define _C2CFG_SEG1PH_POSITION                   0x0000000B
#define _C2CFG_SEG1PH_MASK                       0x00003800
#define _C2CFG_SEG1PH_LENGTH                     0x00000003

#define _C2CFG_SAM_POSITION                      0x0000000E
#define _C2CFG_SAM_MASK                          0x00004000
#define _C2CFG_SAM_LENGTH                        0x00000001

#define _C2CFG_SEG2PHTS_POSITION                 0x0000000F
#define _C2CFG_SEG2PHTS_MASK                     0x00008000
#define _C2CFG_SEG2PHTS_LENGTH                   0x00000001

#define _C2CFG_SEG2PH_POSITION                   0x00000010
#define _C2CFG_SEG2PH_MASK                       0x00070000
#define _C2CFG_SEG2PH_LENGTH                     0x00000003

#define _C2CFG_WAKFIL_POSITION                   0x00000016
#define _C2CFG_WAKFIL_MASK                       0x00400000
#define _C2CFG_WAKFIL_LENGTH                     0x00000001

#define _C2CFG_w_POSITION                        0x00000000
#define _C2CFG_w_MASK                            0xFFFFFFFF
#define _C2CFG_w_LENGTH                          0x00000020

#define _C2INT_TBIF_POSITION                     0x00000000
#define _C2INT_TBIF_MASK                         0x00000001
#define _C2INT_TBIF_LENGTH                       0x00000001

#define _C2INT_RBIF_POSITION                     0x00000001
#define _C2INT_RBIF_MASK                         0x00000002
#define _C2INT_RBIF_LENGTH                       0x00000001

#define _C2INT_CTMRIF_POSITION                   0x00000002
#define _C2INT_CTMRIF_MASK                       0x00000004
#define _C2INT_CTMRIF_LENGTH                     0x00000001

