HomuraVehicle/homuraLib_v2/machine/device/p32mx795f512h_forVC.c
#define _C2RXOVF_RXOVF11_POSITION                0x0000000B
#define _C2RXOVF_RXOVF11_MASK                    0x00000800
#define _C2RXOVF_RXOVF11_LENGTH                  0x00000001

#define _C2RXOVF_RXOVF12_POSITION                0x0000000C
#define _C2RXOVF_RXOVF12_MASK                    0x00001000
#define _C2RXOVF_RXOVF12_LENGTH                  0x00000001

#define _C2RXOVF_RXOVF13_POSITION                0x0000000D
#define _C2RXOVF_RXOVF13_MASK                    0x00002000
#define _C2RXOVF_RXOVF13_LENGTH                  0x00000001

#define _C2RXOVF_RXOVF14_POSITION                0x0000000E
#define _C2RXOVF_RXOVF14_MASK                    0x00004000
#define _C2RXOVF_RXOVF14_LENGTH                  0x00000001

#define _C2RXOVF_RXOVF15_POSITION                0x0000000F
#define _C2RXOVF_RXOVF15_MASK                    0x00008000
#define _C2RXOVF_RXOVF15_LENGTH                  0x00000001

#define _C2RXOVF_RXOVF16_POSITION                0x00000010
#define _C2RXOVF_RXOVF16_MASK                    0x00010000
#define _C2RXOVF_RXOVF16_LENGTH                  0x00000001

#define _C2RXOVF_RXOVF17_POSITION                0x00000011
#define _C2RXOVF_RXOVF17_MASK                    0x00020000
#define _C2RXOVF_RXOVF17_LENGTH                  0x00000001

#define _C2RXOVF_RXOVF18_POSITION                0x00000012
#define _C2RXOVF_RXOVF18_MASK                    0x00040000
#define _C2RXOVF_RXOVF18_LENGTH                  0x00000001

#define _C2RXOVF_RXOVF19_POSITION                0x00000013
#define _C2RXOVF_RXOVF19_MASK                    0x00080000
#define _C2RXOVF_RXOVF19_LENGTH                  0x00000001

#define _C2RXOVF_RXOVF20_POSITION                0x00000014
#define _C2RXOVF_RXOVF20_MASK                    0x00100000
#define _C2RXOVF_RXOVF20_LENGTH                  0x00000001

#define _C2RXOVF_RXOVF21_POSITION                0x00000015
#define _C2RXOVF_RXOVF21_MASK                    0x00200000
#define _C2RXOVF_RXOVF21_LENGTH                  0x00000001

#define _C2RXOVF_RXOVF22_POSITION                0x00000016
#define _C2RXOVF_RXOVF22_MASK                    0x00400000
#define _C2RXOVF_RXOVF22_LENGTH                  0x00000001

#define _C2RXOVF_RXOVF23_POSITION                0x00000017
#define _C2RXOVF_RXOVF23_MASK                    0x00800000
#define _C2RXOVF_RXOVF23_LENGTH                  0x00000001

#define _C2RXOVF_RXOVF24_POSITION                0x00000018
#define _C2RXOVF_RXOVF24_MASK                    0x01000000
#define _C2RXOVF_RXOVF24_LENGTH                  0x00000001

#define _C2RXOVF_RXOVF25_POSITION                0x00000019
#define _C2RXOVF_RXOVF25_MASK                    0x02000000
#define _C2RXOVF_RXOVF25_LENGTH                  0x00000001

#define _C2RXOVF_RXOVF26_POSITION                0x0000001A
#define _C2RXOVF_RXOVF26_MASK                    0x04000000
#define _C2RXOVF_RXOVF26_LENGTH                  0x00000001

#define _C2RXOVF_RXOVF27_POSITION                0x0000001B
#define _C2RXOVF_RXOVF27_MASK                    0x08000000
#define _C2RXOVF_RXOVF27_LENGTH                  0x00000001

#define _C2RXOVF_RXOVF28_POSITION                0x0000001C
#define _C2RXOVF_RXOVF28_MASK                    0x10000000
#define _C2RXOVF_RXOVF28_LENGTH                  0x00000001

#define _C2RXOVF_RXOVF29_POSITION                0x0000001D
#define _C2RXOVF_RXOVF29_MASK                    0x20000000
#define _C2RXOVF_RXOVF29_LENGTH                  0x00000001

#define _C2RXOVF_RXOVF30_POSITION                0x0000001E
#define _C2RXOVF_RXOVF30_MASK                    0x40000000
#define _C2RXOVF_RXOVF30_LENGTH                  0x00000001

#define _C2RXOVF_RXOVF31_POSITION                0x0000001F
#define _C2RXOVF_RXOVF31_MASK                    0x80000000
#define _C2RXOVF_RXOVF31_LENGTH                  0x00000001

#define _C2RXOVF_w_POSITION                      0x00000000
#define _C2RXOVF_w_MASK                          0xFFFFFFFF
#define _C2RXOVF_w_LENGTH                        0x00000020

#define _C2TMR_CANTSPRE_POSITION                 0x00000000
#define _C2TMR_CANTSPRE_MASK                     0x0000FFFF
#define _C2TMR_CANTSPRE_LENGTH                   0x00000010

#define _C2TMR_CANTS_POSITION                    0x00000010
#define _C2TMR_CANTS_MASK                        0xFFFF0000
#define _C2TMR_CANTS_LENGTH                      0x00000010

#define _C2TMR_w_POSITION                        0x00000000
#define _C2TMR_w_MASK                            0xFFFFFFFF
#define _C2TMR_w_LENGTH                          0x00000020

#define _C2RXM0_EID_POSITION                     0x00000000
#define _C2RXM0_EID_MASK                         0x0003FFFF
#define _C2RXM0_EID_LENGTH                       0x00000012

#define _C2RXM0_MIDE_POSITION                    0x00000013
#define _C2RXM0_MIDE_MASK                        0x00080000
#define _C2RXM0_MIDE_LENGTH                      0x00000001

#define _C2RXM0_SID_POSITION                     0x00000015
#define _C2RXM0_SID_MASK                         0xFFE00000
#define _C2RXM0_SID_LENGTH                       0x0000000B

#define _C2RXM0_w_POSITION                       0x00000000
#define _C2RXM0_w_MASK                           0xFFFFFFFF
#define _C2RXM0_w_LENGTH                         0x00000020

#define _C2RXM1_EID_POSITION                     0x00000000
#define _C2RXM1_EID_MASK                         0x0003FFFF
#define _C2RXM1_EID_LENGTH                       0x00000012

#define _C2RXM1_MIDE_POSITION                    0x00000013
#define _C2RXM1_MIDE_MASK                        0x00080000
#define _C2RXM1_MIDE_LENGTH                      0x00000001

#define _C2RXM1_SID_POSITION                     0x00000015
#define _C2RXM1_SID_MASK                         0xFFE00000
#define _C2RXM1_SID_LENGTH                       0x0000000B

#define _C2RXM1_w_POSITION                       0x00000000
#define _C2RXM1_w_MASK                           0xFFFFFFFF
#define _C2RXM1_w_LENGTH                         0x00000020

#define _C2RXM2_EID_POSITION                     0x00000000
#define _C2RXM2_EID_MASK                         0x0003FFFF
#define _C2RXM2_EID_LENGTH                       0x00000012

#define _C2RXM2_MIDE_POSITION                    0x00000013
#define _C2RXM2_MIDE_MASK                        0x00080000
#define _C2RXM2_MIDE_LENGTH                      0x00000001

#define _C2RXM2_SID_POSITION                     0x00000015
#define _C2RXM2_SID_MASK                         0xFFE00000
#define _C2RXM2_SID_LENGTH                       0x0000000B

#define _C2RXM2_w_POSITION                       0x00000000
#define _C2RXM2_w_MASK                           0xFFFFFFFF
#define _C2RXM2_w_LENGTH                         0x00000020

#define _C2RXM3_EID_POSITION                     0x00000000
#define _C2RXM3_EID_MASK                         0x0003FFFF
#define _C2RXM3_EID_LENGTH                       0x00000012

#define _C2RXM3_MIDE_POSITION                    0x00000013
#define _C2RXM3_MIDE_MASK                        0x00080000
#define _C2RXM3_MIDE_LENGTH                      0x00000001

#define _C2RXM3_SID_POSITION                     0x00000015
#define _C2RXM3_SID_MASK                         0xFFE00000
#define _C2RXM3_SID_LENGTH                       0x0000000B

#define _C2RXM3_w_POSITION                       0x00000000
#define _C2RXM3_w_MASK                           0xFFFFFFFF
#define _C2RXM3_w_LENGTH                         0x00000020

#define _C2FLTCON0_FSEL0_POSITION                0x00000000
#define _C2FLTCON0_FSEL0_MASK                    0x0000001F
#define _C2FLTCON0_FSEL0_LENGTH                  0x00000005

#define _C2FLTCON0_MSEL0_POSITION                0x00000005
#define _C2FLTCON0_MSEL0_MASK                    0x00000060
#define _C2FLTCON0_MSEL0_LENGTH                  0x00000002

#define _C2FLTCON0_FLTEN0_POSITION               0x00000007
#define _C2FLTCON0_FLTEN0_MASK                   0x00000080
#define _C2FLTCON0_FLTEN0_LENGTH                 0x00000001

#define _C2FLTCON0_FSEL1_POSITION                0x00000008
#define _C2FLTCON0_FSEL1_MASK                    0x00001F00
#define _C2FLTCON0_FSEL1_LENGTH                  0x00000005

#define _C2FLTCON0_MSEL1_POSITION                0x0000000D
#define _C2FLTCON0_MSEL1_MASK                    0x00006000
#define _C2FLTCON0_MSEL1_LENGTH                  0x00000002

