HomuraVehicle/homuraLib_v2/machine/device/p32mx795f512h_forVC.c
#define _C2FLTCON6_FLTEN24_POSITION              0x00000007
#define _C2FLTCON6_FLTEN24_MASK                  0x00000080
#define _C2FLTCON6_FLTEN24_LENGTH                0x00000001

#define _C2FLTCON6_FSEL25_POSITION               0x00000008
#define _C2FLTCON6_FSEL25_MASK                   0x00001F00
#define _C2FLTCON6_FSEL25_LENGTH                 0x00000005

#define _C2FLTCON6_MSEL25_POSITION               0x0000000D
#define _C2FLTCON6_MSEL25_MASK                   0x00006000
#define _C2FLTCON6_MSEL25_LENGTH                 0x00000002

#define _C2FLTCON6_FLTEN25_POSITION              0x0000000F
#define _C2FLTCON6_FLTEN25_MASK                  0x00008000
#define _C2FLTCON6_FLTEN25_LENGTH                0x00000001

#define _C2FLTCON6_FSEL26_POSITION               0x00000010
#define _C2FLTCON6_FSEL26_MASK                   0x001F0000
#define _C2FLTCON6_FSEL26_LENGTH                 0x00000005

#define _C2FLTCON6_MSEL26_POSITION               0x00000015
#define _C2FLTCON6_MSEL26_MASK                   0x00600000
#define _C2FLTCON6_MSEL26_LENGTH                 0x00000002

#define _C2FLTCON6_FLTEN26_POSITION              0x00000017
#define _C2FLTCON6_FLTEN26_MASK                  0x00800000
#define _C2FLTCON6_FLTEN26_LENGTH                0x00000001

#define _C2FLTCON6_FSEL27_POSITION               0x00000018
#define _C2FLTCON6_FSEL27_MASK                   0x1F000000
#define _C2FLTCON6_FSEL27_LENGTH                 0x00000005

#define _C2FLTCON6_MSEL27_POSITION               0x0000001D
#define _C2FLTCON6_MSEL27_MASK                   0x60000000
#define _C2FLTCON6_MSEL27_LENGTH                 0x00000002

#define _C2FLTCON6_FLTEN27_POSITION              0x0000001F
#define _C2FLTCON6_FLTEN27_MASK                  0x80000000
#define _C2FLTCON6_FLTEN27_LENGTH                0x00000001

#define _C2FLTCON6_w_POSITION                    0x00000000
#define _C2FLTCON6_w_MASK                        0xFFFFFFFF
#define _C2FLTCON6_w_LENGTH                      0x00000020

#define _C2FLTCON7_FSEL28_POSITION               0x00000000
#define _C2FLTCON7_FSEL28_MASK                   0x0000001F
#define _C2FLTCON7_FSEL28_LENGTH                 0x00000005

#define _C2FLTCON7_MSEL28_POSITION               0x00000005
#define _C2FLTCON7_MSEL28_MASK                   0x00000060
#define _C2FLTCON7_MSEL28_LENGTH                 0x00000002

#define _C2FLTCON7_FLTEN28_POSITION              0x00000007
#define _C2FLTCON7_FLTEN28_MASK                  0x00000080
#define _C2FLTCON7_FLTEN28_LENGTH                0x00000001

#define _C2FLTCON7_FSEL29_POSITION               0x00000008
#define _C2FLTCON7_FSEL29_MASK                   0x00001F00
#define _C2FLTCON7_FSEL29_LENGTH                 0x00000005

#define _C2FLTCON7_MSEL29_POSITION               0x0000000D
#define _C2FLTCON7_MSEL29_MASK                   0x00006000
#define _C2FLTCON7_MSEL29_LENGTH                 0x00000002

#define _C2FLTCON7_FLTEN29_POSITION              0x0000000F
#define _C2FLTCON7_FLTEN29_MASK                  0x00008000
#define _C2FLTCON7_FLTEN29_LENGTH                0x00000001

#define _C2FLTCON7_FSEL30_POSITION               0x00000010
#define _C2FLTCON7_FSEL30_MASK                   0x001F0000
#define _C2FLTCON7_FSEL30_LENGTH                 0x00000005

#define _C2FLTCON7_MSEL30_POSITION               0x00000015
#define _C2FLTCON7_MSEL30_MASK                   0x00600000
#define _C2FLTCON7_MSEL30_LENGTH                 0x00000002

#define _C2FLTCON7_FLTEN30_POSITION              0x00000017
#define _C2FLTCON7_FLTEN30_MASK                  0x00800000
#define _C2FLTCON7_FLTEN30_LENGTH                0x00000001

#define _C2FLTCON7_FSEL31_POSITION               0x00000018
#define _C2FLTCON7_FSEL31_MASK                   0x1F000000
#define _C2FLTCON7_FSEL31_LENGTH                 0x00000005

#define _C2FLTCON7_MSEL31_POSITION               0x0000001D
#define _C2FLTCON7_MSEL31_MASK                   0x60000000
#define _C2FLTCON7_MSEL31_LENGTH                 0x00000002

#define _C2FLTCON7_FLTEN31_POSITION              0x0000001F
#define _C2FLTCON7_FLTEN31_MASK                  0x80000000
#define _C2FLTCON7_FLTEN31_LENGTH                0x00000001

#define _C2FLTCON7_w_POSITION                    0x00000000
#define _C2FLTCON7_w_MASK                        0xFFFFFFFF
#define _C2FLTCON7_w_LENGTH                      0x00000020

#define _C2RXF0_EID_POSITION                     0x00000000
#define _C2RXF0_EID_MASK                         0x0003FFFF
#define _C2RXF0_EID_LENGTH                       0x00000012

#define _C2RXF0_EXID_POSITION                    0x00000013
#define _C2RXF0_EXID_MASK                        0x00080000
#define _C2RXF0_EXID_LENGTH                      0x00000001

#define _C2RXF0_SID_POSITION                     0x00000015
#define _C2RXF0_SID_MASK                         0xFFE00000
#define _C2RXF0_SID_LENGTH                       0x0000000B

#define _C2RXF0_w_POSITION                       0x00000000
#define _C2RXF0_w_MASK                           0xFFFFFFFF
#define _C2RXF0_w_LENGTH                         0x00000020

#define _C2RXF1_EID_POSITION                     0x00000000
#define _C2RXF1_EID_MASK                         0x0003FFFF
#define _C2RXF1_EID_LENGTH                       0x00000012

#define _C2RXF1_EXID_POSITION                    0x00000013
#define _C2RXF1_EXID_MASK                        0x00080000
#define _C2RXF1_EXID_LENGTH                      0x00000001

#define _C2RXF1_SID_POSITION                     0x00000015
#define _C2RXF1_SID_MASK                         0xFFE00000
#define _C2RXF1_SID_LENGTH                       0x0000000B

#define _C2RXF1_w_POSITION                       0x00000000
#define _C2RXF1_w_MASK                           0xFFFFFFFF
#define _C2RXF1_w_LENGTH                         0x00000020

#define _C2RXF2_EID_POSITION                     0x00000000
#define _C2RXF2_EID_MASK                         0x0003FFFF
#define _C2RXF2_EID_LENGTH                       0x00000012

#define _C2RXF2_EXID_POSITION                    0x00000013
#define _C2RXF2_EXID_MASK                        0x00080000
#define _C2RXF2_EXID_LENGTH                      0x00000001

#define _C2RXF2_SID_POSITION                     0x00000015
#define _C2RXF2_SID_MASK                         0xFFE00000
#define _C2RXF2_SID_LENGTH                       0x0000000B

#define _C2RXF2_w_POSITION                       0x00000000
#define _C2RXF2_w_MASK                           0xFFFFFFFF
#define _C2RXF2_w_LENGTH                         0x00000020

#define _C2RXF3_EID_POSITION                     0x00000000
#define _C2RXF3_EID_MASK                         0x0003FFFF
#define _C2RXF3_EID_LENGTH                       0x00000012

#define _C2RXF3_EXID_POSITION                    0x00000013
#define _C2RXF3_EXID_MASK                        0x00080000
#define _C2RXF3_EXID_LENGTH                      0x00000001

#define _C2RXF3_SID_POSITION                     0x00000015
#define _C2RXF3_SID_MASK                         0xFFE00000
#define _C2RXF3_SID_LENGTH                       0x0000000B

#define _C2RXF3_w_POSITION                       0x00000000
#define _C2RXF3_w_MASK                           0xFFFFFFFF
#define _C2RXF3_w_LENGTH                         0x00000020

