HomuraVehicle/homuraLib_v2/machine/device/p32mx795f512h_forVC.c
#define _C2FIFOINT3_RXNEMPTYIE_POSITION          0x00000010
#define _C2FIFOINT3_RXNEMPTYIE_MASK              0x00010000
#define _C2FIFOINT3_RXNEMPTYIE_LENGTH            0x00000001

#define _C2FIFOINT3_RXHALFIE_POSITION            0x00000011
#define _C2FIFOINT3_RXHALFIE_MASK                0x00020000
#define _C2FIFOINT3_RXHALFIE_LENGTH              0x00000001

#define _C2FIFOINT3_RXFULLIE_POSITION            0x00000012
#define _C2FIFOINT3_RXFULLIE_MASK                0x00040000
#define _C2FIFOINT3_RXFULLIE_LENGTH              0x00000001

#define _C2FIFOINT3_RXOVFLIE_POSITION            0x00000013
#define _C2FIFOINT3_RXOVFLIE_MASK                0x00080000
#define _C2FIFOINT3_RXOVFLIE_LENGTH              0x00000001

#define _C2FIFOINT3_TXEMPTYIE_POSITION           0x00000018
#define _C2FIFOINT3_TXEMPTYIE_MASK               0x01000000
#define _C2FIFOINT3_TXEMPTYIE_LENGTH             0x00000001

#define _C2FIFOINT3_TXHALFIE_POSITION            0x00000019
#define _C2FIFOINT3_TXHALFIE_MASK                0x02000000
#define _C2FIFOINT3_TXHALFIE_LENGTH              0x00000001

#define _C2FIFOINT3_TXNFULLIE_POSITION           0x0000001A
#define _C2FIFOINT3_TXNFULLIE_MASK               0x04000000
#define _C2FIFOINT3_TXNFULLIE_LENGTH             0x00000001

#define _C2FIFOINT3_w_POSITION                   0x00000000
#define _C2FIFOINT3_w_MASK                       0xFFFFFFFF
#define _C2FIFOINT3_w_LENGTH                     0x00000020

#define _C2FIFOCI3_CFIFOCI_POSITION              0x00000000
#define _C2FIFOCI3_CFIFOCI_MASK                  0x0000001F
#define _C2FIFOCI3_CFIFOCI_LENGTH                0x00000005

#define _C2FIFOCI3_w_POSITION                    0x00000000
#define _C2FIFOCI3_w_MASK                        0xFFFFFFFF
#define _C2FIFOCI3_w_LENGTH                      0x00000020

#define _C2FIFOCON4_TXPRI_POSITION               0x00000000
#define _C2FIFOCON4_TXPRI_MASK                   0x00000003
#define _C2FIFOCON4_TXPRI_LENGTH                 0x00000002

#define _C2FIFOCON4_RTREN_POSITION               0x00000002
#define _C2FIFOCON4_RTREN_MASK                   0x00000004
#define _C2FIFOCON4_RTREN_LENGTH                 0x00000001

#define _C2FIFOCON4_TXREQ_POSITION               0x00000003
#define _C2FIFOCON4_TXREQ_MASK                   0x00000008
#define _C2FIFOCON4_TXREQ_LENGTH                 0x00000001

#define _C2FIFOCON4_TXERR_POSITION               0x00000004
#define _C2FIFOCON4_TXERR_MASK                   0x00000010
#define _C2FIFOCON4_TXERR_LENGTH                 0x00000001

#define _C2FIFOCON4_TXLARB_POSITION              0x00000005
#define _C2FIFOCON4_TXLARB_MASK                  0x00000020
#define _C2FIFOCON4_TXLARB_LENGTH                0x00000001

#define _C2FIFOCON4_TXABAT_POSITION              0x00000006
#define _C2FIFOCON4_TXABAT_MASK                  0x00000040
#define _C2FIFOCON4_TXABAT_LENGTH                0x00000001

#define _C2FIFOCON4_TXEN_POSITION                0x00000007
#define _C2FIFOCON4_TXEN_MASK                    0x00000080
#define _C2FIFOCON4_TXEN_LENGTH                  0x00000001

#define _C2FIFOCON4_DONLY_POSITION               0x0000000C
#define _C2FIFOCON4_DONLY_MASK                   0x00001000
#define _C2FIFOCON4_DONLY_LENGTH                 0x00000001

#define _C2FIFOCON4_UINC_POSITION                0x0000000D
#define _C2FIFOCON4_UINC_MASK                    0x00002000
#define _C2FIFOCON4_UINC_LENGTH                  0x00000001

#define _C2FIFOCON4_FRESET_POSITION              0x0000000E
#define _C2FIFOCON4_FRESET_MASK                  0x00004000
#define _C2FIFOCON4_FRESET_LENGTH                0x00000001

#define _C2FIFOCON4_FSIZE_POSITION               0x00000010
#define _C2FIFOCON4_FSIZE_MASK                   0x001F0000
#define _C2FIFOCON4_FSIZE_LENGTH                 0x00000005

#define _C2FIFOCON4_w_POSITION                   0x00000000
#define _C2FIFOCON4_w_MASK                       0xFFFFFFFF
#define _C2FIFOCON4_w_LENGTH                     0x00000020

#define _C2FIFOINT4_RXNEMPTYIF_POSITION          0x00000000
#define _C2FIFOINT4_RXNEMPTYIF_MASK              0x00000001
#define _C2FIFOINT4_RXNEMPTYIF_LENGTH            0x00000001

#define _C2FIFOINT4_RXHALFIF_POSITION            0x00000001
#define _C2FIFOINT4_RXHALFIF_MASK                0x00000002
#define _C2FIFOINT4_RXHALFIF_LENGTH              0x00000001

#define _C2FIFOINT4_RXFULLIF_POSITION            0x00000002
#define _C2FIFOINT4_RXFULLIF_MASK                0x00000004
#define _C2FIFOINT4_RXFULLIF_LENGTH              0x00000001

#define _C2FIFOINT4_RXOVFLIF_POSITION            0x00000003
#define _C2FIFOINT4_RXOVFLIF_MASK                0x00000008
#define _C2FIFOINT4_RXOVFLIF_LENGTH              0x00000001

#define _C2FIFOINT4_TXEMPTYIF_POSITION           0x00000008
#define _C2FIFOINT4_TXEMPTYIF_MASK               0x00000100
#define _C2FIFOINT4_TXEMPTYIF_LENGTH             0x00000001

#define _C2FIFOINT4_TXHALFIF_POSITION            0x00000009
#define _C2FIFOINT4_TXHALFIF_MASK                0x00000200
#define _C2FIFOINT4_TXHALFIF_LENGTH              0x00000001

#define _C2FIFOINT4_TXNFULLIF_POSITION           0x0000000A
#define _C2FIFOINT4_TXNFULLIF_MASK               0x00000400
#define _C2FIFOINT4_TXNFULLIF_LENGTH             0x00000001

#define _C2FIFOINT4_RXNEMPTYIE_POSITION          0x00000010
#define _C2FIFOINT4_RXNEMPTYIE_MASK              0x00010000
#define _C2FIFOINT4_RXNEMPTYIE_LENGTH            0x00000001

#define _C2FIFOINT4_RXHALFIE_POSITION            0x00000011
#define _C2FIFOINT4_RXHALFIE_MASK                0x00020000
#define _C2FIFOINT4_RXHALFIE_LENGTH              0x00000001

#define _C2FIFOINT4_RXFULLIE_POSITION            0x00000012
#define _C2FIFOINT4_RXFULLIE_MASK                0x00040000
#define _C2FIFOINT4_RXFULLIE_LENGTH              0x00000001

#define _C2FIFOINT4_RXOVFLIE_POSITION            0x00000013
#define _C2FIFOINT4_RXOVFLIE_MASK                0x00080000
#define _C2FIFOINT4_RXOVFLIE_LENGTH              0x00000001

#define _C2FIFOINT4_TXEMPTYIE_POSITION           0x00000018
#define _C2FIFOINT4_TXEMPTYIE_MASK               0x01000000
#define _C2FIFOINT4_TXEMPTYIE_LENGTH             0x00000001

#define _C2FIFOINT4_TXHALFIE_POSITION            0x00000019
#define _C2FIFOINT4_TXHALFIE_MASK                0x02000000
#define _C2FIFOINT4_TXHALFIE_LENGTH              0x00000001

#define _C2FIFOINT4_TXNFULLIE_POSITION           0x0000001A
#define _C2FIFOINT4_TXNFULLIE_MASK               0x04000000
#define _C2FIFOINT4_TXNFULLIE_LENGTH             0x00000001

#define _C2FIFOINT4_w_POSITION                   0x00000000
#define _C2FIFOINT4_w_MASK                       0xFFFFFFFF
#define _C2FIFOINT4_w_LENGTH                     0x00000020

#define _C2FIFOCI4_CFIFOCI_POSITION              0x00000000
#define _C2FIFOCI4_CFIFOCI_MASK                  0x0000001F
#define _C2FIFOCI4_CFIFOCI_LENGTH                0x00000005

