HomuraVehicle/homuraLib_v2/machine/device/p32mx795f512h_forVC.c
#define _C2FIFOCON16_TXLARB_POSITION             0x00000005
#define _C2FIFOCON16_TXLARB_MASK                 0x00000020
#define _C2FIFOCON16_TXLARB_LENGTH               0x00000001

#define _C2FIFOCON16_TXABAT_POSITION             0x00000006
#define _C2FIFOCON16_TXABAT_MASK                 0x00000040
#define _C2FIFOCON16_TXABAT_LENGTH               0x00000001

#define _C2FIFOCON16_TXEN_POSITION               0x00000007
#define _C2FIFOCON16_TXEN_MASK                   0x00000080
#define _C2FIFOCON16_TXEN_LENGTH                 0x00000001

#define _C2FIFOCON16_DONLY_POSITION              0x0000000C
#define _C2FIFOCON16_DONLY_MASK                  0x00001000
#define _C2FIFOCON16_DONLY_LENGTH                0x00000001

#define _C2FIFOCON16_UINC_POSITION               0x0000000D
#define _C2FIFOCON16_UINC_MASK                   0x00002000
#define _C2FIFOCON16_UINC_LENGTH                 0x00000001

#define _C2FIFOCON16_FRESET_POSITION             0x0000000E
#define _C2FIFOCON16_FRESET_MASK                 0x00004000
#define _C2FIFOCON16_FRESET_LENGTH               0x00000001

#define _C2FIFOCON16_FSIZE_POSITION              0x00000010
#define _C2FIFOCON16_FSIZE_MASK                  0x001F0000
#define _C2FIFOCON16_FSIZE_LENGTH                0x00000005

#define _C2FIFOCON16_w_POSITION                  0x00000000
#define _C2FIFOCON16_w_MASK                      0xFFFFFFFF
#define _C2FIFOCON16_w_LENGTH                    0x00000020

#define _C2FIFOINT16_RXNEMPTYIF_POSITION         0x00000000
#define _C2FIFOINT16_RXNEMPTYIF_MASK             0x00000001
#define _C2FIFOINT16_RXNEMPTYIF_LENGTH           0x00000001

#define _C2FIFOINT16_RXHALFIF_POSITION           0x00000001
#define _C2FIFOINT16_RXHALFIF_MASK               0x00000002
#define _C2FIFOINT16_RXHALFIF_LENGTH             0x00000001

#define _C2FIFOINT16_RXFULLIF_POSITION           0x00000002
#define _C2FIFOINT16_RXFULLIF_MASK               0x00000004
#define _C2FIFOINT16_RXFULLIF_LENGTH             0x00000001

#define _C2FIFOINT16_RXOVFLIF_POSITION           0x00000003
#define _C2FIFOINT16_RXOVFLIF_MASK               0x00000008
#define _C2FIFOINT16_RXOVFLIF_LENGTH             0x00000001

#define _C2FIFOINT16_TXEMPTYIF_POSITION          0x00000008
#define _C2FIFOINT16_TXEMPTYIF_MASK              0x00000100
#define _C2FIFOINT16_TXEMPTYIF_LENGTH            0x00000001

#define _C2FIFOINT16_TXHALFIF_POSITION           0x00000009
#define _C2FIFOINT16_TXHALFIF_MASK               0x00000200
#define _C2FIFOINT16_TXHALFIF_LENGTH             0x00000001

#define _C2FIFOINT16_TXNFULLIF_POSITION          0x0000000A
#define _C2FIFOINT16_TXNFULLIF_MASK              0x00000400
#define _C2FIFOINT16_TXNFULLIF_LENGTH            0x00000001

#define _C2FIFOINT16_RXNEMPTYIE_POSITION         0x00000010
#define _C2FIFOINT16_RXNEMPTYIE_MASK             0x00010000
#define _C2FIFOINT16_RXNEMPTYIE_LENGTH           0x00000001

#define _C2FIFOINT16_RXHALFIE_POSITION           0x00000011
#define _C2FIFOINT16_RXHALFIE_MASK               0x00020000
#define _C2FIFOINT16_RXHALFIE_LENGTH             0x00000001

#define _C2FIFOINT16_RXFULLIE_POSITION           0x00000012
#define _C2FIFOINT16_RXFULLIE_MASK               0x00040000
#define _C2FIFOINT16_RXFULLIE_LENGTH             0x00000001

#define _C2FIFOINT16_RXOVFLIE_POSITION           0x00000013
#define _C2FIFOINT16_RXOVFLIE_MASK               0x00080000
#define _C2FIFOINT16_RXOVFLIE_LENGTH             0x00000001

#define _C2FIFOINT16_TXEMPTYIE_POSITION          0x00000018
#define _C2FIFOINT16_TXEMPTYIE_MASK              0x01000000
#define _C2FIFOINT16_TXEMPTYIE_LENGTH            0x00000001

#define _C2FIFOINT16_TXHALFIE_POSITION           0x00000019
#define _C2FIFOINT16_TXHALFIE_MASK               0x02000000
#define _C2FIFOINT16_TXHALFIE_LENGTH             0x00000001

#define _C2FIFOINT16_TXNFULLIE_POSITION          0x0000001A
#define _C2FIFOINT16_TXNFULLIE_MASK              0x04000000
#define _C2FIFOINT16_TXNFULLIE_LENGTH            0x00000001

#define _C2FIFOINT16_w_POSITION                  0x00000000
#define _C2FIFOINT16_w_MASK                      0xFFFFFFFF
#define _C2FIFOINT16_w_LENGTH                    0x00000020

#define _C2FIFOCI16_CFIFOCI_POSITION             0x00000000
#define _C2FIFOCI16_CFIFOCI_MASK                 0x0000001F
#define _C2FIFOCI16_CFIFOCI_LENGTH               0x00000005

#define _C2FIFOCI16_w_POSITION                   0x00000000
#define _C2FIFOCI16_w_MASK                       0xFFFFFFFF
#define _C2FIFOCI16_w_LENGTH                     0x00000020

#define _C2FIFOCON17_TXPRI_POSITION              0x00000000
#define _C2FIFOCON17_TXPRI_MASK                  0x00000003
#define _C2FIFOCON17_TXPRI_LENGTH                0x00000002

#define _C2FIFOCON17_RTREN_POSITION              0x00000002
#define _C2FIFOCON17_RTREN_MASK                  0x00000004
#define _C2FIFOCON17_RTREN_LENGTH                0x00000001

#define _C2FIFOCON17_TXREQ_POSITION              0x00000003
#define _C2FIFOCON17_TXREQ_MASK                  0x00000008
#define _C2FIFOCON17_TXREQ_LENGTH                0x00000001

#define _C2FIFOCON17_TXERR_POSITION              0x00000004
#define _C2FIFOCON17_TXERR_MASK                  0x00000010
#define _C2FIFOCON17_TXERR_LENGTH                0x00000001

#define _C2FIFOCON17_TXLARB_POSITION             0x00000005
#define _C2FIFOCON17_TXLARB_MASK                 0x00000020
#define _C2FIFOCON17_TXLARB_LENGTH               0x00000001

#define _C2FIFOCON17_TXABAT_POSITION             0x00000006
#define _C2FIFOCON17_TXABAT_MASK                 0x00000040
#define _C2FIFOCON17_TXABAT_LENGTH               0x00000001

#define _C2FIFOCON17_TXEN_POSITION               0x00000007
#define _C2FIFOCON17_TXEN_MASK                   0x00000080
#define _C2FIFOCON17_TXEN_LENGTH                 0x00000001

#define _C2FIFOCON17_DONLY_POSITION              0x0000000C
#define _C2FIFOCON17_DONLY_MASK                  0x00001000
#define _C2FIFOCON17_DONLY_LENGTH                0x00000001

#define _C2FIFOCON17_UINC_POSITION               0x0000000D
#define _C2FIFOCON17_UINC_MASK                   0x00002000
#define _C2FIFOCON17_UINC_LENGTH                 0x00000001

#define _C2FIFOCON17_FRESET_POSITION             0x0000000E
#define _C2FIFOCON17_FRESET_MASK                 0x00004000
#define _C2FIFOCON17_FRESET_LENGTH               0x00000001

#define _C2FIFOCON17_FSIZE_POSITION              0x00000010
#define _C2FIFOCON17_FSIZE_MASK                  0x001F0000
#define _C2FIFOCON17_FSIZE_LENGTH                0x00000005

#define _C2FIFOCON17_w_POSITION                  0x00000000
#define _C2FIFOCON17_w_MASK                      0xFFFFFFFF
#define _C2FIFOCON17_w_LENGTH                    0x00000020

#define _C2FIFOINT17_RXNEMPTYIF_POSITION         0x00000000
#define _C2FIFOINT17_RXNEMPTYIF_MASK             0x00000001
#define _C2FIFOINT17_RXNEMPTYIF_LENGTH           0x00000001

