HomuraVehicle/homuraLib_v2/machine/device/p32mx795f512h_forVC.c
#define _C2FIFOCON27_w_POSITION                  0x00000000
#define _C2FIFOCON27_w_MASK                      0xFFFFFFFF
#define _C2FIFOCON27_w_LENGTH                    0x00000020

#define _C2FIFOINT27_RXNEMPTYIF_POSITION         0x00000000
#define _C2FIFOINT27_RXNEMPTYIF_MASK             0x00000001
#define _C2FIFOINT27_RXNEMPTYIF_LENGTH           0x00000001

#define _C2FIFOINT27_RXHALFIF_POSITION           0x00000001
#define _C2FIFOINT27_RXHALFIF_MASK               0x00000002
#define _C2FIFOINT27_RXHALFIF_LENGTH             0x00000001

#define _C2FIFOINT27_RXFULLIF_POSITION           0x00000002
#define _C2FIFOINT27_RXFULLIF_MASK               0x00000004
#define _C2FIFOINT27_RXFULLIF_LENGTH             0x00000001

#define _C2FIFOINT27_RXOVFLIF_POSITION           0x00000003
#define _C2FIFOINT27_RXOVFLIF_MASK               0x00000008
#define _C2FIFOINT27_RXOVFLIF_LENGTH             0x00000001

#define _C2FIFOINT27_TXEMPTYIF_POSITION          0x00000008
#define _C2FIFOINT27_TXEMPTYIF_MASK              0x00000100
#define _C2FIFOINT27_TXEMPTYIF_LENGTH            0x00000001

#define _C2FIFOINT27_TXHALFIF_POSITION           0x00000009
#define _C2FIFOINT27_TXHALFIF_MASK               0x00000200
#define _C2FIFOINT27_TXHALFIF_LENGTH             0x00000001

#define _C2FIFOINT27_TXNFULLIF_POSITION          0x0000000A
#define _C2FIFOINT27_TXNFULLIF_MASK              0x00000400
#define _C2FIFOINT27_TXNFULLIF_LENGTH            0x00000001

#define _C2FIFOINT27_RXNEMPTYIE_POSITION         0x00000010
#define _C2FIFOINT27_RXNEMPTYIE_MASK             0x00010000
#define _C2FIFOINT27_RXNEMPTYIE_LENGTH           0x00000001

#define _C2FIFOINT27_RXHALFIE_POSITION           0x00000011
#define _C2FIFOINT27_RXHALFIE_MASK               0x00020000
#define _C2FIFOINT27_RXHALFIE_LENGTH             0x00000001

#define _C2FIFOINT27_RXFULLIE_POSITION           0x00000012
#define _C2FIFOINT27_RXFULLIE_MASK               0x00040000
#define _C2FIFOINT27_RXFULLIE_LENGTH             0x00000001

#define _C2FIFOINT27_RXOVFLIE_POSITION           0x00000013
#define _C2FIFOINT27_RXOVFLIE_MASK               0x00080000
#define _C2FIFOINT27_RXOVFLIE_LENGTH             0x00000001

#define _C2FIFOINT27_TXEMPTYIE_POSITION          0x00000018
#define _C2FIFOINT27_TXEMPTYIE_MASK              0x01000000
#define _C2FIFOINT27_TXEMPTYIE_LENGTH            0x00000001

#define _C2FIFOINT27_TXHALFIE_POSITION           0x00000019
#define _C2FIFOINT27_TXHALFIE_MASK               0x02000000
#define _C2FIFOINT27_TXHALFIE_LENGTH             0x00000001

#define _C2FIFOINT27_TXNFULLIE_POSITION          0x0000001A
#define _C2FIFOINT27_TXNFULLIE_MASK              0x04000000
#define _C2FIFOINT27_TXNFULLIE_LENGTH            0x00000001

#define _C2FIFOINT27_w_POSITION                  0x00000000
#define _C2FIFOINT27_w_MASK                      0xFFFFFFFF
#define _C2FIFOINT27_w_LENGTH                    0x00000020

#define _C2FIFOCI27_CFIFOCI_POSITION             0x00000000
#define _C2FIFOCI27_CFIFOCI_MASK                 0x0000001F
#define _C2FIFOCI27_CFIFOCI_LENGTH               0x00000005

#define _C2FIFOCI27_w_POSITION                   0x00000000
#define _C2FIFOCI27_w_MASK                       0xFFFFFFFF
#define _C2FIFOCI27_w_LENGTH                     0x00000020

#define _C2FIFOCON28_TXPRI_POSITION              0x00000000
#define _C2FIFOCON28_TXPRI_MASK                  0x00000003
#define _C2FIFOCON28_TXPRI_LENGTH                0x00000002

#define _C2FIFOCON28_RTREN_POSITION              0x00000002
#define _C2FIFOCON28_RTREN_MASK                  0x00000004
#define _C2FIFOCON28_RTREN_LENGTH                0x00000001

#define _C2FIFOCON28_TXREQ_POSITION              0x00000003
#define _C2FIFOCON28_TXREQ_MASK                  0x00000008
#define _C2FIFOCON28_TXREQ_LENGTH                0x00000001

#define _C2FIFOCON28_TXERR_POSITION              0x00000004
#define _C2FIFOCON28_TXERR_MASK                  0x00000010
#define _C2FIFOCON28_TXERR_LENGTH                0x00000001

#define _C2FIFOCON28_TXLARB_POSITION             0x00000005
#define _C2FIFOCON28_TXLARB_MASK                 0x00000020
#define _C2FIFOCON28_TXLARB_LENGTH               0x00000001

#define _C2FIFOCON28_TXABAT_POSITION             0x00000006
#define _C2FIFOCON28_TXABAT_MASK                 0x00000040
#define _C2FIFOCON28_TXABAT_LENGTH               0x00000001

#define _C2FIFOCON28_TXEN_POSITION               0x00000007
#define _C2FIFOCON28_TXEN_MASK                   0x00000080
#define _C2FIFOCON28_TXEN_LENGTH                 0x00000001

#define _C2FIFOCON28_DONLY_POSITION              0x0000000C
#define _C2FIFOCON28_DONLY_MASK                  0x00001000
#define _C2FIFOCON28_DONLY_LENGTH                0x00000001

#define _C2FIFOCON28_UINC_POSITION               0x0000000D
#define _C2FIFOCON28_UINC_MASK                   0x00002000
#define _C2FIFOCON28_UINC_LENGTH                 0x00000001

#define _C2FIFOCON28_FRESET_POSITION             0x0000000E
#define _C2FIFOCON28_FRESET_MASK                 0x00004000
#define _C2FIFOCON28_FRESET_LENGTH               0x00000001

#define _C2FIFOCON28_FSIZE_POSITION              0x00000010
#define _C2FIFOCON28_FSIZE_MASK                  0x001F0000
#define _C2FIFOCON28_FSIZE_LENGTH                0x00000005

#define _C2FIFOCON28_w_POSITION                  0x00000000
#define _C2FIFOCON28_w_MASK                      0xFFFFFFFF
#define _C2FIFOCON28_w_LENGTH                    0x00000020

#define _C2FIFOINT28_RXNEMPTYIF_POSITION         0x00000000
#define _C2FIFOINT28_RXNEMPTYIF_MASK             0x00000001
#define _C2FIFOINT28_RXNEMPTYIF_LENGTH           0x00000001

#define _C2FIFOINT28_RXHALFIF_POSITION           0x00000001
#define _C2FIFOINT28_RXHALFIF_MASK               0x00000002
#define _C2FIFOINT28_RXHALFIF_LENGTH             0x00000001

#define _C2FIFOINT28_RXFULLIF_POSITION           0x00000002
#define _C2FIFOINT28_RXFULLIF_MASK               0x00000004
#define _C2FIFOINT28_RXFULLIF_LENGTH             0x00000001

#define _C2FIFOINT28_RXOVFLIF_POSITION           0x00000003
#define _C2FIFOINT28_RXOVFLIF_MASK               0x00000008
#define _C2FIFOINT28_RXOVFLIF_LENGTH             0x00000001

#define _C2FIFOINT28_TXEMPTYIF_POSITION          0x00000008
#define _C2FIFOINT28_TXEMPTYIF_MASK              0x00000100
#define _C2FIFOINT28_TXEMPTYIF_LENGTH            0x00000001

#define _C2FIFOINT28_TXHALFIF_POSITION           0x00000009
#define _C2FIFOINT28_TXHALFIF_MASK               0x00000200
#define _C2FIFOINT28_TXHALFIF_LENGTH             0x00000001

#define _C2FIFOINT28_TXNFULLIF_POSITION          0x0000000A
#define _C2FIFOINT28_TXNFULLIF_MASK              0x00000400
#define _C2FIFOINT28_TXNFULLIF_LENGTH            0x00000001

#define _C2FIFOINT28_RXNEMPTYIE_POSITION         0x00000010
#define _C2FIFOINT28_RXNEMPTYIE_MASK             0x00010000
#define _C2FIFOINT28_RXNEMPTYIE_LENGTH           0x00000001

